{"name":"司马法","description":"《司马法》是我国古代重要兵书之一。大约成书于战国初期。据《史记·列传》记载：“齐威王(公元前356-前320年)使大夫追论古者司马兵法而附穰苴于其中，因号曰《司马穰苴兵法》。”《司马法》流传至今已两千多年，亡佚很多，现仅残存五篇。但就在这残存的五篇中，也还记载着从殷周到春秋、战国时期的一些古代作战原则和方法，对我们研究那个时期的军事思想，提供了重要的资料。","articles":[{"title":"仁本","content":["古者，以仁为本，以义治之之谓正。正不获意则权。权出于战，不出于中人。是故杀人安人，杀之可也；攻其国，爱其民，攻之可也；以战止战，虽战可也。故仁见亲，义见说，智见恃，勇见身，信见信。内得爱焉，所以守也；外得威焉，所以战也。战道：不违时，不历民病，所以爱吾民也；不加丧，不因凶，所以爱夫其民也；冬夏不兴师，所以兼爱其民也。故国虽大，好战必亡；天下虽安，忘战必危。天下既平，天下大恺，春蒐秋狝，诸侯春振旅，秋治兵，所以不忘战也。","古者，逐奔不过百步，纵绥不过三舍，是以明其礼也。不穷不能而哀怜伤病，是以明其仁也。成列而鼓是以明其信也。争义不争利，是以明其义也。又能舍服，是以明其勇也。知终知始，是以明其智也。六德以时合教，以为民纪之道也，自古之政也。","先王之治，顺天之道，设地之宜，官司之德，而正名治物，立国辨职，以爵分禄，诸侯说怀，海外来服，狱弭而兵寝，圣德之治也。","其次，贤王制礼乐法度，乃作五刑，兴甲兵以讨不义。巡狩省方，会诸侯，考不同。其有失命、乱常、背德、逆天之时，而危有功之君，徧告于诸侯，彰明有罪。乃告于皇天上帝日月星辰，祷于后土四海神祗山川冢社，乃造于失王。然后冢宰征师于诸侯曰：“某国为不道，征之，以某年月日师至于某国，会天于正刑”。冢宰与百官布令于军曰：“入罪人之地，无暴圣祗，无行田猎，无毁土功，无燔墙屋，无伐林木，无取六畜，禾黍、器械，见其老幼，奉归勿伤。虽遇壮者，不校勿敌，敌若伤之，医药归之。”既诛有罪，王及诸侯修正其国，举贤立明，正复厥职。","王霸之所以治诸侯者六：以土地形诸侯，以政令平诸侯，以礼信亲诸侯，以礼力说诸侯，以谋人维诸侯，以兵革服诸侯。同患同利以台诸侯，比小事大以和诸侯。","会之以发禁者九。凭弱犯寡则眚之。贼贤害民则伐之。暴内陵外则坛之。野荒民散则削之。负固不服则侵之。贼杀其亲则正之。放弑其君则残之。犯令陵政则杜之。外内乱，禽兽行，则灭之。"]},{"title":"天子之义","content":["天子之义必纯取法天地而观于先圣。士庶之义，必奉于父母而正于君长。故虽有明君，士不先教，不可用也。","古之教民，必立贵贱之伦经，使不相陵。德义不相逾，材技不相掩，勇力不相犯，故力同而意和也。古者，国容不入军，军容不入国，故德义不相逾。上贵不伐之士，不伐之士，上之器也，苟不伐则无求，无求则不争。国中之听，必得其情，军旅之听，必得其宜，故材技不相掩。从命为士上赏，犯命为士上戮，故勇力不相犯。既致教其民，然后谨选而使之。事极修，则百官给矣，教极省，则民兴良矣，习惯成，则民体俗矣，教化之至也。","古者，逐奔不远，纵绥不及，不远则难诱，不及则难，陷。以礼为固，以仁为胜，既胜之后，其教可复，是以君子贵之也。","有虞氏戒于国中，欲民体其命也。夏后氏誓于军中，欲民先成其虑也。殷誓于军门之外，欲民先意以行事也。周将交刃而誓之，以致民志也。","夏后氏正其德也，未用兵之刃，故其兵不杂。殷义也，始用兵之刃矣。周力也，尽用兵之刃矣。","夏赏于朝，贵善也。殷戮于市，威不善也。周赏于朝，戮于市，劝君子惧小人也。三王彰其德一也。","兵不杂则不利。长兵以卫，短兵以守，太长则难犯太短则不及。太轻则锐，锐则易乱。太重则钝，钝则不济。","戎车：夏后氏曰钩车，先正也；殷曰寅车，先疾也；周日元戎，先良也。旗：夏后氏玄，首人之孰也，殷白，天之义也；周黄，地之道也。章：夏后氏以日月，尚明也；殷以虎，尚威也；周以龙，尚文也。","师多务威则民诎，少威则民不胜。上使民不得其义，百姓不得其叙，技用不得其利，牛马不得其任，有司陵之，此谓多威。多威则民诎。上不尊德而任诈匿，不尊道而任勇力，不贵用命而贵犯命，不贵善行而贵暴行，陵之有司，此谓少威，少威则民不胜。","军旅以舒为主，舒则民力足。虽交兵致刃，徒不趋，车不驰，逐奔不逾列，是以不乱。军旅之固，不失行列之政，不绝人马之力，迟速不过诫命。","古者，国容不入军，军容不入国。军容入国，则民德废；国容入军，则民德弱。故在国言文而语温，在朝恭以逊，修己以待人，不召不至，不问不言，难进易退，在军抗而立，在行遂而果，介者不拜，兵车不式，城不上趋，危事不齿。故礼与法表里也，文与武左右也。","古者贤王，明民之德，尽民之善，故无废德，无简民，赏无所生，罚无所试。有虞氏不赏不罚，而民可用，至德也。夏赏而不罚，至教也。殷罚而不赏，至威也。周以赏罚，德衰也。赏不逾时，欲民速得为善之利也。罚不迁列，欲民速规为不善之害也。大捷不赏，上下皆不伐善。上苟不伐善，则不骄矣，下苟不伐善，必亡等矣。上下不伐善若此，让之至也。大败不诛，上下皆以不善在己，上苟以不善在己，必悔其过，下苟以不善在己，必远其罪。上下分恶若此，让之至也。","古者戌军，三年不兴，覩民之劳也；上下相报若此，和之至也。得意则恺歌，示喜也。偃伯灵台，答民之劳，示休也。"]},{"title":"定爵","content":["凡战，定爵位，著功罪，收游士，申教诏，询厥众，求厥技，方虑极物，变嫌推疑，养力索巧，因心之动。","凡战，固众，相利，治乱，进止服正，成耻，约法，省罚，小罪乃杀，小罪胜，大罪因。","顺天、阜财、怿众、利地、右兵，是谓五虑。顺天奉时，阜财因敌。怪众勉若。利地，守隘险阻。右兵，弓矢御、殳矛守、戈戟助。凡五兵五当，长以卫短，短以救长。迭战则久，皆战则强。见物与侔，是谓两之。主固勉若，视敌而举。","将心，心也，众心，心也。马、牛、车、兵、佚饱，力也。教惟豫，战惟节。将军，身也，卒，支也，伍，指姆也。","凡战，智也。斗，勇也。陈，巧也。用其所欲，行其所能，废其不欲不能。于敌反是。","凡战，有天，有财，有善。时日不迁，龟胜微行，是谓有天。众有有，因生美，是谓有财。人习陈利，极物以豫，是调有善。人勉及任，是谓乐人。","大军以固，多力以烦，堪物简治，见物应卒，是谓行豫。","轻车轻徒，弓矢固御，是谓大军。","密静多内力，是谓固陈。因是进退，是谓多力。","上暇人数，是谓烦陈。然有以职，是谓堪物。因是辨物，是谓简治。","称众，因地，因敌令陈；攻战守，进退止，前后序，车徒因，是谓战参。","不服、不信、不和、怠、疑、厌、慑、枝、拄、诎、顿、肆、崩、缓，是渭战患。","骄傲，慑慑，吟旷，虞惧，事悔，是谓毁折。","大小，坚柔，参伍，众寡，凡两，是谓战权。","凡战，间远，观迩，因时，因财，发信，恶疑。作兵义，作事时，使人惠，见敌静，见乱暇，见危难无忘其众。","居国惠以信以信，在军广以武，刃上果以敏。居国和，在军法，刃上察。居国见好，在军见方，刃上见信。","凡陈，行惟疏，战惟密，兵惟杂，人教厚，静乃治。威利章，相守义，则人勉。虑多成则人服。时中服厥次治。物既章，目乃明。虑既定，心乃强。进退无疑见敌无谋，听诛。无诳其名，无变其旗。","凡事善则长，因古则行。誓作章，入乃强，灭历祥。灭厉之道：一曰义。被之以信，临之以强，成基一天下之形，人莫不就，是谓兼用其人。一曰权。成其溢，夺其好，我自其外，使自其内。","一曰人，二曰正，三曰辞，四曰巧，五曰火，六曰水，七曰兵，是谓七政。荣、利、耻、死，是谓四守。容色积威，不过改意。凡此道也。","唯仁有亲。有仁无信，反败厥身。","人人，正正，辞辞，火火。","凡战之道：既作其气，因发其政。假之以色，道之以辞。因惧而戒，因欲而事，蹈敌制地，以职命之，是谓战法。","凡人之形；由众之求，试以名行，必善行之。若行不行，身以将之。若行而行，因使勿忘，三乃成章，人生之宜，谓之法。","凡治乱之道，一曰仁，二曰信，三曰直，四曰一，五曰义，六曰变，七曰专。","立法，一曰受，二曰法，三曰立，四曰疾，五曰御其服，六曰等其色，七曰百官宜无淫服。","凡军，使法在己曰专。与下畏法曰法。军无小听，战无小利，日成，行微曰道。","凡战，正不行则事专，不服则法。不相信则一，若怠则动之，若疑则变之，若人不信上，则行其不复。自古之政也。"]},{"title":"严位","content":["凡战之道，位欲严，政欲栗，力欲窕，气欲闲，心欲一。","凡战之道，等道义，立卒伍，定行列，正纵横，察名实。立进俯，坐进跪。畏则密，危则坐。远者视之则不畏，迹者勿视则不散。位，下左右，下甲坐，誓徐行之，位逮徒甲，筹以轻重。振马躁，徒甲畏亦密之，跪坐、坐伏，则膝行而宽誓之。起、躁，鼓而进，则以铎止之。衔枚、誓、糗、坐，膝行而推之。执戮禁顾，噪以先之。若畏太甚，则勿戮杀，示以颜色，告之以所生，循省其职。","凡三军：人戒分日；人禁不息，不可以分食；方其疑惑，可师可服。","凡战：以力久，以气胜。以固久，以后胜，本心固，新气胜。以甲固，以兵胜。凡车以密固，徒以坐固，甲以重固，兵以轻胜。","人有胜心，惟敌之视。人有畏心，惟畏之视。两心交定，两利若一。两为之职，惟权视之。","凡战：以轻行轻则危，以重行重则无功，以轻行重则败，以重行轻则战，故战相为轻重。","舍谨甲兵，行慎行列，战谨进止。","凡战，敬则慊，率则服。上烦轻，上暇重。奏鼓轻舒鼓重。服肤轻，服美重。","凡马车坚，甲兵利，轻乃重。","上同无获，上专多死，上生多疑，上死不胜。","凡人，死爱，死怒，死威，死义，死利。凡战，教约人轻死，道约人死正。","凡战：若胜，若否。若天，若人。","凡战：三军之戒，无过三日；一卒之警，无过分日；一人之禁，无过瞬息。","凡大善用本，其次用末。执略守微，本末惟权。战也。","凡胜，三军一人，胜。","凡鼓，鼓旌旗，鼓车，鼓马，鼓徒，鼓兵，鼓首鼓足，七鼓兼齐。","凡战，既固勿重。重进勿尽，几尽危。","凡战，非陈之难，使人可陈难，非使可陈难，使人可用难，非知之难，行之难。","人方有性，性州异，教成俗，俗州异，道化俗。","凡众寡，既胜若否。兵不告利，甲不告坚，车不告固，马不告良，众不自多，未获道。","凡战，胜则与众分善。若将复战，则重赏罚。若使不胜，取过在己。复战，则誓以居前，无复先术。胜否勿反，是谓正则。","凡民，以仁救，以义战，以智决，以勇斗，以信专，以利劝，以功胜。故心中仁，行中义，堪物智也，堪大勇也，堪久信也。","让以和，人以洽，自予以不循，争贤以为人，说其心，效其力。","凡战，击其微静，避其强静；击其疲劳，避其闲窕；击其大惧，避其小惧，自古之政也。"]},{"title":"用众","content":["凡战之道，用寡固，用众治；寡利烦，众利正。用众进止，用寡进退。众以合寡，则远裹而阙之；若分而迭击，寡以待众；若众疑之，则自用之。擅利则释旗，迎而反之。敌若众，则相众而受裹。敌若寡若畏，则避之开之。","凡战，背风，背高，右高左险；历沛历圮，兼舍环龟。","凡战，设而观其作，视敌而举。待则循而勿鼓，待众之作；攻则屯而伺之。","凡战，众寡以观其变，进退以观其固，危而观其惧，静而观其怠，动而观其疑，袭而观其治。击其疑，加其卒，致其屈，袭其规。因其不避，阻其图，夺其虑，乘其惧。","凡从奔勿息，敌人或止于路，则虑之。凡近敌都，必有进路，退必有反虑。","凡战，先则弊，后则慑；息则怠，不息亦弊，息久亦反。","其慑书亲绝，是谓绝顾之虑；选良次兵，是谓益人之强；弃任节食，是谓开人之意；自古之政也。"]}]}