{"name":"孙膑兵法","description":"《兵法》是中国古代的著名兵书，也是《孙子兵法》后“孙子学派”的又一力作。《孙膑兵法》古称《齐孙子》，作者为孙膑，传说他是孙武的后代，在战国时期生于齐国阿、鄄之间（今山东阳谷、鄄城一带），曾和庞涓一块儿学习兵法。","articles":[{"title":"擒庞涓","content":["昔者，梁君将攻邯郸，使将军庞涓，带甲八万至于茬丘。齐君闻之，使将军忌子，带甲八万至..竞。庞子攻卫□□□。将军忌[ 子] ..卫□□，救与..曰：“若不救卫，将何为？”孙子曰：“请南攻平陵。平陵，其城小而县大，人众甲兵盛，东阳战邑，难攻也。吾将示之疑。吾攻平陵，南有宋，北有卫，当途有市丘，是吾粮途绝也，吾将示之不知事。”于是徙舍而走平陵。..陵，忌子召孙子而问曰：“事将何为？”孙子曰：“都大夫孰为不识事？”曰：“齐城、高唐。”孙子曰：“请取所..二大夫□以□□□臧□□都横卷四达环涂□横卷所□阵也。环涂甲之所处也。吾未甲劲，本甲不断。环涂击柀其后，二大夫可杀也。”于是段齐城、高唐为两，直将蚁附平陵。夹环涂夹击其后，齐城、高唐当术而大败。将军忌子召孙子问曰：“吾攻平陵不得而亡齐城、高唐，当术而厥。事将何为？”孙子曰：“请遣轻车西驰梁郊，以怒其气。分卒而从之，示之寡。”于是为之。庞子果弃其辎重，兼趣舍而至。孙子弗息而击之桂陵，而擒庞涓。故曰，孙子之所以为者尽矣。"]},{"title":"见威王","content":["孙子见威王，曰：“夫兵者，非士恒势也。此先王之傅道也。战胜，则所以在亡国而继绝世也。战不胜，则所以削地而危社稷也。是故兵者不可不察。然夫乐兵者亡，而利胜者辱。兵非所乐也，而胜非所利也。事备而后动，故城小而守固者，有委也；卒寡而兵强者，有义也。夫守而无委，战而无义，天下无能以固且强者。尧有天下之时，黜王命而弗行者七，夷有二，中国四，..素佚而致利也。战胜而强立；故天下服矣。昔者，神戌战斧遂；黄帝战蜀禄；尧伐共工；舜代劂□□而并三苗，□□..管；汤放桀；武王伐纣；帝奄反，故周公浅之。故曰，德不若五帝，而能不及三王，智不若周公，曰我将欲责仁义，式礼乐，垂衣裳，以禁争夺。此尧舜非弗欲也，不可得，故举兵绳之。"]},{"title":"威王问","content":["齐威王问用兵孙子曰：“两军相当，两将相望，皆坚而固，莫敢先举，为之奈何？”孙子答曰：“以轻卒尝之，贱而勇者将之，期于北，毋期于得。为之微阵以触其侧。是谓大得。”威王曰：“用众用寡有道乎？”孙子曰：“有。”威王曰：“我强敌弱，我众敌寡，用之奈何？”孙子再拜曰：“明王之问！夫众且强，犹问用之，则安国之道也，命之曰赞师。毁卒乱行，以顺其志，则必战矣。”威王曰：“敌众我寡，敌强我弱，用之奈何？”孙子曰：“命曰让威。必臧其尾，令之能归。长兵在前，短兵在□，为之流夸，以助其急者。□□毋动，以待敌能。”威王曰：“我出敌出，未知众少，用之奈何？”孙子[ 曰]： “命曰..”威王曰：“击穷寇奈何？”孙子[ 曰]： “..可以侍生计矣。”威王曰：“击均奈何？”孙子曰：“营而离之，我并卒而击之，毋令敌知之。然而不离，按而止。毋击疑。”威王曰：“以一击十，有道乎？”孙子曰：“有。攻其无备，出其不意。”威王曰：“地平卒齐，合而北者，何也？”孙子曰：“其阵无锋也。”威王曰：“令民素听，奈何？”孙子曰：“素信。”威王曰：“善哉言！兵势不穷。”..田忌问孙子曰：“患兵者何也？困敌者何也？壁延不得者何也？失天者何也？失地者何也？失人者何也？请问此六者有道乎？”孙子曰：“有。患兵者地也，困敌者险也。故曰，三里沮洳将患军..涉将留大甲。故曰，患兵者地也，困敌者险也，壁延不得者寒也。□..”.. “奈何？”孙子曰：“鼓而坐之，十而揄之。”田忌曰：“行阵已定，动而令士必听，奈何？”孙子曰：“严而示之利。”田忌曰：“赏罚者，兵之急者耶？”孙子曰：“非。夫赏者，所以喜众，令士忘死也。罚者，所以正乱，令民畏上也。可以益胜，非其急者也。”田忌曰：“权、势、谋、诈，兵之急者耶？”孙子曰：“非也。夫权者，所以聚众也。势者，所以令士必斗也。谋者，所以令敌无备也。诈者，所以困敌也。可以益胜，非其急者也。”田忌忿然作色：“此六者，皆善者所用，而子大夫曰非急者也。然则其急者何也？”孙子曰：“料敌计险，必察远近，..将之道也。必攻不守，兵之急者也。..骨也。”田忌问孙子曰：“张军毋战有道？”孙子曰：“有。倅险增垒，净戒毋动，毋可□□，毋可怒。”田忌曰：“敌众且武，必战有道乎？”孙子曰：“有。埤垒广志，严正辑众，避而骄之，引而劳之，攻其无备，出其不意，必以为久。”田忌问孙子曰：“锥行者何也，雁行者何也？篡卒力士者何也？劲弩趋发者何也？飘风之阵者何也？众卒者何也？”孙子曰：“锥行者，所以冲坚毁锐也。雁行者，所以触侧应□[ 也] 。篡卒力士者，所以绝阵取将也。劲弩趋发者，所以甘战持久也。飘风之阵者，所以回□□□[ 也] 。众卒者，所以分功有胜也。”孙子曰：“明主、知道之将，不以众卒几功。”孙子出而弟子问曰：“威王、田忌臣主之问何如？”孙子曰：“威王问九，田忌问七，几知兵矣，而未达于道也。吾闻素信者昌，立义..用兵无备者伤，穷兵者亡。齐三世其忧矣。”"]},{"title":"陈忌问垒","content":["田忌问孙子曰：“吾卒..不禁，为之奈何？”孙子曰：“明将之问也。此者人之所过而不急也。此□之所以疾..志也。”田忌曰：“可得闻乎？”曰：“可。用此者，所以应猝窘处隘塞死地之中也。是吾所以取庞□而擒太子申也。”田忌曰：“善。事已往而形不见。”孙子曰：“蒺藜者，所以当沟池也。车者，所以当垒[ 也] 。□□[ 者]，所以当堞也。发者，所以当俾堄也。长兵次之，所以救其隋也。次之者，所以为长兵□也。短兵次之者，所以难其归而徼其衰也。弩次之者，所以当投机也。中央无人，故盈之以..卒已定，乃具其法。制曰：以弩次蒺藜，然后以其法射之。垒上弩戟分。法曰：见使谍来言而动..去守五里置候，令相见也。高则方之，下则圆之。夜则举鼓，昼则举旗。”"]},{"title":"篡卒","content":["孙子曰：兵之胜在于篡卒，其勇在于制，其巧在于势，其利在于信，其德在于道，其富在于亟归；其强在于休民，其伤在于数战。孙子曰：德行者，兵之厚积也。信者，兵[ 之] 明赏也。恶战者，兵之王器也。取众者，胜囗囗囗也。孙子曰：恒胜有五：得主专制，胜。知道，胜，得众，胜。左右和，胜。量敌计险，胜。孙子曰：恒不胜有五：御将不胜。不知道不胜。乖将不胜。不用间不胜。不得众不胜。孙子曰：胜在尽囗，明赏，选卒，乘敌之囗。是谓太武之葆。孙子曰：不得主弗将也..（以下为散简、缺文）..令，一曰信，二曰忠，三曰敢。安忠？忠王。安信？信赏。安敢？敢去不善。不忠于王，不敢用其兵。不信于赏，百姓弗德。不敢去不善，百姓弗畏。"]},{"title":"月战","content":["孙子曰：间于天地之间，莫贵于人。战囗囗囗囗不单。天时、地利、人和，三者不得，虽胜有殃。是以必付与而囗战，不得已而后战。故抚时而战，不复使其众。无方而战者小胜以付磨者也。孙子曰：十战而六胜，以星也。十战而七胜，以日者也。十战而八胜，以月者也。十战而九胜，月有..[ 十战] 而十胜，将善而生过者也。一单..（以下为散简、缺文）..所不胜者也五，五者有所壹，不胜。故战之道，有多杀人而不得将卒者，有得将卒而不得舍者，有得舍而不得将军者，有覆军杀将者。故得其道，则虽欲生不可得也。"]},{"title":"八阵","content":["孙子曰：智不足，将兵，自恃也。勇不足，将兵，自广也。不知道，数战不足，将兵，幸也。夫安万乘国，广万乘王，全万乘之民命者，唯知道。知道者，上知天之道，下知地之理，内得其民之心，外知敌之情，阵则知八阵之经，见胜而战，弗见而诤，此王者之将也。孙子曰：用八阵战者，因地之利，用八阵之宜。用阵三分，诲阵有锋，诲锋有后，皆侍令而动。斗一，守二。以一侵敌，以二收。敌弱以乱，先其选卒以乘之。敌强以治，先其下卒以诱之。车骑与战者，分以为三，一在于右，一在于左，一在于后。易则多其车，险则多其骑，厄则多其弩。险易必知生地、死地，居生击死。"]},{"title":"地葆","content":["孙子曰：凡地之道，阳为表，阴为里，直者为纲，术者为纪。纪纲则得，阵乃不惑，直者毛产，术者半死。凡战地也，日其精也，八风将来，必勿忘也。绝水、迎陵、逆流、居杀地、迎众树者，钧举也，五者皆不胜。南阵之山，生山也。东阵之山，死山也。东注之水，生水也。北注之水，死水。不流，死水也。五地之胜曰：山胜陵，陵胜阜，阜胜陈丘，陈丘胜林平地。五草之胜曰：藩、棘、椐、茅、莎。五壤之胜：青胜黄，黄胜黑，黑胜赤，赤胜白，白胜青。五地之败曰：谿、川、泽、斥。五地之杀曰，天井、天宛、天离、天隙、天柖。五墓，杀地也，勿居也，勿囗也。春毋降，秋毋登，军与阵皆毋政前右，右周毋左周。"]},{"title":"势备","content":["孙子曰：夫陷齿戴角，前爪后距，喜而合，怒而斗，天之道也，不可止也。故无天兵者自为备，圣人之事也。黄帝作剑，以阵象之。羿作弓弩，以势象之。禹作舟车，以变象之。汤、武作长兵，以权象之。凡此四者，兵之用也。何以知剑之为阵也？旦暮服之，未必用也，故曰，阵而不战，剑之为阵也。剑无锋，虽孟贲[ 之勇] 不敢囗囗囗。阵无锋，非孟贲之勇也敢将而进者，不知兵之至也。剑无首铤，虽巧士不能进囗囗，阵无后，非巧士敢将而进者，不知兵之情者。故有锋有后，相信不动，敌人必走。无锋无后，..券不道。何以知弓弩之为势也？发于肩膺之间，杀人百步之外，不识其所道至。故曰，弓弩势也。何以[ 知舟车] 之为变也？高则..何以知长兵之[ 为] 权也？击非高下非..卢毁肩，故曰，长兵权也。凡此四..中之近..也，视之近，中之远。权者，昼多旗，夜多鼓，所以送战也。凡此四者，兵之用也。囗皆以为用，而莫彻其道。..功。凡兵之道四：曰阵，曰势，曰变，曰权。察此四者，所以破强敌，取猛将也。"]},{"title":"兵情","content":["孙子曰：“若欲知兵之情，弩矢其法也。矢，卒也。弩，将也。发者，主也。矢，金在前，羽在后，故犀而善走。前..今治卒则后重而前轻，阵之则辨，趣之敌则不听，人治卒不法矢也。弩者，将也。弩张柄不正，偏强偏弱而不和，其两洋之送矢也不壹，矢虽轻重得，前后适，犹不中[ 招也] ..将之用心不和..得，犹不胜敌也。矢轻重得，前[ 后] 适，而弩张正，其送矢壹，发者非也，犹不中招也。卒轻重得，前..兵..犹不胜敌也。故曰，弩之中彀合于四，兵有功..将也，卒也，□也，故曰，兵胜敌也，不异于弩之中招也。此兵之道也。（以下为散简）..所循以成道，知其道者，兵有功，主有名。"]},{"title":"行篡","content":["孙子曰：用兵移民之道，权衡也。权衡，所以篡贤取良也。阴阳，所以聚众合敌也。正衡再累既忠，是谓不穷。称乡县衡，虽其宜也。私公之财壹也，夫民有不足于寿而有余于货者，有不足于货而有余于寿者。唯明王圣人知之，故能留之。死者不毒，夺者不愠。此无穷..民皆尽力。近者弗则远者无能。货多则辨，辨则民不德其上。货少则□，□则天下以为尊。然则为民赇也，吾所以为赇也，此兵之久也。用兵之国之宝也。"]},{"title":"杀士","content":["孙子曰：明爵禄而..（以下为散简）..杀士则士....知之。知士可信，毋令人离之。必胜乃战，毋令人知之。当战毋忘旁毋....必审而行之。士死.."]},{"title":"延气","content":["孙子曰：合军聚众，[ 务在激气] ，复徙合军，务在治兵利气。临境近敌，务在厉气。战日有期，务在断气。今日将战，务在延气。..以威三军之士，所以激气也。将军令..其令，所以利气也。将军乃..短衣絜裘，以劝士志，所以厉气也。将军令，令军人人为三日粮，国人家为..［所以] 断气也。将军召将卫人者而告之曰：饮食毋..[ 所] 以延气..也。（以下为散简）..营也。以易营之，众而贵武，敌必败。气不利则拙，拙则不及，不及则失利，失利....气不厉则慑，慑则众□，众....而弗救，身死家残。将军召使而勉之，击.."]},{"title":"官一","content":["孙子曰：凡处卒利阵体甲兵者，立官则以身宜，贱令以采章，乘削以伦物，序行以□□，制卒以州闾，授正以乡曲，辨疑以旌舆，申令以金鼓，齐兵以从迹，庵结以人雄，邋军以索阵，茭肆以囚逆，陈师以危□，射战以云阵，御裹以羸渭，取啄以阖燧，即败以包□，奔救以皮傅，燥战以错行。用□以正□，用轻以正散，攻兼用行城，□地□□用方，迎陵而阵用刲，险□□□用圜，交易武退用兵，□□陈临用方翼，汜战接厝用喙逢，囚险解谷以□远，草驵沙荼以阳削，战胜而阵以奋国，而..为畏以山胠。秦怫以透迤，便罢以雁行，险厄以杂管。还退以蓬错，绕山林以曲次，袭国邑以水则，辨夜退以明简，夜警以传节。厝入内寇以棺士，遇短乒以必舆，火输积以车。阵刃以锥行，阵少卒以合杂。合杂，所以御裹也。修行连削，所以结阵也。云折重杂，所权趮也。猋凡振陈，所以乘疑也。隐匿谋诈，所以钓战也。龙隋陈伏，所以山斗也。□□乖举，所以厌津也。□□□卒，所以□□也。不意侍卒，所以昧战也。遏沟□陈，所以合少也。疏削明旗，所以疑敌也。剽阵车，所以从遗也。椎下移师，所以备强也。浮沮而翼，所以燧斗也。禅蘩避，所以莠也。筒练剽便，所以逆喙也。坚阵敦□，所以攻槥也。揆断藩薄，所以眩疑也。伪遗小亡，所以聭敌也。重害，所以茭□也。顺明到声，所以夜军也。佰奉离积，所以利胜也。刚者，所以御劫也。更者，所以过□也。□者，所以御□也。..者，所以厌□也。胡退侍入，所以解困也。"]},{"title":"强兵","content":["威王问孙子曰：“..齐士教寡人强兵者，皆不同道。..[ 有] 教寡人以政教者，有教寡人以..[ 有教] 寡人以散粮者，有教寡人以静者，..之教□□行之教奚..[ 孙子曰]： “..皆非强兵之急者也。”威[ 王]..孙子曰：“富国。”威王曰：“富国..厚威王、宣王以胜诸侯，至于..”"]},{"title":"十阵","content":["凡阵有十：有方阵，有圆阵，有疏阵，有数阵，有锥行之阵，有雁行之阵，有钩行之阵，有玄襄之阵，有火阵，有水阵。此皆有所利。方阵者，所以也。圆阵者，所以也。疏阵者，所以也。数阵者，为不可掇。锥行之阵者，所以决绝也。雁行之阵者，所以接射也。钩行之阵者，所以变质易虑也。玄襄之阵者，所以疑众难故也。火阵者，所以拔也。水阵者，所以伥固也。方阵之法，必薄中厚方，居阵在后。中之薄也，将以也。重□其□，将以也。居阵在后，所以..[ 圆阵之法]..[ 疏阵之法] ，其甲寡而人之少也，是故坚之。武者在旌旗，是人者在兵。故必疏矩间，多其旌旗羽旄，砥刃以为旁。疏而不可蹙，数而不可军者，在于慎。车毋驰，徒人毋趋。凡疏阵之法，在为数丑，或进或退，或击或，或与之征，或要其衰。然则疏可以取锐矣。数阵之法，毋疏矩间，戚而行首，积刃而信之，前后相保，变□□□，甲恐则坐，以声坐□，往者弗送。来者弗止，或击其迂，或辱其锐，笲之而无间，山而退。然则数不可掇也。锥行之阵，卑之若剑，末不锐则不入，刃不薄则不，本不厚则不可以列阵。是故末必锐，刃必薄，本必鸿。然则锥行之阵可以决绝矣。[ 雁行之阵] ，..中，此谓雁阵之任。前列若，后列若狸，三..阙罗而自存。此之谓雁阵之任。钩行之阵，前列必方，左右之和必钩。三声既全，五采必具，辨吾号声，知五旗。无前无后，无..玄襄之阵，必多旌旗羽旄，鼓庄，甲乱则坐，车乱则行，已治者□，榼榼啐啐，若从天下，若从地出，徒来而不屈，终日不拙。此之谓玄襄之阵。火战之法，沟垒已成，重为沟堑，五步积薪，必均疏数，从役有数，令人为属枇，必轻必利，风辟..火既自覆，与之战弗克，坐行而北。火战之法，下而衍以，三军之士无所出泄。若此，则可火也。陵猋蒋，薪荛既积，营窟未谨。如此者，可火也。以火乱之，以矢雨之，鼓噪敦兵，以势助之。火战之法。水战之法，必众其徒而寡其车，令之为钩楷苁柤贰辑□绛皆具。进则必遂，退则不蹙，方蹙从流，以敌之人为招。水战之法，便舟以为旗，驰舟以为使，敌往则遂，敌来则蹙，推攘因慎而饬之，移而革之，阵而□之，规而离之。故兵有误车有御徒，必察其众少，击舟津，示民徒来。水战之法也。"]},{"title":"十问","content":["兵问曰：交和而舍，粮食均足，人兵敌衡，客主两惧。敌人圆阵以胥，因以为固，击[ 之奈何？曰] ：击此者，三军之众分而为四五，或傅而佯北，而示之惧。彼见我惧，则遂分而不顾。因其乱毁其固。驷鼓同举，五遂俱傅。五遂俱至，三军同利。此击圆之道也。交和而舍，敌富我贫，敌众我少，敌强我弱，其来有方，击之奈何？曰：击此者，□阵而□之，规而离之，合而佯北，杀将其后，勿令知之。此击方之道也。交和而舍，敌人既众以强，劲捷以刚，锐阵以胥，击之奈何？击此者，必三而离之，一者延而衡，二者[□□□□□] 恐而下惑，下上既乱，三军大北。此击锐之道也。交和而舍，敌既众以强，延阵以衡，我阵而待之，人少不能，击之奈何？击此者，必将三分我兵，练我死士，二者延阵张翼，一者材士练兵，期其中极。此杀将击衡之道也。交和而舍，我人兵则众，车骑则少，敌人十倍，击之奈何？击此者，当保险带隘，慎避广易。故易则利车，险则利徒。此击车之道也。交和而舍，我车骑则众，人兵则少，敌人十倍，击之奈何？击此者，慎避险阻，决而导之，抵诸易。敌虽十倍，便我车骑，三军可击。此击徒人之道也。交和而舍，粮食不属，人兵不足俧，绝根而攻，敌人十倍，击之奈何？曰：击此者，敌人既□而守阻，我..反而害其虚。此击争□之道也。交和而舍，敌将勇而难惧，兵强人众自固，三军之士皆勇而无虑，其将则威，其兵则武，而理强粮瞍，诸侯莫之或待。击之奈何？曰：击此者，告之不敢，示之不能，坐拙而待之，以骄其意，以惰其志，使敌弗识。因击其不□，攻其不御，压其骀，攻其疑。彼既贵既武，三军徙舍，前后不相睹，故中而击之，若有徒与。此击强众之道也。交和而舍，敌人保山而带阻，我远则不接，近则无所，击之奈何？击此者，彼敛阻移□□□□□则危之，攻其所必救，使离其固，以揆其虑，施伏设援，击其移庶。此击保固之道也。交和而舍，客主两阵，敌人形箕，计敌所愿，欲我陷覆，击之奈何？击此者，渴者不饮，饥者不良，三分用其二，期于中极，彼既□□，材士练兵，击其两翼，□彼□喜□□三军大北。此击箕之道也。"]},{"title":"略甲","content":["略甲之法，敌之人方阵□□无□....欲击之，其势不可，夫若此者，下之....以国章，欲战若狂，夫昔此者，少阵....反，夫若此者，以众卒从之，篡卒因之，必将....篡卒因之，必..（以下为散简）..左右旁伐以相趋，此谓钩击。..之气不藏于心，三军之众□循之知不....将分□军以修□□□□寡而民....威□□其难将之□也。分其众，乱其....阵不厉，故列不....远揄之，敌倦以远....治，孤其将，荡其心，击....其将勇，其卒众....彼大众将之....卒之道.."]},{"title":"客主人分","content":["兵有客之分，有主人之分。客之分众，主人之分少。客倍主人半，然可敌也。负..定者也。客者，后定者也。主人安地抚势以胥。夫客犯隘逾险而至，夫犯隘..退则刎颈，进不敢拒敌，其故何也？势不便，地不利也。势便地利则民自..自退。所谓善者战，便势利地者也。带甲数十万，民有余粮弗得食也，有余..居兵多而用兵少也，居者有余而用者不足。带甲数十万，千千而出，千千而□之..万万以遗我。所谓善战者，善翦断之，如□会捝者也。能分人之兵，能按人之兵，则锱[ 铢] 而有余。不能分人之兵，不能按人之兵，则数倍而不足。众者胜乎？则投算而战耳。富者胜乎？则量粟而战耳。兵利甲坚者胜乎？则胜易知矣。故富未居安也，贫未居危也；众未居胜也，少[ 未居败也] 。以决胜败安危者，道也。敌人众，能使之分离而不相救也，受敌者不得相..以为固，甲坚兵利不得以为强，士有勇力不得以卫其将，则胜有道矣。故明主、知道之将必先□，可有功于未战之前，故不失；可有之功于已战之后，故兵出而有功，入而不伤，则明于兵者也。（以下为散简）..焉。为人客则先人作....兵曰：主人逆客于境，....客好事则....使劳，三军之士可使毕失其志，则胜可得而据也。是以按左抶右，右败而左弗能救；按右扶左，左败而右弗能救。是以兵坐而不起，避而不用，近者少而不足用，远者疏而不能.."]},{"title":"善者","content":["善者，敌人军□人众，能使分离而不相救也，受敌而不相知也。故沟深垒高不得以为固，车坚兵利不得以为威，士有勇力而不得以为强。故善者制险量阻，敦三军，利屈伸，敌人众能使寡，积粮盈军能使饥，安处不动能使劳，得天下能使离，三军和能使柴。故兵有四路、五动：进，路也；退，路也；左，路也；右，路也。进，动也；退，动也；左，动也；右，动也；默然而处，亦动也。善者四路必彻，五动必工。故进不可迎于前，退不可绝于后，左右不可陷于阻，默[ 然而处]，□□于敌之人。故使敌四路必穷，五动必忧。进则傅干前，退则绝于后，左右则陷于阻，默然而处，军不免于患。善者能使敌卷甲趋远，倍道兼行，倦病而不得息，饥渴而不得食。以此薄敌，战必不胜矣。我饱食而侍其饥也，安处以侍其劳也，正静以侍其动也。故民见进而不见退，蹈白刃而不还踵。"]},{"title":"五名五恭","content":["兵有五名：一曰威强，二曰轩骄，三曰刚至，四曰助忌，五曰重柔。夫威强之兵，则屈软而待之；轩骄之兵，则恭敬而久之；刚至之兵，则诱而取之；忌之乒，则薄其前，噪其旁，深沟高垒而难其粮；重柔之兵，则噪而恐之，振而捅之，出则击之，不出则回之。兵有五恭、五暴。何谓五恭？入境而恭，军失其常。再举而恭，军无所粮。三举而恭，军失其事。四举而恭，军无食。五举而恭，军不及事。入境而暴，谓之客。再举而暴，谓之华。三举而暴，主人惧。四举而暴，卒士见诈。五举而暴，兵必大耗。故五恭、五暴，必使相错也。"]},{"title":"兵失","content":["欲以敌国之民之所不安，正俗所..难敌国兵之所长，耗兵也。欲强多国之所寡，以应敌国之所多，速屈之兵也。备固，不能难敌之器用，陵兵也。器用不利，敌之备固，挫兵也。兵不..明者也。善阵，知背向，知地形，而兵数困，不明于国胜、兵胜者也。民..兵不能昌大功，不知会者也。兵夫民，不知过者也。兵用力多功少，不知时者也。兵不能胜大患，不能合民心者也。兵多悔，信疑者也。兵不能见福祸于未形，不知备者也。兵见善而怠，时至而疑，去非而弗能居，止道也。贪而廉，宠而敬，弱而强，柔而[ 刚] ，起道也。行止道者，天地弗能兴也。行起道者，天地.."]},{"title":"将义","content":["将者不可以不义，不义则不严，不严则不威，不威则卒弗死。故义者，兵之首也。将者不可以不仁，不仁则军不克，军不克则军无动。故仁者，兵之腹也。将者不可以无德，无德则无力，无力则三军之利不得。故德者，兵之手也。将者不可以不信，不信则令不行，令不行则军不，军不则无名。故信者；兵之足也。将者不可不智胜，不智胜..则军无□，故决者，兵之尾也。"]},{"title":"将德","content":["..赤子，爱之若狡童，敬之若严师，用之若土芥，将军....不失，将军之智也。不轻寡，不劫于敌，慎终若始，将军....而不御，君令不入军门，将军之恒也。入军..将不两生，军不两存，将军之....将军之惠也。赏不逾日，罚不还面，不维其人，不何....外辰，此将军之德也。"]},{"title":"将败","content":["将败：一曰不能而自能。二曰骄。三曰贪于位。四曰贪于财。[ 五曰□。]六曰轻。七曰迟。八曰寡勇。九曰勇而弱。十曰寡信。十一[ 曰] ..十四曰寡决。十五曰缓。十六曰怠。十七曰□。十八曰贼。十九曰自私。廿曰自乱。多败者多失。"]},{"title":"将失","content":["将失：一曰，失所以往来，可败也。二曰，收乱民而还用之，止北卒而还斗之，无资而有资，可败也。三曰，是非争，谋事辨讼，可败也。四曰，令不行，众不壹，可败也。五曰，下不服，众不为用，可败也。六曰，民苦其师，可败也。七曰，师老，可败也。八曰，师怀，可败也。九曰，兵遁，可败也。十曰，兵□不□，可败也。十一曰，军数惊，可败也。十二曰，兵道足陷，众苦，可败也。十三曰，军事险固，众劳，可败也。十四[ 曰]，□□□备，可败也。十五曰，日暮路远，众有至气，可败也。十六曰，..可败也。十七[ 曰] ，..众恐，可败也。十八曰，令数变，众偷，可败也。十九曰，军淮，众不能其将吏，可败也。廿曰，多幸，众怠，可败也。廿一曰，多疑，众疑，可败也。廿二曰，恶闻其过，可败也。廿三曰，与不能，可败也。廿四曰，暴露伤志，可败也。廿五曰，期战心分，可败也。廿六曰，恃人之伤气，可败也。廿七曰，事伤人，恃伏诈，可败也。廿八曰，军舆无□，[ 可败也。廿九曰，] □下卒，众之心恶，可败也。卅曰，不能以成阵，出于夹道，可败也。卅一曰，兵之前行后行之兵，不参齐于阵前，可败也。卅二曰，战而忧前者后虚，忧后者前虚，忧左者右虚，忧右者左虚，战而有忧，可败也。"]},{"title":"雄牝城","content":["城在渒泽之中，无亢山名谷，而有付丘于其四方者，雄城也，不可攻也。军食流水，[ 生水也，不可攻] 也。城前名谷，背亢山，雄城也，不可攻也。城中高外下者，雄城也，不可攻也。城中有付丘者，雄城也，不可攻也。营军趣舍，毋回名水，伤气弱志，可击也。城背名谷，无亢山其左右，虚城也，可击也。□尽烧者，死壤也，可击也。军食泛水者，死水也，可击也。城在发泽中，无名谷付丘者，牝城也，可击也。城在亢山间，无名谷付丘者，牝城也，可击也。城前亢山，背名谷，前高后下者，牝城也，可击也。"]},{"title":"五度九夺","content":["..矣。救者至，又重败之。故兵之大数，五十里不相救也。况近□□□□□数百里，此程兵之极也。故兵曰：积弗如，勿与持久。众弗如，勿与接和。□[ 弗如，勿与□□。□弗如，勿] 与□长。习弗如，毋当其所长。五度既明，兵乃横行。故兵..趋敌数。一曰取粮。二曰取水。三曰取津。四曰取途。五曰取险。六曰取易。七曰[ 取□。八曰取□。九] 曰取其所读贵。凡九夺，所以趋敌也。"]},{"title":"积疏","content":["..[ 积] 胜疏，盈胜虚，径胜行，疾胜徐，众胜寡，佚胜劳。积故积之，疏故疏之，盈故盈之，虚[ 故虚之，径故径] 之，行故行之，疾故疾之，[ 徐故徐之，众敌众] 之，寡故寡之，佚故佚之，劳故劳之。积疏相为变，盈虚[ 相为变，径行相为] 变，疾徐相为变，众寡相[ 为变，佚劳相] 为变。毋以积当积，毋以疏当疏，毋以盈当盈，毋以虚当虚，毋以疾当疾，毋以徐当徐，毋以众当众，毋以寡当寡，毋以佚当佚，毋以劳当劳。积疏相当，盈虚相[ 当，径行相当，疾徐相当，众寡] 相当，佚劳相当。敌积故可疏，盈故可虚，径故可行，疾[ 故可徐，众故可寡，件故可劳] 。.."]},{"title":"奇正","content":["天地之理，至则反，盈则败，□□是也。代兴代废，四时是也。有胜有不胜，玉行是也。有生有死，万物是也。有能有不能，万生是也。有所有余，有所不足，形势是也。故有形之徒，莫不可名。有名之徒，莫不可胜。故圣人以万物之胜胜万物，故其胜不屈。战者，以形相胜者也。形莫不可以胜，而莫知其所以胜之形。形胜之变，与天地相敝而不穷。形胜，以楚、越之竹书之而不足。形者，皆以其胜胜者也。以一形之胜胜万形，不可。所以制形壹也，所以胜不可壹也。故善战者，见敌之所长，则知其所短；见敌之所不足，则知其所有余。见胜如见日月。其错胜也，如以水胜火。形以应形，正也；无形而制形，奇也。奇正无穷，分也。分之以奇数，制之以五行，斗之以□□。分定则有形矣，形定则有名［矣］。..同不足以相胜也，故以异为奇。是以静为动奇，件为劳奇，饱为饥奇，治为乱奇，众为寡奇。发而为正，其未发者奇也。奇发而不报，则胜矣。有余奇者，过胜者也。故一节痛，百节不用，同体也。前败而后不用，同形也。故战势，大阵□断，小阵□解。后不得乘前，前不得然后。进者有道出，退者有道入。赏未行，罚未用，而民听令者，其令仍民之所能行也。赏高罚下，而民不听其令者，其令，民之所不能行也。使民虽不利，进死而下旋睡，孟贲之所难也，而责之民，是使水逆流也。故战势，胜者益之，败者代之，劳者息之，饥者食之。故民见□人而未见死，蹈白刃而不旋踵。故行水得其理，漂石折舟；用民得其性，则令行如流。"]}]}