{"name":"智囊(选录)","description":"《智囊全集》初编于明代天启六年（1626年），全书共收上起先秦、下迄明代的历代智囊故事1200余则，是一部中国人民智慧的创造史和实践史。书中所表现的人物，都在运用智慧和谋略创造历史。它既是一部反映古人巧妙运用聪明才智来排忧解难、克敌制胜的处世奇书，也是中国文化史上一部篇幅庞大的智谋锦囊。","articles":[{"title":"上智部·总序","content":["冯子曰：智无常局，以恰肖其局者为上。故愚夫或现其一得，而晓人反失诸千虑。何则？上智无心而合，非千虑所臻也。人取小，我取大；人视近，我视远；人动而愈纷，我静而自正；人束手无策，我游刃有余。夫是故，难事遇之而皆易，巨事遇之而皆细；其斡旋入于无声臭之微，而其举动出人意想思索之外；或先忤而后合，或似逆而实顺；方其闲闲，豪杰所疑，迄乎断断， 圣人不易。呜呼！智若此，岂非上哉！上智不可学，意者法上而得中乎？抑语云“下下人有上上智”，庶几有触而现焉？余条列其概，稍分四则，曰“见大”、曰“远犹”、曰“通简”、曰“迎刃”，而统名之曰“上智”。"]},{"title":"上智部·太公　孔子","content":["【原文】","太公望封于齐。齐有华士者，义不臣天子，不友诸侯，人称其贤。太公使人召之三，不至；命诛之。周公曰：“此人齐之高士，奈何诛之？”太公曰：“夫不臣天子，不友诸侯，望犹得臣而友之乎？望不得臣而友之，是弃民也；召之三不至，是逆民也。而旌之以为教首，使一国效之，望谁与为君乎？”","少正卯与孔子同时。孔子之门人三盈三虚。孔子为大司寇，戮之于两观之下。子贡进曰：“夫少正卯，鲁之闻人。夫子诛之，得无失乎？”孔子曰：“人有恶者五，而盗窃不与焉：一曰心达而险，二曰行僻而坚，三曰言伪而辩，四曰记丑而博，五曰顺非而泽。此五者，有一于此，则不免于君子之诛，而少正卯兼之。此小人之桀雄也，不可以不诛也。”","〔评〕齐所以无惰民，所以终不为弱国。韩非《五蠹》之论本此。","小人无过人之才，则不足以乱国。然使小人有才而肯受君子之驾驭，则又未尝无济于国，而君子亦必不概摈之矣。少正卯能煽惑孔门之弟子，直欲掩孔子而上之，可与同朝共事乎？孔子下狠手，不但为一时辩言乱政故，盖为后世以学术杀人者立防。","华士虚名而无用，少正卯似大有用而实不可用。壬人佥士，凡明主能诛之；闻人高士，非大圣人不知其当诛也。唐萧瑀好奉佛，太宗令出家。玄宗开元六年，河南参军郑铣阳、丞郭仙舟投匦献诗。敕曰：“观其文理，乃崇道教，于时用不切事情，宜各从所好。”罢官度为道士。此等作用，亦与圣人暗合。如使佞佛者尽令出家，谄道者即为道士，则士大夫攻乎异端者息矣。"]},{"title":"上智部·诸葛亮","content":["【原文】","有言诸葛丞相惜赦者。亮答曰：“治世以大德，不以小惠。故匡衡、吴汉不愿为赦。先帝亦言：‘吾周旋陈元方、郑康成间，每见启告，治乱之道悉矣，曾不及赦也。’若刘景升父子岁岁赦宥，何益于治乎？”及费祎为政，始事姑息，蜀遂以削。","〔评〕子产谓子太叔曰：“惟有德者，能以宽服民；其次莫如猛。夫火烈，民望而畏之，故鲜死焉；水懦弱，民狎而玩之，则多死焉。故宽难。”太叔为政，不忍猛而宽。于是郑国多盗，太叔悔之。仲尼曰：“政宽则民慢，慢则纠之以猛；猛则民残，残则施之以宽。宽以济猛，猛以济宽，政是以和。”商君刑及弃灰，过于猛者也；梁武见死刑辄涕泣而纵之，过于宽者也。《论语》赦小过，《春秋》讥肆大眚。合之，得政之和矣。"]},{"title":"上智部·汉光武帝","content":["【原文】","刘秀为大司马时，舍中儿犯法，军市令祭遵格杀之。秀怒，命取遵，主簿陈副谏曰：“明公常欲众军整齐，遵奉法不避，是教令所行，奈何罪之？”秀悦，乃以为刺奸将军，谓诸将曰：“当避祭遵。吾舍中儿犯法尚杀之，必不私诸将也！”","［冯述评］","罚必则令行，令行则主尊，世祖所以能定四方之难也。"]},{"title":"上智部·孔子","content":["【原文】","孔子行游，马逸食稼，野人怒，絷其马。子贡往说之，卑词而不得。孔子曰：“夫以人之所不能听说人，譬以太牢享野兽，以《九韶》乐飞鸟也！”乃使马圉往，谓野人曰：“子不耕于东海，予不游西海也，吾马安得不犯子之稼？”野人大喜，解马而予之。","［冯述评］","人各以类相通。述《诗》《书》于野人之前，此腐儒之所以误国也。马圉之说诚善，假使出子贡之口，野人仍不从。何则？文质貌殊，其神固已离矣。然则孔子曷不即遣马圉，而听子贡之往耶？先遣马圉，则子贡之心不服；既屈子贡，而马圉之神始至。圣人达人之情，故能尽人之用；后世以文法束人，以资格限人，又以兼长望人，天下事岂有济乎！"]},{"title":"上智部·丙吉 郭进","content":["【原文】","吉为相，有驭吏嗜酒，从吉出，醉呕丞相车上。西曹主吏白欲斥之。吉曰：“以醉饱之失去士，使此人复何所容？西曹第忍之，此不过污丞相车茵耳。”此驭吏，边郡人，习知边塞发奔命警备事。尝出，适见驿骑持赤白囊，边郡发奔命书驰至。驭吏因随驿骑至公车刺取，知虏入云中、代郡，遽归。见吉白状，因曰：“恐虏所入边郡，二千石长吏有老病不任兵马者，宜可豫视。”吉善其言，召东曹案边长吏科条其人。未已，诏召丞相、御史，问以所入郡吏。吉具对。御史大夫卒遽不能详知，以得谴让；而吉见谓忧边思职，驭吏力也。","进任山西巡检，有军校诣阙讼进者。上召，讯知其诬，即遣送进，令杀之。会并寇入，进谓其人曰：“汝能讼我，信有胆气。今赦汝罪，能掩杀并寇者，即荐汝于朝；如败，即自役河，毋污我剑也。”其人踊跃赴斗，竟大捷。进即荐擢之。","［冯述评］","容小过者，以一长酬；释大仇者，以死力报。唯酬报之情迫中，故其长触之而必试，其力激之而必竭。彼索过寻仇者，岂非大愚？"]},{"title":"上智部·魏元忠","content":["【原文】","唐高宗幸东都时，关中饥馑。上虑道路多草窃，命监察御史魏元忠检校车驾前后。元忠受诏，即阅视赤县狱，得盗一人，神采语言异于众。［边批：具眼。］命释桎梏，袭冠带乘驿以从，与人共食宿，托以诘盗。其人笑而许之，比及东都，士马万数，不亡一钱。","［冯述评］","因材任能，盗皆作使。俗儒以“鸡鸣狗盗之雄”笑田文，不知尔时舍鸡鸣狗盗都用不着也。"]},{"title":"上智部·范仲淹","content":["【原文】","范文正公用士，多取气节而略细故，如孙威敏、滕达道，皆所素重。其为帅日，辟置僚幕客，多取谪籍未牵复人。或疑之。公曰：“人有才能而无过，朝廷自应用之。若其实有可用之材，不幸陷于吏议，不因事起之，遂为废人矣。”故公所举多得士。","［冯述评］","天下无废人，所以朝廷无废事，非大识见人不及此。"]},{"title":"上智部·狄青","content":["【原文】","狄青起行伍十余年，既贵显，面涅犹存，曰：“留以劝军中！”[边批：大识量。]","［冯述评］","既不去面涅，便知不肯遥附梁公。"]},{"title":"上智部·邵雍","content":["【原文】","熙宁中，新法方行，州县骚然，邵康节闲居林下，门生故旧仕宦者皆欲投劾而归，以书问康节。答曰：“正贤者所当尽力之时。新法固严，能宽一分，则民受一分之赐矣。投劾而去何益？”［边批：正论。］","［冯述评］","李燔［冯注：朱晦庵弟子］常言：“人不必待仕宦有职事才为功业，但随力到处，有以及物，即功业也。”","莲池大师劝人作善事，或辞以无力，大师指凳曰：“假如此凳，欹斜碍路，吾为整之，亦一善也。”如此存心，便觉临难投劾者是宝山空回。","鲜于侁为利州路转运副使，部民不请青苗钱，王安石遣吏诘之，曰：“青苗之法，愿取则与，民自不愿，岂能强之？”东坡称侁“上不害法，中不废亲，下不伤民”，以为“三难”，仕途当以为法。"]},{"title":"上智部·萧何 任氏","content":["【原文】","沛公至咸阳，诸将皆争走金帛财物之府分之，何独先入收秦丞相、御史律令图书藏之。沛公具知天下阨塞、户口多少强弱处、民所疾苦者，以何得秦图书也。","宣曲任氏，其先为督道仓吏。秦之败也，豪杰争取金玉，任氏独窖仓粟。楚汉相距荥阳，民不得耕种，米石至万，而豪杰金玉尽归任氏。","［冯述评］","二人之智无大小，易地皆然也。","又蜀卓氏，其先赵人，用铁冶富。秦破赵，迁卓氏之蜀，夫妻推辇行。诸迁虏少用余财，争与吏求近处，处葭萌。唯卓氏曰：“此地狭薄。吾闻岷山之下沃野，下有蹲鸱［冯注：芋也］，至死不饥，民工于市，易贾。”乃求远迁。致之临邛，即铁山鼓铸，运筹贸易，富至敌国。其识亦有过人者。"]},{"title":"上智部·张飞","content":["【原文】","先主一见马超，以为平西将军，封都亭侯，超见先主待之厚也，阔略无上下礼，与先主言，常呼字，关羽怒，请杀之，先主不从，张飞曰：“如是，当示之以礼。”明日大会诸将，羽、飞并挟刃立直，超入，顾坐席，不见羽、飞座，见其直也，乃大惊。自后乃尊事先主。","［冯述评］","释严颜，诲马超，都是细心作用，后世目飞为粗人，大枉。"]},{"title":"上智部·唐高祖","content":["【原文】","李渊克霍邑。行赏时，军吏拟奴应募，不得与良人同。渊曰：“矢石之间，不辨贵贱；论勋之际，何有等差？宜并从本勋授。”","引见霍邑吏民，劳赏于西河，选其壮丁，使从军。关中军士欲归者，并授五品散官，遣归。或谏以官太滥，渊曰：“隋氏吝惜勋赏，致失人心，奈何效之？且收众以官，不胜于用兵乎？”"]},{"title":"上智部·卫青","content":["【原文】","大将军青兵出定襄。苏建、赵信并军三千余骑，独逢单于兵。与战一日，兵且尽，信降单于，建独身归青。议郎周霸曰：“自大将军出，未尝斩裨将。今建弃军，可斩以明将军之威。”长史安曰：“不然，建以数千卒当虏数万，力战一日，士皆不敢有二心。自归而斩之，是示后无反意也，不当斩。”青曰：“青以肺腑待罪行间，不患无威，而霸说我以明威，甚失臣意；且使臣职虽当斩将，以臣之尊宠而不敢专诛于境外，其归天子，天子自裁之，于以风为人臣者不敢专权，不亦可乎？”遂囚建诣行在，天子果赦不诛。","〔评〕卫青握兵数载，宠任无比，而上不疑，下不忌，唯能避权远嫌故。不然，虽以狄枢使之功名，犹不克令终，可不戒欤？","狄青为枢密使，自恃有功，颇骄蹇，怙惜士卒，每得衣粮，皆曰：“此狄家爷爷所赐。”朝廷患之。时文潞公当国，建言以两镇节使出之，青自陈无功而受镇节，无罪而出外藩。仁宗亦以为然，向潞公述此语，且言狄青忠臣。潞公曰：“太祖岂非周世宗忠臣？但得军心，所以有陈桥之变。”上默然。青犹未知，到中书自辨，潞公直视之，曰：“无他，朝廷疑尔。”青惊怖，却行数步。青在镇，每月两遣中使抚问，青闻中使来，辄惊疑终日，不半年，病作而卒。皆潞公之谋也。"]},{"title":"上智部·李愬","content":["【原文】","节度使李愬既平蔡，械吴元济送京师。屯兵鞠场，以待招讨使裴度。度入城，愬具橐橐出迎，拜于路左，度将避之。愬曰：“蔡人顽悖，不识上下之分数十年矣。愿公因而示之，使知朝廷之尊。”［边批：其意甚远。］度乃受之。"]},{"title":"上智部·李泌","content":["【原文】","肃宗子建宁王倓性英果，有才略。从上自马嵬北行，兵众寡弱，屡逢寇盗，倓自选骁勇，居上前后，血战以卫上。上或过时未食，倓悲泣不自胜，军中皆属目向之，上欲以倓为天下兵马元帅，使统诸将东征，李泌曰：“建宁诚元帅才；然广平，兄也，若建宁功成，岂使广平为吴太伯乎？”上曰：“广平，冢嗣也，何必以元帅为重？”泌曰：“广平未正位东宫，今天下艰难，众心所属，在于元帅，若建宁大功既成，陛下虽欲不以为储副，同立功者其肯已乎？太宗、太上皇即其事也。”上乃以广平王俶为天下兵马元帅，诸将皆以属焉。倓闻之，谢泌曰：“此固倓之心也。”"]},{"title":"上智部·白起祠","content":["【原文】","白起贞元中，咸阳人上言见白起，令奏云：“请为国家捍御西陲，正月吐蕃必大下。”既而吐蕃果入寇，败去。德宗以为信然，欲于京城立庙，赠起为司徒。李泌曰：“臣闻‘国将兴，听于人’。今将帅立功，而陛下褒赏白起，臣恐边将解体矣。且立庙京师，盛为祷祝，流传四方，将召巫风。臣闻杜邮有旧祠，请敕府县修葺，则不至惊人耳目。”上从之。"]},{"title":"上智部·宋太祖 何真","content":["【原文】","宋艺祖推戴之初，陈桥守门者拒而不纳，遂如封丘门，抱关吏望风启钥。及即位，斩封丘吏而官陈桥者，以旌其忠。宋太祖","至正间，广东王成、陈仲玉作乱。东莞人何真请于行省，举义兵，擒仲玉以献。成筑砦自守，围之，久不下。真募人能缚成者，予钱十千，于是成奴缚之以出，真笑谓成曰：“公奈何养虎为害？”成惭谢。奴求赏，真如数与之。使人具汤镬，驾诸转轮车上。成惧，谓将烹己。真乃缚奴于上。促烹之；使数人鸣鼓推车，号于众曰：“四境有奴缚主者，视此!”人服其赏罚有章，岭表悉归心焉。","〔评〕高祖戮丁公而封项伯，赏罚为不均矣；光武封苍头子密为不义侯，尤不可训。当以何真为正。"]},{"title":"上智部·宋太祖","content":["【原文】","初，太祖谓赵普曰：“自唐季以来数十年，帝王凡十易姓，兵革不息，其故何也？”普曰：“由节镇太重，君弱臣强，今唯稍夺其权，制其钱谷，收其精兵，则天下自安矣。”语未毕，上曰：“卿勿言，我已谕矣。”顷之，上与故人石守信等饮，酒酣，屏左右，谓曰：“我非尔曹之力，不得至此，念汝之德。无有穷已，然为天子亦大艰难，殊不若为节度使之乐，吾今终夕未尝安枕而卧也。”守信等曰：“何故？”上曰：“是不难知，居此位者，谁不欲为之？”守信等皆惶恐顿首，曰：“陛下何为出此言？”上曰：“不然，汝曹虽无心，其如麾下之人欲富贵何？一旦以黄袍加汝身，虽欲不为，不可得也。”守信等乃皆顿首，泣曰：“臣等愚不及此，唯陛下哀怜，指示可生之路。”上曰：“人生如白驹过隙，所欲富贵者，不过多得金钱，厚自娱乐，使子孙无贫乏耳，汝曹何不释去兵权，择便好田宅市之，为子孙立永久之业，多置歌儿舞女，日饮酒相欢，以终其天年。君臣之间，两无猜嫌。不亦善乎？”皆再拜曰：“陛下念臣及此，所谓生死而骨肉也。”明日皆称疾，请解兵权。","熙宁中，作坊以门巷委狭，请直而宽广之。神宗以太祖创始，当有远虑，不许。既而众工作苦，持兵夺门，欲出为乱。一老卒闭而拒之，遂不得出，捕之皆获。","神宗一日行后苑，见牧豭猪者，问：“何所用？”牧者曰：“自太祖来，常令畜，自稚养至大，则杀之，更养稚者。累朝不改，亦不知何用。”神宗命革之，月余，忽获妖人于禁中，索猪血浇之，仓卒不得，方悟祖宗远虑。","〔评〕或谓宋之弱，由削节镇之权故。夫节镇之强，非宋强也。强干弱枝，自是立国大体。二百年弊穴，谈笑革之。终宋世无强臣之患，岂非转天移日手段？若非君臣偷安，力主和议，则寇准、李纲、赵鼎诸人用之有余。安在为弱乎？"]},{"title":"上智部·徐达","content":["【原文】","大将军达之蹙元帝于开平也，缺其围一角，使逸去。常开平怒亡大功。大将军言：“是虽一狄，然尝久帝天下。吾主上又何加焉？将裂地而封之乎，抑遂甘心也？既皆不可，则纵之固便。”开平且未然。及归报，上亦不罪。","［冯述评］","省却了太祖许多计较。然大将军所以敢于纵之者，逆知圣德之弘故也。何以知之？于遥封顺帝、赦陈理为归命侯而不诛知之。"]},{"title":"上智部·司马光","content":["【原文】","交趾贡异兽，谓之麟。司马公言：“真伪不可知。使其真，非自至不为瑞；若伪，为远夷笑。愿厚赐而还之。”","［冯述评］","方知秦皇、汉武之愚。"]},{"title":"上智部·韩琦","content":["【原文】","太宗、仁宗尝猎于大名之郊，题诗数十篇，贾昌朝时刻于石。韩琦留守日，以其诗藏于班瑞殿之壁。客有劝琦摹本以进者。琦曰：“修之得已，安用进为？”客亦莫谕琦意。韩绛来，遂进之。琦闻之，叹曰：“昔岂不知进耶？顾上方锐意四夷事，不当更导之耳。”","石守道编《三朝圣政录》，将上。一日求质于琦，琦指数事：其一，太祖惑一宫鬟，视朝晏。群臣有言，太祖悟，伺其酣寝，刺杀之。琦曰：“此岂可为万世法？已溺之，乃恶其溺而杀。彼何罪？使其复有嬖，将不胜其杀矣。”遂去此等数事。守道服其精识。"]},{"title":"上智部·刘大夏","content":["【原文】","天顺中，朝廷好宝玩。中贵言，宣德中尝遣太监王三保使西洋①，获奇珍无算。帝乃命中贵至兵部，查王三保至西洋水程。时刘大夏为郎，项尚书公忠令都吏检故牒，刘先检得，匿之。都吏检不得，复令他吏检。项诘都吏曰：“署中牍焉得失？”刘微笑曰：“昔下西洋，费钱谷数十万，军民死者亦万计。此一时弊政，牍即存，尚宜毁之，以拔其根，犹追究其有无耶？”项耸然，再揖而谢，指其位曰：“公达国体，此不久属公矣②。”","又，安南黎灏侵占城池，西略诸土夷，败于老挝。中贵人汪直欲乘间讨之，使索英公下安南牍。大夏匿弗予。尚书为榜吏至再，大夏密告曰：“衅一开，西南立糜烂③矣。”尚书悟，乃已。","〔评〕此二事，天下阴受忠宣公之赐而不知。"]},{"title":"上智部·姚崇","content":["【原文】","姚崇为灵武道大总管。张柬之等谋诛二张，崇适自屯所还，遂参密议，以功封梁县侯。武后迁上阳宫，中宗率百官问起居。五公相庆，崇独流涕。柬之等曰：“今岂流涕时耶？恐公祸由此始。”崇曰：“比与讨逆，不足为功。然事天后久，违旧主而泣，人臣终节也。由此获罪，甘心焉。”后五王被害，而崇独免。","［冯述评］","武后迁，五公相庆，崇独流涕。董卓诛，百姓歌舞，邕独惊叹。事同而祸福相反者，武君而卓臣，崇公而邕私也。然惊叹者，平日感恩之真心；流涕者，一时免祸之权术。崇逆知三思犹在，后将噬脐，而无如五王之不听何也。吁，崇真智矣哉！"]},{"title":"上智部·杨荣","content":["【原文】","王振谓杨士奇等曰：“朝廷事亏三杨先生，然三公亦高年倦勤矣。其后当如何？”士奇曰：“老臣当尽瘁报国，死而后已。”荣曰：“先生休如此说，吾辈衰残，无以效力，行当择后生可任者以报圣恩耳。”振喜，翌日即荐曹鼐、苗衷、陈循、高谷等，遂次第擢用。士奇以荣当日发言之易。荣曰：“彼厌吾辈矣，吾辈纵自立，彼其自已乎？一旦内中出片纸，命某人入阁，则吾辈束手而已。今四人竟是吾辈人，当一心协力也。”士奇服其言。","［冯述评］","李彦和〈见闻杂记〉云：“言官论劾大臣，必须下功夫，看见眼前何人可代得。代者，必贤于去者，必有益于国家，方是忠于进言。若只做得这篇文字，打出自己名头，毫于国家无补，不如缄口不言，反于言责无损。”此亦可与杨公之论合看。"]},{"title":"上智部·程颢","content":["【原文】","程颢为越州佥判，蔡卞为帅，待公甚厚。初，卞尝为公语：“张怀素道术通神，虽飞禽走兽能呼遣之。至言孔子诛少正卯，彼尝谏以为太早；汉祖成皋相持，彼屡登高观战。不知其岁数，殆非世间人也！”公每窃笑之。及将往四明，而怀素且来会稽。卞留少俟，公不为止，曰：“‘子不语怪、力、乱、神’，以不可训也，斯近怪矣。州牧既甚信重，士大夫又相谄合，下民从风而靡，使真有道者，固不愿此。不然，不识之未为不幸也！”后二十年，怀素败，多引名士。［边批：欲以自脱。］或欲因是染公，竟以寻求无迹而止。非公素论守正，则不免于罗织矣。","［冯述评］","张让，众所弃也，而太丘独不难一吊。张怀素，众所奉也，而伯淳独不轻一见。明哲保身，岂有定局哉！具二公之识，并行不悖可矣！蔡邕亡命江海积十二年矣，不能自晦以预免董卓之辟；逮既辟，称疾不就犹可也，乃因卓之一怒，惧祸而从；受其宠异，死犹叹息。初心谓何？介而不果，涅而遂淄，公论自违，犹望以续史幸免，岂不愚乎？视太丘愧死矣！","《容斋随笔》云：会稽天宁观老何道士，居观之东廊，栽花酿酒，客至必延之。一日有道人貌甚伟，款门求见。善谈论，能作大字。何欣然款留，数日方去。未几，有妖人张怀素谋乱，即前日道人也。何亦坐系狱，良久得释。自是畏客如虎，杜门谢客。忽有一道人，亦美风仪，多技术。西廊道士张若水介之来谒，何大怒骂，合扉拒之。此道乃永嘉林灵噩，旋得上幸，贵震一时，赐名灵素，平日一饭之恩无不厚报。若水乘驿赴阙，官至蕊珠殿校籍，父母俱荣封。而老何以尝骂故，朝夕忧惧。若水以书慰之，始少安。此亦知其一不知其二之鉴也！"]},{"title":"上智部·李晟","content":["【原文】","李晟之屯渭桥也，荧惑守岁，久乃退，府中皆贺曰：“荧惑退，国家之利，速用兵者昌。”晟曰：“天子暴露，人臣当力死勤难，安知天道邪？”至是乃曰：“前士大夫劝晟出兵，非敢拒也。且人可用而不可使之知也。夫唯五纬盈缩不常，晟惧复守岁，则吾军不战自屈矣！”皆曰：“非所及也！”","［冯述评］","田单欲以神道疑敌（见《兵智部》），李晟不欲以天道疑军。"]},{"title":"上智部·吕端","content":["【原文】","仁宗时，大内灾，宫室略尽。比晓，朝者尽至；日晏，宫门不启，不得闻上起居。两府请入对，不报。久之，上御拱宸门楼，有司赞谒，百官尽拜楼下。吕文靖［冯注：端］独立不动，上使人问其意，对曰：“宫庭有变，群臣愿一望天颜。”上为举帘俯槛见之，乃拜。"]},{"title":"上智部·孙叔敖","content":["【原文】","孙叔敖疾将死，戒其子曰：“王亟封我矣，吾不受也。为我死，王则封汝。汝必无受利地！楚、越之间有寝丘，若地不利而名甚恶，楚人鬼而越人禨，可长有者唯此也。”孙叔敖死，王果以美地封其子，子辞而不受，请寝丘。与之，至今不失。"]},{"title":"上智部·郭子仪","content":["【原文】","郭令公每见客，姬侍满前。乃闻卢杞至，悉屏去。诸子不解。公曰：“杞貌陋，妇女见之，未必不笑。他日杞得志，我属无噍类矣！”","［冯述评］","齐顷以妇人笑客，几至亡国。令公防微之虑远矣。","王勉夫云：〈宁成传〉末载，周阳由为郡守，汲黯、司马安俱在二千石列，同车未尝敢均茵伏。司马安不足言也，汲长孺与大将军亢礼，长揖丞相，面折九卿，矫矫风力，不肯为人下，至为周阳由所抑，何哉？周盖无赖小人，其居二千石列，肆为骄暴，凌轹同事，若无人焉。汲盖远之，非畏之也。异时河东太守胜屠公不堪其侵权，遂与之角，卒并就戮。玉石俱碎，可胜叹恨！士大夫不幸而与此辈同官，逊而避之，不失为厚，何苦与之较而自取辱哉！"]},{"title":"上智部·宋真宗","content":["【原文】","宋真宗朝，尝有兵士作过，于法合死，持贷命决脊杖二十改配。其兵士高声叫唤乞剑，不服决杖，从人把捉不得，遂奏取进止。传宣云：“须决杖后别取进止处斩。”寻决讫取旨，真宗云：“此只是怕吃杖。既决了，便送配所，莫问。”"]},{"title":"上智部·曹参","content":["【原文】","曹参被召，将行，属其后相：“以齐狱市为寄。”后相曰：“治无大此者乎？”参曰：“狱市所以并容也，今扰之，奸人何所容乎？”参既入相，一遵何约束，唯日夜饮醇酒，无所事事。宾客来者皆欲有言，至，则参辄饮以醇酒；间有言，又饮之，醉而后已，终莫能开说。惠帝怪参不治事，嘱其子中大夫窋私以意叩之。窋以休沭归，谏参。参怒，笞之二百。帝让参曰：“与窋何治乎？乃者吾使谏君耳。”参免冠谢曰：“陛下自察圣武孰与高帝？”上曰：“朕安敢望先帝？”又曰：“视臣能孰曹参与萧何？”帝曰：“君似不及也。”参曰：“陛下言是也。高帝与何定天下，法令既明。今陛下垂拱，参等守职，遵而勿失，不亦可乎？”帝曰：“君休矣。”","吏廨邻相国园。群吏日欢呼饮酒，声达于外。左右幸相国游园中，闻而治之。参闻，乃布席取酒，亦欢呼相应。左右乃不复言。","〔评〕不是覆短，适以见长。极绘太平之景，阴消近习之谗。"]},{"title":"上智部·赵普　李沆　陆九渊","content":["【原文】","赵韩王［普］为相，置二大瓮于坐屏后，凡有人投利害文字，皆置其中，满即焚之于通衢。","李文靖曰：“沆居相位，实无补万分；唯中外所陈利害，一切报罢，聊以补国尔。今国家防制，纤悉具备，苟轻徇所陈，一一行之，所伤实多。佥人苟一时之进，岂念民耶？”","陆象山云：“往时充员敕局，浮食是惭。惟是四方奏请，廷臣面对，有所建置更革，多下看详。其贰书生贵游，不谙民事，轻于献计；一旦施行，片纸之出，兆姓蒙害。每与同官悉意论驳，朝廷清明，尝得寝罢；编摩之事，稽考之勤，何足当大官之膳？庶几仅此可以偿万一耳！”","［冯述评］","罗景纶曰：“古云：‘利不什，不变法’，此言更革建置之不可轻也。或疑若是则将坐视天下之弊而不之救欤？不知革弊以存法可也，因弊而变法不可也；不守法而弊生，岂法之生弊哉！韩、范之建明于庆历者，革弊以存法也。荆公之施行于熙宁者，因弊而变法也，一得一失。概可观矣。”"]},{"title":"上智部·汉光武帝(二)","content":["【原文】","光武诛王郎，收文书，得吏人与郎交关谤毁者数千章。光武不省，会诸将烧之，曰：“令反侧子自安！”","［冯述评］","宋桂阳王休范举兵浔阳，萧道成击斩之。而众贼不知，尚破台军而进。宫中传言休范已在新亭，士庶惶惑，诣垒投名者以千数。及到，乃道成也。道成随得辄烧之，登城谓曰：“刘休范父子已戮死，尸在南冈下，我是萧平南，汝等名字，皆已焚烧，勿惧也！”亦是祖光武之智。"]},{"title":"上智部·龚遂","content":["【原文】","宣帝时，渤海左右郡岁饥，盗起，二千石不能制。上选能治者，丞相、御史举龚遂可用，上以为渤海太守。时遂年七十岁，召见，形貌短小，不副所闻。上心轻之，［边批：年貌俱不可以定人。］问：“息盗何策？”遂对曰：“海濒辽远，不沾圣化，其民困于饥寒而吏不恤，故使陛下赤子盗弄陛下之兵于潢池中耳。今欲使臣胜之耶，将安之也？”上改容曰：“选用贤良，固将安之。”遂曰：“臣闻治乱民如治乱绳，不可急也，臣愿丞相、御史且无拘臣以文法，得一切便宜从事。”上许焉，遣乘传至渤海界。郡闻新太守至，发兵以迎，遂皆遣还，移书敕属县：“悉罢逐捕盗贼吏；诸持锄，钩田器者皆为良民，吏毋得问；持兵者乃为盗贼。”遂单车独行至府。盗贼闻遂教令，即时解散，弃其兵弩而持钩、锄。","［冯述评］","汉制，太守皆专制一郡，生杀在手，而龚遂犹云“愿丞相，御史无拘臣以文法”。况后世十羊九牧，欲冀卓异之政，能乎？","古之良吏，化有事为无事，化大事为小事，蕲于为朝廷安民而已；今则不然，无事弄做有事，小事弄做大事，事生不以为罪，事定反以为功。人心脊脊思乱，谁之过与？"]},{"title":"上智部·文彦博","content":["【原文】","文潞公知成都，尝于大雪会客，夜久不罢。从卒有谇语，共拆井亭烧以御寒。军校白之，座客股栗。公徐曰：“天实寒，可拆与之。”［边批，落得做人情。］神色自若，饮宴如故。卒气沮，无以为变。明日乃究问先拆者，杖而遣之。","［冯述评］","气犹火也，挑之则发，去其薪则自熄，可以弭乱，可以息争。","苏轼通判密郡，有盗发而未获。安抚使遣三班使臣领悍卒数十人入境捕之，卒凶暴恣行，以禁物诬民，强入其家争斗。至杀人，畏罪惊散。民诉于轼，轼投其书不视，曰：“必不至此。”悍卒闻之，颇用自安。轼徐使人招出戮之。","遇事须有此镇定力量，然识不到，则力不足。"]},{"title":"上智部·张辽","content":["【原文】","张辽受曹公命屯长社。临发，军中有谋反者，夜惊乱火起，一军尽扰。辽谓左右曰：“勿动！是不一营尽反，必有造变者，欲以动乱人耳。”乃令军中曰：“不反者安坐。”辽将亲兵数十人中阵而立，有顷，即得首谋者，杀之。","［冯述评］","周亚夫将兵讨七国，军中尝夜惊。亚夫坚卧不起，顷之自定。","吴汉为大司马，尝有寇夜攻汉营，军中惊扰，汉坚卧不动，军中闻汉不动，皆还按部，汉乃选精兵夜击，大破之。","此皆以静制动之术，然非纪律素严，虽欲不动，不可得也。"]},{"title":"上智部·韩愈","content":["【原文】","韩愈为吏部侍郎。有令史权势最重，旧常关锁，选人不能见。愈纵之，听其出入，曰：“人所以畏鬼者，以其不能见也；如可见，则人不畏之矣！”","［冯述评］","主人明，不必关锁；主人暗，关锁何益？"]},{"title":"上智部·裴度","content":["【原文】","公在中书，左右忽白以失印，公怡然，戒勿言。方张宴举乐，人不晓其故。夜半宴酣，左右复白印存，公亦不答，极欢而罢。人问其故，公曰：“胥吏辈盗印书券，缓之则复还故处，急之则投水火，不可复得矣。”","［冯述评］","不是矫情镇物，真是透顶光明。故曰“智量”，智不足，量不大。"]},{"title":"上智部·郭子仪(二)","content":["【原文】","汾阳王宅在亲仁里，大启其第，任人出入不问。麾下将吏出镇来辞，王夫人及爱女方临妆，令帨汲水，役之不异仆隶。他日子弟列谏，不听，继之以泣，曰：“大人功业隆赫，而不自崇重，贵贱皆游卧内，某等以为虽伊、霍不当如此。”公笑谓曰：“尔曹固非所料。且吾马食官粟者五百匹，官饩者一千人，进无所往，退无所据。向使崇垣扃户，不通内外，一怨将起，构以不臣，其有贪功害能之徒成就其事，则九族齑粉，噬脐莫追。今荡荡无间，四门洞开，虽谗毁欲兴，无所加也!”诸子拜服。","鱼朝恩阴使人发郭氏墓，盗未得。子仪自泾阳来朝，帝唁之，即号泣曰：“臣久主兵，不能禁士残人之墓。人今亦发先臣墓，此天谴，非人患也!”朝恩又尝修具邀公，或言将不利公，其下愿裹甲以从。子仪不许，但以家僮数人往。朝恩曰：“何车骑之寡？”子仪告以所闻。朝恩惶恐曰：“非公长者，得无致疑。”","〔评〕德宗以山陵近禁屠宰。郭子仪之隶人犯禁，金吾将军裴谞奏之。或谓曰：“君独不为郭公地乎？”谞曰：“此乃所以为之地也。郭公望重，上新即位，必谓党附者众，故我发其小过，以明郭公之不足畏，不亦可乎？”若谞者，可谓郭公之益友矣。看郭汾阳，觉王翦、萧何家数便小。","精于黄老之术，虽朝恩亦不得不为盛德所化矣。君子不幸而遇小人，切不可与一般见识。"]},{"title":"上智部·牛弘","content":["【原文】","奇章公牛弘有弟弼，好酒而酗。尝醉，射杀弘驾车牛。弘还宅，妻迎谓曰：“叔射杀牛。”弘直答曰：“可作脯。”","［冯述评］","冷然一语，扫却妇人将来多少唇舌！睦伦者当以为法。"]},{"title":"上智部·子产","content":["【原文】","郑良霄既诛，国人相惊，或梦伯有［良霄字］介而行，曰：“壬子余将杀带，明年壬寅余又将杀段！”驷带及公孙段果如期卒，国人益大惧。子产立公孙泄［泄，子孔子，孔前见诛］及良止［良霄子］以抚之，乃止。子太叔问其故，子产曰：“鬼有所归，乃不为厉。吾为之归也。”太叔曰：“公孙何为？”子产曰：“说也。”［以厉故立后，非正，故并立泄，比于继绝之义，以解说于民。］","［冯述评］","不但通于人鬼之故，尤妙在立泄一着。鬼道而人行之，真能务民义而不惑于鬼神者矣！"]},{"title":"上智部·主父偃","content":["【原文】","汉患诸侯强，主父偃谋令诸侯以私恩自裂地，分其子弟，而汉为定其封号；汉有厚恩而诸侯渐自分析弱小云。"]},{"title":"上智部·裴光庭","content":["【原文】","张说以大驾东巡，恐突厥乘间入寇，议加兵备边，召兵部郎中裴光庭谋之。光庭曰：“封禅，告成功也，今将升中于天而戎狄是惧，非所以昭盛德也。”说曰：“如之何？”光庭曰：“四夷之中，突厥为大。比屡求和亲，而朝廷羁縻未决许也。今遣一使，征其大臣从封泰山，彼必欣然承命。突厥来，则戎狄君长无不皆来，可以偃旗卧鼓，高枕有余矣。”说曰：“善！吾所不及。”即奏行之。遣使谕突厥，突厥乃遣大臣阿史德颉利发入贡，因扈从东巡。"]},{"title":"上智部·陈平","content":["【原文】","燕王卢绾反，高帝使樊哙以相国将兵击之。既行，人有短恶哙者，高帝怒，曰：“哙见吾病，乃几吾死也！”用陈平计，召绛侯周勃受诏床下，曰：“平乘驰传，载勃代哙将。平到军中，即斩哙头！”二人既受诏行，私计曰：“樊哙，帝之故人，功多。又吕后女弟女嬃夫，有亲且贵。帝以忿怒故欲斩之，即恐后悔，［边批，精细。］宁囚而致上，令上自诛之。”平至军，为坛，以节召樊哙。哙受诏节，即反接载槛车诣长安，而令周勃代，将兵定燕。平行，闻高帝崩，平恐吕后及吕嬃怒，乃驰传先去。逢使者，诏平与灌婴屯于荥阳。平受诏，立复驰至宫，哭殊悲，因奏事丧前。吕太后哀之，曰：“君出休矣。”平因固请，得宿卫中，太后乃以为郎中令，曰：“傅教帝。”是后吕嬃谗乃不得行。","［冯述评］","谗祸一也，度近之足以杜其谋，则为陈平；度远之足以消其忌，则又为刘琦。宜近而远，宜远而近，皆速祸之道也。","刘表爱少子琮，琦惧祸，谋于诸葛亮，亮不应。一日相与登楼，去梯，琦曰：“今日出君之口，入吾之耳，尚未可以教琦耶？”亮曰：“子不闻申生在内而危，重耳在外而安乎？”琦悟，自请出守江夏。"]},{"title":"上智部·于谦","content":["【原文】","永乐间，降虏多安置河间、东昌等处，生养蕃息，骄悍不驯。方也先入寇时，皆将乘机骚动，几至变乱。至是发兵征湖、贵及广东、西诸处寇盗。于肃愍奏遣其有名号者，厚与赏犒，随军征进。事平，遂奏留于彼。于是数十年积患，一旦潜消。","［冯述评］","用郭钦徙戎之策而使戎不知，真大作用。"]},{"title":"上智部·刘大夏 张居正","content":["【原文】","庄浪土帅鲁麟为甘肃副将，求大将不得，恃其部落强，径归庄浪，以子幼请告。有欲予之大将印者，有欲召还京，予之散地者。刘尚书大夏独曰：“彼虐，不善用其众，无能为也。然未有罪。今予之印，非法；召之不至，损威。”乃为疏，奖其先世之忠，而听其就闲。麟卒怏怏病死。","黔国公沐朝弼，犯法当逮。朝议皆难之，谓朝弼纲纪之卒且万人，不易逮，逮恐激诸夷变。居正擢用其子，而驰单使缚之，卒不敢动；既至，请贷其死，而锢之南京，人以为快。","［冯述评］","奖其先则内愧，而怨望之词塞；擢其子则心安，而巢穴之虑重。所以罢之锢之，唯吾所制。"]},{"title":"上智部·贾耽","content":["【原文】","贾耽为山南东道节度使，使行军司马樊泽奏事行在。泽既反命，方大宴，有急牒至，以泽代耽。耽内牒怀中，颜色不改，宴罢，即命将吏谒泽，牙将张献甫怒曰：“行军自图节钺，事人不忠，请杀之！”耽曰：“天子所命，即为节度使矣。”即日离镇，以献甫自随，军府遂安。"]},{"title":"上智部·吕夷简","content":["【原文】","西鄙用兵，大将刘平战死。议者以朝廷委宦者监军，主帅节制有不得专者，故平失利。诏诛监军黄德和，或请罢诸帅监军。仁宗以问吕夷简，夷简对曰：“不必罢。但择谨厚者为之。”仁宗委夷简择之。对曰：“臣待罪宰相，不当与中贵私交，何由知其贤否？愿诏都知、押班，但举有不称者，与同罪。”仁宗从之。翼日，都知叩头乞罢诸监军宦官。士大夫嘉夷简有谋。","李迪与夷简同相，迪尝有所规画，吕觉其胜，或告曰：“李子柬之虑事，过于其父。”夷简因语迪曰：“公子柬之才可大用。”（边批：奸!）即奏除两浙提刑，迪父子皆喜。迪既失柬，事多遗忘，因免去。方知为吕所卖。","〔评〕杀一监军，他监军故在也；自我罢之，异日有失事，彼借为口实，不若使自请罢之为便。文穆称其有宰相才，良然。惜其有才而无度，如忌富弼，忌李迪，皆中之以小人之智，方之古大臣，邈矣!"]},{"title":"明智部·总序","content":["冯子曰：“有宇宙以来，只争‘明’、‘暗’二字而已。混沌暗而开辟明，乱世暗而治朝明，小人暗而君子明；水不明则腐，镜不明则锢，人不明则堕于云雾。今夫烛腹极照，不过半砖，朱曦霄驾，洞彻八海；又况夫以夜为昼，盲人瞎马，侥幸深溪之不陨也，得乎？故夫暗者之未然，皆明者之已事；暗者之梦景，皆明者之醒心；暗者之歧途，皆明者之定局；由是可以知人之所不能知，而断人之所不能断，害以之避，利以之集，名以之成，事以之立。明之不可已也如是，而其目为‘知微’，为‘亿中’，为‘剖疑’，为‘经务’。吁！明至于能经务也，斯无恶于智矣！"]},{"title":"明智部·箕子","content":["【原文】","纣初立，始为象箸。箕子叹曰：“彼为象箸，必不盛以土簋，将作犀玉之杯。玉杯象箸，必不羹藜藿，衣短褐，而舍于茅茨之下，则锦衣九重，高台广室。称此以求，天下不足矣！远方珍怪之物，舆马宫室之渐，自此而始，故吾畏其卒也！”未几，造鹿台，为琼室玉门，狗马奇物充其中，酒池肉林，宫中九市，而百姓皆叛。"]},{"title":"明智部·周公 姜太公","content":["【原文】","太公封于齐，五月而报政。周公曰：“何族［同速］也？”曰：“吾简其君臣，礼从其俗。”伯禽至鲁，三年而报政。周公曰：“何迟也？”曰：“变其俗，革其礼，丧三年而后除之。”周公曰：“后世其北面事齐乎？夫政不简不易，民不能近；平易近民，民必归之。”","周公问太公何以治齐，曰：“尊贤而尚功。”周公曰：“后世必有篡弑之臣。”太公问周公何以治鲁，曰：“尊贤而尚亲。”太公曰：“后寝弱矣。”","［冯述评］","二公能断齐、鲁之敝于数百年之后，而不能预为之维；非不欲维也，治道可为者止此耳。虽帝王之法，固未有久而不敝者也；敝而更之，亦俟乎后之人而已。故孔子有“变齐、变鲁”之说。陆葵日曰：“使夫子之志行，则姬、吕之言不验。”夫使孔子果行其志，亦不过变今之齐、鲁，为昔之齐、鲁，未必有加于二公也。二公之孙子，苟能日儆惧于二公之言，又岂俟孔子出而始议变乎？"]},{"title":"明智部·管仲","content":["【原文】","管仲有疾，桓公往问之，曰：“仲父病矣，将何以教寡人？”管仲对曰：“愿君之远易牙、竖刁、常之巫、卫公子启方。”公曰：“易牙烹其子以慊①寡人，犹尚可疑耶？”对曰：“人之情非不爱其子也。其子之忍，又何有于君？”公又曰：“竖刁自宫以近寡人，犹尚可疑耶？”对曰：“人之情非不爱其身也，其身之忍，又何有于君。”公又曰：“常之巫审于死生，能去苛病，犹尚可疑耶？”对曰：“死生，命也；苛病，天也。君不任其命，守其本，而恃常之巫，彼将以此无不为也。”公又曰：“卫公子启方事寡人十五年矣，其父死而不敢归哭，犹尚可疑耶？”对曰：“人之情非不爱其父也，其父之忍，又何有于君。”公曰：“诺。”管仲死，尽逐之。食不甘，宫不治，苛病起，朝不肃，居三年，公曰：“仲父不亦过乎？”于是皆复召而反。明年，公有病，常之巫从中出曰：“公将以某日薨。”（边批：所谓无不为也。）管仲易牙、竖刁、常之巫相与作乱。塞宫门，筑高墙，不通人，公求饮不得，卫公子启方以书社四十②下卫。公闻乱，慨然叹，涕出，曰：“嗟乎!圣人所见岂不远哉？”","〔评〕昔吴起杀妻求将，鲁人谮之；乐羊伐中山，对使者食其子，文侯赏其功而疑其心。夫能为不近人情之事者，其中正不可测也。","天顺中，都指挥马良有宠。良妻亡，上每慰问。适数日不出，上问及，左右以新娶对。上怫然③曰：“此厮夫妇之道尚薄，而能事我耶？”杖而疏之。宣德中，金吾卫指挥傅广自宫，请效用内廷。上曰：“此人已三品，更欲何为？自残希进，下法司问罪。”","噫!此亦圣人之远见也。"]},{"title":"明智部·王禹偁","content":["【原文】","丁谓诗有“天门九重开，终当掉臂入”，王禹偁读之，曰：“入公门，鞠躬如也。”天门岂可掉臂入乎？此人必不忠。”后如其言。"]},{"title":"明智部·潘濬","content":["【原文】","武陵郡樊仙尝诱诸夷作乱，州督请以万人讨之，权召问潘濬。濬曰：“易与耳，五千人足矣。”权曰：“卿何轻之甚也？”濬曰：“仙虽弄唇吻而无实才。昔尝为州人设馔，比至日中，食不可得，而十余自起，此亦侏儒观一节之验也。”权大笑，即遣濬，果以五千人斩人伷。"]},{"title":"明智部·魏相","content":["【原文】","诸马既得罪，窦氏益贵盛，皇后兄宪、弟笃喜交通宾客。第五伦上疏曰：“宪椒房之亲，典司禁兵，出入省闼，骄佚所自生也。议者以贵戚废锢，当复以贵戚浣濯之，犹解酲当以酒也，愿陛下防其未萌，令宪永保福禄。”宪果以骄纵败。","魏相因平恩侯许伯奏封事，言：“《春秋》讥世卿，恶宋三世无大夫，及鲁季孙之专权，皆危乱国家。自后元以来，禄去王室，政由冢宰。今霍光死，子复为大将军，兄子秉枢机，昆弟、诸婿据权势、任兵官，光夫人显及诸女皆通籍长信宫，或夜诏门出入，骄奢放纵，恐浸不制，宜有以损夺其权，破散阴谋，固万世之基，全功臣之世。”","又故事，诸上书者皆为二封，署其一曰“副封”。领尚书者先发副封，所言不善，屏去不奏。","魏相复因许伯白去副封，以防壅蔽。宣帝善之，诏相给事中，皆从其议。霍氏杀许后之谋始得上闻。乃罢其三侯，令就第，亲属皆出补吏。","〔评〕永元初，何敞上封事，亦言及此。但在夺沁水公主田园及杀都乡侯畅之后，跋扈已著，未若伦疏之先见也。","茂陵徐福“曲突徙薪”之谋，魏相已用之早矣。","《隽不疑传》云：大将军光欲以女妻之，不疑固辞，不肯当，久之病免。《刘德传》云：大将军欲以女妻之，德不敢取。畏盛满也。后免为庶人，屏居田间。霍光皆欲以女归二公而二公不受，当炙手炎炎之际，乃能避远权势，甘心摈弃，非有高识，孰能及此？观范明友之祸，益信二公之见为不可及。"]},{"title":"明智部·马援","content":["【原文】","建武中，诸王皆在京师，竞修名誉，招游士。马援谓吕种曰：“国家诸子并壮，而旧防未立，若多通宾客，则大狱起矣。卿曹戒慎之。”后果有告诸王宾客生乱，帝诏捕宾客，更相牵引，死者以数千。种亦与祸，叹曰：“马将军神人也。”","援又尝谓梁松、窦固曰：“凡人为贵，当可使贱，如卿等当不可复贱。居高坚自持，勉思鄙言。”松后果以贵满致灾，固亦几不免。"]},{"title":"明智部·列子","content":["【原文】","子列子穷，貌有饥色。客有言之于郑子阳者，曰：“列御寇，有道之士也。居君之国而穷，君毋乃不好士乎？”郑子阳令官遗之粟数十秉。子列子出见使者，再拜而辞。使者去，子列子入。其妻望而拊心曰：“闻为有道者，妻子皆得逸乐。今妻子有饥色矣，君过而遗先生食，先生又弗受也，岂非命哉？”子列子笑而谓之曰：“君非自知我也，以人之言而遗我粟也。夫以人言而粟我，至其罪我也，亦且以人言，此吾所以不受也。”其后民果作难，杀子阳。受人之养而不死其难，不义；死其难，则死无道也。死无道，逆也。子列子除不义去逆也，岂不远哉！","［冯述评］","魏相公叔痤病且死，谓惠王曰：“公孙鞅年少有奇才，愿王举国而听之。即不听，必杀之，勿令出境。”［边批：言杀之者，所以果其用也。］王许诺而去。公叔召鞅谢曰：“吾先君而后臣，故先为君谋，后以告子，子必速行矣！”鞅曰：“君不能用子之言任臣，又安能用子之言杀臣乎？”卒不去。鞅语正堪与列子语对照。"]},{"title":"明智部·唐寅","content":["【原文】","宸濠甚爱唐六如，尝遣人持百金，至苏聘之。既至，处以别馆，待之甚厚。六如住半年，见其所为不法，知其后必反，遂佯狂以处。宸濠遣人馈物，则倮形箕踞，以手弄其人道，讥呵使者；使者反命，宸濠曰：“孰谓唐生贤，一狂士耳。”遂放归。不久而告变矣。"]},{"title":"明智部·郗超","content":["【原文】","郗司空［愔，字方回］在北府，桓宣武［温］忌其握兵。郗遣笺诣桓，子嘉宾［超］出行于道上，闻之，急取笺视，“方欲共奖王室，修复园陵。”乃寸寸毁裂，归更作笺，自陈老病不堪人间，欲乞闲地自养。桓得笺大喜，即转郗公为会稽太守。","［冯述评］","超党于桓，非肖子也，然为父画免祸之策，不可谓非智。后超病将死，缄一箧文书，属其家人：“父若哀痛，以此呈之。”父后哭超过哀，乃发箧睹稿，皆与桓谋逆语，怒曰：“死晚矣。”遂止。夫身死而犹能以术止父之哀，是亦智也。然人臣之义，则宁为愔之愚，勿为超之智。"]},{"title":"明智部·张咏","content":["【原文】","张忠定公视事退后，有一厅子熟睡。公诘之：“汝家有甚事？”对曰：“母久病，兄为客未归。”访之果然。公翌日差场务一名给之，且曰：“吾厅岂有敢睡者耶？此必心极幽懑使之然耳，故悯之。”","〔评〕体悉人情至此，人谁不愿为之死乎？"]},{"title":"明智部·子贡","content":["【原文】","鲁定公十五年正月，邾隐公来朝，子贡观焉。邾子执玉高，其容仰；公受玉卑，其容俯。子贡曰：“以礼观之，二君皆有死亡焉。夫礼，死生存亡之体也：将左右、周旋、进退、俯仰，于是乎取之；朝、祀、丧、戎，于是乎观之。今正月相朝而皆不度，心已亡矣。嘉事不体，何以能久!高仰，骄也；卑俯，替也。骄近乱，替近疾。君为主，其先亡乎？”五月公薨。孔子曰：“赐不幸言而中，是使赐多言也!”"]},{"title":"明智部·范蠡","content":["【原文】","朱公居陶，生少子。少子壮，而朱公中男杀人，囚楚，朱公曰：“杀人而死，职也，然吾闻‘千金之子，不死于市’。”乃治千金装，将遣其少子往视之。长男固请行，不听。以公不遣长子而遣少弟，“是吾不肖”，欲自杀。其母强为言，公不得已，遣长子。为书遗故所善庄生，因语长子曰：“至，则进千金于庄生所，听其所为，慎无与争事。”长男行，如父言。庄生曰：“疾去毋留，即弟出，勿问所以然。”长男阳去，不过庄生而私留楚贵人所。庄生故贫，然以廉直重，楚王以下皆师事之。朱公进金，未有意受也，欲事成后复归之以为信耳。而朱公长男不解其意，以为殊无短长。庄生以间入见楚王，言某范蠡星某宿不利楚，独为德可除之。王素信生，即使使封三钱之府，贵人惊告朱公长男曰：“王且赦，每赦，必封三钱之府。”长男以为赦，弟固当出，千金虚弃，乃复见庄生。生惊曰：“若不去耶？”长男曰：“固也，弟今且赦，故辞去。”生知其意，令自入室取金去。庄生羞为孺子所卖，乃入见楚王曰：“王欲以修德禳星，乃道路喧传陶之富人朱公子杀人囚楚，其家多持金钱赂王左右，故王赦，非能恤楚国之众也，特以朱公子故。”王大怒，令论杀朱公子，明日下赦令。于是朱公长男竟持弟丧归，其母及邑人尽哀之，朱公独笑曰：“吾固知必杀其弟也，彼非不爱弟，顾少与我俱，见苦为生难，故重弃财。至如少弟者，生而见我富，乘坚策肥，岂知财所从来哉!吾遣少子，独为其能弃财也，而长者不能，卒以杀其弟。——事之理也，无足怪者，吾日夜固以望其丧之来也!”","〔评〕朱公既有灼见，不宜移于妇言，所以改遣者，惧杀长子故也。“听其所为，勿与争事。”已明明道破，长子自不奉教耳。庄生纵横之才不下朱公，生人杀人，在其鼓掌。然宁负好友，而必欲伸气于孺子，何德字之不宽也？噫，其所以为纵横之才也与!"]},{"title":"明智部·姚崇","content":["【原文】","魏知古起诸吏，为姚崇所引用，及同升也，崇颇轻之。无何，知古拜吏部尚书，知东道选事。崇二子并分曹洛邑，会知古至，恃其蒙恩，颇顾请托。知古归，悉以闻。上召崇，从容谓曰：“卿子才平？皆何官也？又安在？”崇揣知上意，因奏曰：“臣有三子，两人分司东都矣。其为人多欲而寡交，以是必干知古，然臣未及闻之耳。”上始以丞相子重言之，欲微动崇意，若崇私其子，或为之隐；及闻所奏，大喜，且曰：“卿安从知之？”崇曰：“知古微时，是臣荐以至荣达。臣子愚，谓知古见德，必容其非，故必干之。”上于是明崇不私其子之过，而薄知古之负崇也，欲斥之。崇为之请曰：“臣有子无状，挠陛下法，陛下欲特原之，臣为幸大矣。而由臣逐知古，海内臣庶，必以陛下为私子臣矣，非所以裨玄化也。”上久之乃许。翌日，以知古为工部尚书，罢知政事。","姚崇与张说同为相，而相衔颇深。崇病，戒诸子曰：“张丞相与吾不协，然其人素侈，尤好服玩。吾身没后，当来吊，汝具陈吾平生服玩、宝带、重器罗列帐前。张若不顾，汝曹无类矣。若顾此，便录致之，仍以神道碑为请。既获其文，即时录进，先砻石以待，至便镌刻进御。张丞相见事常迟于我，数日后必悔，若征碑文，当告以上闻，且引视镌石。”崇没，说果至，目其服玩者三四。崇家悉如崇戒。及文成，叙致该详，时谓“极笔”。数日，果遣使取本，以为辞未周密，欲加删改。姚氏诸子引使者视碑，仍告以奏御。使者复，说大悔恨，抚膺曰：“死姚崇能算生张说，吾今日方知才之不及!”"]},{"title":"明智部·陈同甫","content":["【原文】","辛幼安流寓江南，而豪侠之气未除。一日，陈同甫来访，近有小桥，同甫引马三跃而马三却。同甫怒，拔剑斩马首。（边批：豪甚!）徒步而行。幼安适倚楼而见之，大惊异，即遣人询访，而陈已及门，遂与定交。后十数年，幼安帅淮，同甫尚落落贫甚，乃访幼安于治所，相与谈天下事。幼安酒酣，因言南北利害，云：南之可以并北者如此，北之可以并南者如此。“钱塘非帝王居。断牛头山，天下无援兵；决西湖水，满城皆鱼鳖。”饮罢，宿同甫斋中。同甫夜思：幼安沉重寡言，因酒误发，若醒而悟，必杀我灭口。遂中夜盗其骏马而逃。（边批：能杀马必能盗马。）幼安大惊。后同甫致书，微露其意，为假十万缗以济乏。幼安如数与焉。"]},{"title":"明智部·王琼","content":["【原文】","嘉靖初年，北虏尝寇陕西，犯花马池，镇巡惶遽，请兵策应。事下九卿会议，本兵王宪以为必当发，否恐失事。众不敢异。王琼时为冢宰，独不肯，曰：“我自有疏。”即奏云：“花马池是臣在边时所区画，防守颇严，虏必不能入；纵入，亦不过掳掠；彼处自足防御，不久自退。若遣京军远涉边境，道路疲劳，未必可用，而沿途骚扰，害亦不细，倘至彼而虏已退，则徒劳往返耳。臣以为不发兵便。”然兵议实本兵主之，竟发六千人，命二游击将之以往。（边批：只是不深知晋溪故。）至彰德，未渡河，已报虏出境矣。","〔评〕按晋溪在西北，修筑花马池一带边墙，命二指挥董其役。二指挥甚效力，边墙极坚，且功役亦不甚费，有羡银二千余，持以白晋溪。晋溪曰：“此一带城墙，实西北要害去处，汝能尽心了此一事，此琐琐之物何足问，即以赏汝。”后北虏犯边，即遣二指挥提兵御之，二人争先陷阵，其一竟死于敌。晋溪筹边智略类如此。","又晋溪总制三边时，每一巡边，虽中火亦费百金，未尝折干，到处皆要供具，烧羊亦数头，凡物称是。晋溪不数脔，尽撤去，散于从官，虽下吏亦沾及。故西北一有警，则人人效命。当时法网疏阔，故豪杰得行其意；使在今日，则台谏即时论罢矣。","梅衡湘任播州监军，行时请帑金三千备犒赏之需，及事定，所费仅四百金，登籍报部，无分毫妄用。"]},{"title":"明智部·班超","content":["【原文】","班超久于西域，上疏愿生入玉门关。乃召超还。以戊己校尉任尚代之。尚谓超曰：“君侯在外域三十余年，而小人猥承君后，任重虑浅，宜有以诲之。”超曰：班超“塞外吏士，本非孝子顺孙，皆以罪过徙补边屯。而蛮夷怀鸟兽之心，难养易败。今君性严急，水清无鱼，察政不得下和，宜荡佚简易，宽小过，总大纲而已。”超去后，尚私谓所亲曰：“我以班君尚有奇策，今所言平平耳。”尚留数年而西域反叛，如超所戒。"]},{"title":"明智部·曹操","content":["【原文】","何进与袁绍谋诛宦官，何太后不听，进乃召董卓，欲以兵胁太后。曹操闻而笑之，曰：“阉竖之官，古今宜有，但世主不当假之以权宠，使至于此。既治其罪，当诛元恶，一狱吏足矣，何必纷纷召外将乎？欲尽诛之，事必宣露，吾见其败也。”卓未至而进见杀。","曹操袁尚、袁熙奔辽东，尚有数千骑。初，辽东太守公孙康恃远不服，及操破乌丸，或说操遂征之，尚兄弟可擒也。操曰：“吾方使康斩送尚、熙首来，不烦兵矣。”九月，操引兵自柳城还，康即斩尚、熙，传其首。诸将问其故，操曰：“彼素畏尚等，吾急之则并力，缓之则相图，其势然也。”","曹公之东征也，议者惧军出，袁绍袭其后，进不得战而退失所据。公曰：“绍性迟而多疑，来必不速；刘备新起，众心未附，急击之，必败，此存亡之机，不可失也。”卒东击备。田丰果说绍曰：“虎方捕鹿，熊据其穴而啖其子，虎进不得鹿，而退不得其子。今操自征备，空国而去，将军长戟百万，胡骑千群，直指许都，持其巢穴，百万之师自天而下，若举炎火以焦飞蓬，覆沧海而沃漂炭，有不消灭者哉？兵机变在斯须，军情捷于桴鼓。操闻，必舍备还许，我据其内，备攻其外，逆操之头必悬麾下矣!失此不图，操得归国，休兵息民，积谷养士。方今汉道陵迟，纲纪弛绝。而操以枭雄之资，乘跋扈之势，恣虎狼之欲，成篡逆之谋，虽百道攻击，不可图也。”绍辞以子疾，不许。（边批：奴才不出操所料。）丰举杖击地曰：“夫遭此难遇之机，而以婴儿之故失其会，惜哉!”","安定与羌胡密迩，太守毋丘兴将之官，公戒之曰：“羌胡欲与中国通，自当遣人来，慎勿遣人往!善人难得，必且教羌人妄有请求，因以自利。不从，便为失异俗意；从之则无益。”兴佯诺去。及抵郡，辄遣校尉范陵至羌，陵果教羌使自请为属国都尉。公笑曰：“吾预知当尔，非圣也，但更事多耳。”","〔评〕操明于翦备，而汉中之役，志盈得陇，纵备得蜀，不用司马懿、刘晔之计，何也？或者有天意焉？"]},{"title":"明智部·郭嘉 虞翻","content":["【原文】","郭嘉孙策既尽有江东，转斗千里，闻曹公与袁绍相持官渡，将议袭许。众闻之，皆惧。郭嘉独曰：“策新并江东，所诛皆英杰，能得人死力者也。然策轻而无备，虽有百万众，无异于独行中原。若刺客伏起，一人之敌耳。以吾观之，必死于匹夫之手。”","虞翻亦以策好驰骋游猎，谏曰：“明府用乌集之众，驱散附之士，皆能得其死力，此汉高之略也。至于轻出微行，吏卒尝忧之。夫白龙鱼服，困于豫且；白蛇自放，刘季害之。愿少留意。”策曰：“君言是也!”然终不能悛，至是临江未济，果为许贡家客所杀。","〔评〕孙伯符不死，曹瞒不安枕矣。天意三分，何预人事？"]},{"title":"明智部·罗隐","content":["【原文】","浙帅钱镠时，宣州叛卒五千余人送款，钱氏纳之，以为腹心。时罗隐在幕下，屡谏，以为敌国之人，不可轻信。浙帅不听。杭州新治，城堞楼橹甚盛。浙帅携僚客观之，隐指却敌，阳不晓曰：“设此何用？”浙帅曰：“君岂不知备敌耶？”隐谬曰：“若是，何不向里设之？”盖指宣卒也。后指挥使徐绾等挟宣卒为乱，几于覆国。","〔评〕迩年辽阳、登州之变，皆降卒为祟，守土者不可不慎此一着。"]},{"title":"明智部·陆逊 孙登","content":["【原文】","陆逊陆逊多沉虑，筹无不中，尝谓诸葛恪曰：“在吾前者，吾必奉之同升；在吾下者，吾必扶持之。（边批：长者之言。）君今气陵其上，意蔑乎下，恐非安德之基也!”恪不听，卒见死。","嵇康从孙登游三年，问终不答。康将别，曰：“先生竟无言耶？”登乃曰：“子识火乎？生而有光，而不用其光，果在于用光；人生有才，而不用其才，果在于用才。故用光在乎得薪，所以保其曜；用才在乎识物，所以全其年。今子才多识寡，难乎免于今之世矣!”康不能用，卒死吕安之难。"]},{"title":"明智部·邵雍","content":["【原文】","王安石罢相，吕惠卿参知政事。富郑公见康节，有忧色。康节曰：“岂以惠卿凶暴过安石耶？”曰：“然。”康节曰：“勿忧。安石、惠卿本以势利相合，今势利相敌，将自为仇矣，不暇害他人也。”未几，惠卿果叛安石。","熙宁初，王宣徽之子名正甫，字茂直，监西京粮料院。一日约邵康节同吴处厚、王平甫食饭，康节辞以疾。明日，茂直来问康节辞会之故，康节曰：“处厚好议论，每讥刺执政新法；平甫者，介甫之弟，虽不甚主其兄，若人面骂之，则亦不堪矣。此某所以辞也。”茂直叹曰：“先生料事之审如此。昨处厚席间毁介甫，平甫作色，欲列其事于府。某解之甚苦，乃已。”呜呼，康节以道德尊一代，平居出处，一饭食之间，其慎如此。","〔评〕按荆公行新法，任用新进。温公贻以书曰：“忠信之士，于公当路时虽龃龉可憎，后必得其力；谄谀之人，于今诚有顺适之快，一旦失势，必有卖公以自售者。”盖指吕惠卿也。"]},{"title":"明智部·张说","content":["【原文】","说有材辩，能断大义。景云初，帝谓侍臣曰：“术家言五日内有急兵入宫，奈何？”左右莫对。说进曰：“此谗人谋动东宫耳。（边批：破的。）陛下若以太子监国，则名分定，奸胆破，蜚语塞矣。”帝如其言，议遂息。"]},{"title":"明智部·寇准","content":["【原文】","楚王元佐，太宗长子也，因申救廷美不获，遂感心疾，习为残忍；左右微过，辄弯弓射之。帝屡诲不悛。重阳，帝宴诸王，元佐以病新起，不得预，中夜发愤，遂闭媵妾，纵火焚宫。帝怒，欲废之。会寇准通判郓州，得召见，太宗谓曰：“卿试与朕决一事，东宫所为不法，他日必为桀、纣之行，欲废之，则宫中亦有甲兵，恐因而招乱。”准曰：“请某月日，令东宫于某处摄行礼，其左右侍从皆令从之，陛下搜其宫中，果有不法之事，俟还而示之；废太子，一黄门力耳。”太宗从其策，及东宫出，得淫刑之器，有剜目、挑筋、摘舌等物，还而示之，东宫服罪，遂废之。","〔评〕搜其宫中，如无不法之事，东宫之位如故矣。不然，亦使心服无冤耳。江充、李林甫，岂可共商此事？"]},{"title":"明智部·西门豹","content":["【原文】","魏文侯时，西门豹为邺令，会长老问民疾苦。长老曰：“苦为河伯娶妇。”豹问其故，对曰：“邺三老、廷掾常岁赋民钱数百万，用二三十万为河伯娶妇，与祝巫共分其余。当其时，巫行视人家女好者，云‘是当为河伯妇’，即令洗沐，易新衣。治斋宫于河上，设绛帷床席，居女其中。卜日，浮之西门豹河。行数十里乃灭。俗语曰：‘即不为河伯娶妇，水来漂溺。’（边批：邪教惑人类然。）人家多持女远窜，故城中益空。”豹曰：“及此时幸来告，吾亦欲往送。”至期，豹往会之河上，三老、官属、豪长者、里长、父老皆会，聚观者数千人。其大巫，老女子也，女弟子十人从其后。豹曰：“呼河伯妇来。”既见，顾谓三老、巫祝、父老曰：“是女不佳，烦大巫妪为入报河伯：更求好女，后日送之。”即使吏卒共抱大巫妪投之河。有顷，曰：“妪何久也？弟子趣之。”复投弟子一人于河中。有顷，曰：“弟子何久也？”复使一人趣之。凡投三弟子。豹曰：“是皆女子，不能白事。烦三老为入白之。”复投三老。豹簪笔磬折，向河立待，良久，旁观者皆惊恐。豹顾曰：“巫妪、三老不还报，奈何？”复欲使廷掾与豪长者一人入趣之。皆叩头流血，色如死灰。豹曰：“且俟须臾。”须臾，豹曰：“廷掾起矣。河伯不娶妇也。”邺吏民大惊恐，自是不敢复言河伯娶妇。","〔评〕娶妇以免溺，题目甚大。愚民相安于惑也久矣，直斥其妄，人必不信。唯身自往会，簪笔磬折，使众著于河伯之无灵，而向之行诈者计穷于畏死，虽驱之娶妇，犹不为也，然后弊可永革。"]},{"title":"明智部·程颢","content":["【原文】","南山僧舍有石佛，岁传其首放光，远近男女聚观，昼夜杂处。为政者畏其神，莫敢禁止。程颢始至，诘其僧曰：“吾闻石佛岁现光，有诸？”曰：“然。”戒曰：“俟复见，必先白，吾职事不能往，当取其首就观之。”自是不复有光矣。"]},{"title":"明智部·狄仁杰","content":["【原文】","狄梁公为度支员外郎，车驾将幸汾阳，公奉使修供顿。并州长史李玄冲以道出妒女祠，俗称有盛衣服车马过者，必致雷风，欲别开路。公曰：“天子行幸，千乘万骑，风伯清尘，雨师洒道，何妒女敢害而欲避之？”玄冲遂止，果无他变。"]},{"title":"明智部·苏东坡","content":["【原文】","苏东坡知扬州，一夕梦在山林间，见一虎来噬，公方惊怖，一紫袍黄冠以袖障公，叱虎使去。及旦，有道士投谒曰：“昨夜不惊畏乎？”公叱曰：“鼠子乃敢尔？本欲杖汝脊，吾岂不知汝夜来术邪？”（边批：坡聪明过人。）道士骇惶而走。"]},{"title":"明智部·魏元忠","content":["【原文】","唐魏元忠未达时，一婢出汲方还，见老猿于厨下看火。婢惊白之，元忠徐曰：“猿愍我无人，为我执爨，甚善。”又尝呼苍头，未应，狗代呼之。又曰：“此孝顺狗也，乃能代我劳!”尝独坐，有群鼠拱手立其前。又曰：“鼠饥就我求食。”乃令食之。夜中鸺鹠鸣其屋端，家人将弹之。又止之，曰：“鸺昼不见物，故夜飞，此天地所育，不可使南走越，北走胡，将何所之？”其后遂绝无怪。"]},{"title":"明智部·朱熹","content":["【原文】","朱熹乾道四年，民艰食，熹请于府，得常平米六百石赈贷。夏受粟于仓，冬则加息以偿；歉，蠲其息之半，大饥尽蠲之。凡十四年，以米六百石还府，见储米三千一百石，以为“社仓”，不复收息。故虽遇歉，民不缺食，诏下熹“社仓法”于诸路。","〔评〕陆象山曰：“社仓固为农之利，然年常丰，田常熟，则其利可久；苟非常熟之田，一遇岁歉，则有散而无敛；来岁秧时缺本，乃无以赈之，莫如兼制平籴一仓，丰时籴之，使无价贱伤农之患；缺时粜之，以摧富民封廪腾价之计，析所籴为二，每存其一，以备歉岁，代社仓之匮，实为长便也。听民之便，则为社仓法；强民之从，即为青苗法矣，此主利民，彼主利国故也。”","今有司积谷之法，亦社仓遗训，然所积只纸上空言，半为有司干没，半充上官，无碍钱粮之用。一遇荒歉，辄仰屋窃叹，不如留谷于民间之为愈矣。噫!","何良俊《四友斋丛说》云：“今之抚按有第一美政所急当举行者，要将各项下赃罚银，督令各府县尽数籴谷；其有罪犯自徒流以下，许其以谷赎罪。大率上县每年要谷一万，下县五千。两直隶巡抚下有县凡一百，则是每年有谷七十余万，积至三年，即有二百余万矣。若遇一县有水旱之灾，则听于无灾县分通融借贷，俟来年丰熟补还，则东南百姓可免流亡，而朝廷于财赋之地永无南顾之忧矣。善政之大，无过于此!”"]},{"title":"明智部·虞集","content":["【原文】","元虞集，仁宗时拜祭酒，讲罢，因言京师恃东南海运，而实竭民力以航不测，乃进曰：“京东濒海数千里，皆萑苇之场，北极辽海，南滨青、齐，海潮日至，淤为沃壤久矣，苟用浙人之法，筑堤捍水为田，听富民欲得官者，分授其地而官为之限，能以万夫耕者，授以万夫之田，为万夫长；千夫、百夫亦如之。三年视其成，则以地之高下，定额于朝，而以次征之。五虞集年有积蓄，乃命以官，就所储给以禄。十年则佩之符印，俾得以传子孙，则东南民兵数万，可以近卫京师，外御岛夷，远宽东南海运之力，内获富民得官之用，淤食之民得有所归，自然不至为盗矣。”说者不一，事遂寝。","〔评〕其后脱脱言：京畿近水地，利召募江南人耕种，岁可收粟麦百余万石，不烦海运，京师足食。元主从之，于是立分司农司，以右丞悟良哈台、左丞乌古孙良祯兼大司农卿，给分司农司印，西自西山，南至保定、河间，北抵檀顺，东及迁民镇，凡官地及元管各处屯田，悉从分司农司立法佃种，合用工价、牛具、农器、谷种，给钞五百万锭。又略仿前集贤学士虞集议，于江、淮召募能种水田及修筑圃堰之人各千人，为农师。降空名添设职事敕牒十二道，募农民百人者授正九品。二百人者正八，三百人者从七，就令管领所募之人。所募农夫每人给钞十锭，期年散归，遂大稔。","何孟春《余冬序录》云：“明朝叶文庄公盛巡抚宣府时，修复官牛、官田之法，垦地日广，积粮日多，以其余岁易战马千八百余匹。其屯堡废缺者，咸修复之，不数月，完七百余所。今边兵受役权门，终岁劳苦，曾不得占寸地以自衣食，军储一切仰给内帑，战马之费于太仆者不资，屯堡尚谁修筑？悠悠岁月，恐将来之夷祸难支也!”","樊升之曰：“贾生之治安，晁错之兵事，江统之徙戎，是万世之至画也，李邺侯之屯田，虞伯生之垦墅，平江伯之漕运。平江伯陈瑄，合肥人。永乐初董北京海漕，筑淮阳海堤八百里。寻罢海运，浚会通河，通南北饷道，疏清江浦以避淮险，设仪真瓜洲坝港，凿徐州吕梁浜，筑刀阳、南旺湖堤，开白塔河通江，筑高邮湖堤，自淮至临清建闸四十七，建淮、徐临通仓以便转输，置舍卒导舟，设井树以便行者。是一代之至画也。李允则之筑圃起浮屠，范文正、富郑公之救荒，是一时之至画也。画极其至，则人情允协，法成若天造，令出如流水矣。”"]},{"title":"明智部·刘大夏","content":["【原文】","弘治十年，命户部刘大夏出理边饷，或曰：“北边粮草，半属中贵人子弟经营，公素不与先辈合。恐不免刚以取祸。”大夏曰：“处事以理不以势，俟至彼图之。”既至，召边上父老日夕讲究，遂得其要领。一日，揭榜通衢云：“某仓缺粮若干石，每石给官价若干，凡境内外官民客商之家，但愿输者，米自十石以上，草自百束以上，俱准告。”虽中贵子弟亦不禁。不两月，仓场充轫。盖往时粮百石、草千束方准告，以故中贵子弟争相为市，转买边人粮草，陆续运至，牟利十五。自此法立，有粮草之家自得告输，中贵子弟即欲收籴，无处可得，公有余积，家有余财。","〔评〕忠宣法诚善，然使不召边上父老日夕讲究，如何得知？能如此虚心访问，实心从善，何官不治？何事不济？昔唐人目台中坐席为“痴床”，谓一坐此床，骄倨如痴。今上官公坐皆“痴床”矣，民间利病，何由上闻？"]},{"title":"明智部·陶侃","content":["【原文】","陶侃性俭厉，勤于事。作荆州时，敕船官悉录锯木屑，不限多少。咸不解此意，后正会，值积雪始晴，厅事前除雪后犹湿，于是悉用木屑履之，都无所妨。官用竹，皆令录厚头，积之如山。后桓宣武伐蜀，装船悉以作钉。又尝发所在竹篙，有一官长，连根取之，仍当足。（边批：根坚可代铁足。）公即超两阶用之。"]},{"title":"明智部·杨一清","content":["【原文】","西番故饶马，而仰给中国茶饮疗疾。祖制以蜀茶易番马，久而寝弛，茶多阑出，为奸人利，而番马不时至。杨文襄乃请重行太仆宛马之官，而严私通禁，尽笼茶利于宫，以报致诸番。番马大集，而屯牧之政修。","〔评〕其抚陕西，则创城于平虏、红古二地，以为固原援。筑垣濒河，以捍靖虏。其讨安化，则授张永策以诛逆瑾。出将入相，谋无不酬，当时目公为“智囊”，又比之姚崇，不虑也!"]},{"title":"明智部·苏州堤","content":["【原文】","苏州至昆山县凡七十里，皆浅水，无陆途。民颇病涉，久欲为长堤，而泽国艰于取土。嘉祐中，人有献计，就水中以蘧除刍藁为墙，栽两行，相去三尺；去墙六尺，又为一墙，亦如此。漉水中淤泥，实蘧除中，候干，则以水车沃去两墙间之旧水，墙间六尺皆土，留其半以为堤脚，掘其半为渠，取土为堤。每三四里则为一桥，以通南北之水，不日堤成，遂为永利。今娄门塘，是也。"]},{"title":"明智部·叶梦得","content":["【原文】","叶梦得叶石林在颍昌，岁值水灾，京西尤甚，浮殍自唐、邓入境，不可胜计，令尽发常平所储以赈。唯遗弃小儿，无由处之。一日询左右曰：“民间无子者，何不收畜？”曰：“患既长或来识认。”叶阅法例：凡伤灾遗弃小儿，父母不得复取。（边批：作法者其虑远矣。）遂作空券数千，具载本法，即给内外厢界保伍，凡得儿者，皆使自明所从来，书券给之，官为籍记，凡全活三千八百人。"]},{"title":"明智部·虞允文","content":["【原文】","先是浙民岁输丁钱绢，民生子即弃之，稍长即杀之。虞公允文闻之恻然，访知江渚有荻场利甚溥，而为世家及浮屠所私。公令有司籍其数以闻，请以代输民之身丁钱。符下日，民欢呼鼓舞，始知有父子生聚之乐。"]},{"title":"明智部·种世衡 杨掞","content":["【原文】","种世衡所置青涧城，逼近虏境，守备单弱，刍粮俱乏。世衡以官钱贷商旅，使致之，不问所出入。未几，仓廪皆实。又教吏民习射，虽僧道、妇人亦习之，以银为的，中的者辄与之。既而中者益多，其银重轻如故，而的渐厚且小矣。或争徭役轻重，亦令射，射中者得优处。或有过失，亦令射，射中则免之。由是人人皆射，富强甲于延州。","杨掞本书生，初从戎习骑射，每夜用青布藉地，乘生马跃，初不过三尺，次五尺，次至一丈，数闪跌不顾。孟珙尝用其法，称为“小子房”。","〔评〕按《宋史》，掞尝贷人万缗，游襄、汉间，人娼楼，箧垂尽。夜忽自呼曰：“来此何为？”辄弃去。已在军中，费官钱数万，贾似道核其数，孟珙以白金六百与偿，掞又费之，终日而饮。似道欲杀之，掞曰：“汉祖以黄金四万斤付陈平，不问出入，如公琐琐，何以用豪杰？”似道姑置之。盖奇士也!其参杜杲军幕，能出奇计，解安丰之围，惜乎不尽其用耳。"]},{"title":"明智部·汪立信 文天祥","content":["【原文】","襄阳围急，将破，立信遗似道书，云：“沿江之守，不过七千里，而内郡见兵尚可七十余万，宜尽出之江干，以实外御。汰其老弱，可得精锐五十万，于七千里中，距百里为屯，屯有守将；十屯为府，府有总督。其尤要害处，则参倍其兵。无事则泛舟江、淮，往来游徼，有事则东西互援，联络不断，以成率然之势，此上策也!久拘聘使，无益于我，徒使敌得以为辞，莫若礼而归之，请输岁币以缓目前之急。俟边患稍休，徐图战守，此中策也!”后伯颜入建康，闻其策，叹曰：“使宋果用之，吾安得至此？”","北人南侵，文天祥上疏，言：“朝廷姑息牵制之意多，奋发刚断之意少，乞斩师孟衅鼓，以作将士之气。”且言：“宋惩五季之乱，削藩镇，建邑郡，一时虽足以矫尾大之弊，然国以变弱，故敌至一州则一州破，至一县则一县残，中原陆沉，痛悔何及？今宜分天下为四镇，建都督统御于其中，以广西益湖广，而建阃于长沙；以广东益江西，而建阃于隆兴；以福建益江东，而建阃于番阳；以淮西益淮东，而建阃于扬州。责长沙取鄂，隆兴取蕲、黄，番阳取江东，扬州取两淮。使其地大力众，足以抗敌，约日齐备，有进无退，日夜以图之，彼备多力分，疲于奔命。而吾民之豪杰者，又伺间出于其中。如此，则敌不难却也!”","〔评〕靖康有李纲不用，而用黄潜善、汪伯彦；咸淳有汪立信不用，而用贾似道；德祐有文天祥不用，而用陈宜中。然则宋不衰于金，自衰也；不亡于元，自亡也!"]},{"title":"察智部·总序","content":["【原文】","冯子曰：智非察不神，察非智不精。子思云：“文理密察，必属于至圣。”而孔子亦云：“察其所安。”是以知察之为用，神矣广矣。善于相人者，犹能以鉴貌辨色，察人之富贵福寿贫贱孤夭，况乎因其事而察其心？则人之忠佞贤奸，有不灼然乎？分其目曰“得情”，曰“诘奸”，即以此为照人之镜而已。"]},{"title":"察智部·殷云霁","content":["【原文】","正德中，殷云霁字近夫，知清江，县民朱铠死于文庙西庑中，莫知杀之者。忽得匿名书，曰：“杀铠者某也。”某系素仇，众谓不诬。云霁曰：“此嫁贼以缓治也。”问左右：“与铠狎者谁？”对曰：“胥姚。”云霁乃集群胥于堂，曰：“吾欲写书，各呈若字。”有姚明者，字类匿名书，诘之曰：“尔何杀铠？”明大惊曰：“铠将贩于苏，独吾候之，利其资，故杀之耳。"]},{"title":"察智部·高子业","content":["【原文】","高子业初任代州守，有诸生江槔与邻人争宅址。将哄，阴刃族人江孜等，匿二尸图诬邻人。邻人知，不敢哄，全畀以宅，槔埋尸室中。数年，槔兄千户楫枉杀其妻，槔嗾妻家讼楫，并诬楫杀孜事，楫拷死，无后，与弟槃重袭楫职。讼上监司台，付子业再鞫。业问槔以孜等尸所在，槔对曰：“楫杀孜埋尸其室，不知所在。”曰：“楫何事杀孜？”槔愕然，对曰：“为槔争宅址。”曰：“尔与同宅居乎？”对曰：“异居。”曰：“为尔争宅址，杀人埋尸己室，有斯理乎？”问吏曰：“搜尸槔室否？”对曰：“未也。”乃命搜槔室，掘地得二尸于槔居所，刃迹宛然，槔服罪。州人曰：“十年冤狱，一旦得雪。”","州豪吴世杰诬族人吴世江奸盗，拷掠死二十余命，世江更数冬不死。子业覆狱牍，问曰：“盗赃布裙一，谷数斛。世江有田若庐，富而行劫，何也。”世杰曰：“贼饵色。”即呼奸妇问之曰：“盗奸若何？”对曰：“奸也。”“何时？”曰：“夜。”曰：“夜奸何得识贼名？”对曰：“世杰教我贼名。”世杰遂伏诬杀人罪。"]},{"title":"察智部·李德裕","content":["【原文】","李德裕镇浙右。甘露寺僧诉交代常住什物，被前主事僧耗用常住金若干两，引证前数辈，皆有递相交领文籍分明，众词指以新得替人隐而用之，且云：“初上之时，交领分两既明，及交割之日，不见其金。”鞫成具狱，伏罪昭然。未穷破用之所，公疑其未尽，微以意揣之，僧乃诉冤曰：“积年以来，空交分两文书，其实无金矣。众乃以孤立，欲乘此挤之。”公曰：“此不难知也。”乃召兜子数乘，命关连僧人对事，遣入兜子中，门皆向壁，不令相见；命取黄泥各模交付下次金样以凭证据，僧既不知形状，竟摸不成，前数辈皆伏罪。"]},{"title":"察智部·张齐贤","content":["【原文】","戚里有分财不均者，更相讼。齐贤曰：“是非台府所能决，臣请自治之。”齐贤坐相府，召讼者问曰：“汝非以彼分财多，汝分少乎？”曰：“然。”具款，乃召两吏，令甲家入乙舍，乙家入甲舍，货财无得动，分书则交易，明日奏闻，上曰：“朕固知非君不能定也。”"]},{"title":"察智部·宣彦昭 范邰","content":["【原文】","宣彦昭仕元，为平阳州判官，天大雨，民与军争簦，各认己物。彦昭裂而为二，并驱出，使卒踵其后。军忿噪不已，民曰：“汝自失簦，于我何与？”卒以闻，彦昭杖民，令买簦偿军。","范邵为浚仪令，二人挟绢于市互争，令断之，各分一半去，后遣人密察之，有一喜一愠之色，于是擒喜者。","〔评〕李惠断燕巢事，即此一理所推也。","魏雍州厅事有燕争巢，斗已累日。刺史李惠令人掩护，试命纪纲断之，并辞。惠乃使卒以弱竹弹两燕，既而一去一留。惠笑谓属吏曰：“此留者，自计为巢功重；彼去者，既经楚痛，理无固心。”群下服其深察。"]},{"title":"察智部·安重荣 韩彦古","content":["【原文】","安重荣虽武人而习吏事。初为成德节度，有夫妇讼其子不孝者。重荣拔剑，授其父使自杀之。其父泣不忍，其母从旁诟夫面，夺剑而逐其子，问之，乃继母也。重荣为叱其母出，而从后射杀之。","韩彦古字子师，延安人，蕲王世忠之子。知平江府。有士族之母，讼其夫前妻子之者，以衣冠扶掖而来，乃其嫡子也。彦古曰：“事体颇重，当略惩戒之。”母曰：“业已论诉，愿明公据法加罪。”彦古曰：“若然，必送狱而后明，汝年老，必不能理对，姑留扶掖之子，就狱与证，徐议所决。”母良久云：“乞文状归家，俟其不悛，即再告理。”由是不敢复至。"]},{"title":"察智部·孙亮","content":["【原文】","亮出西苑，方食生梅，使黄门至中藏取蜜渍梅，蜜中有鼠矢。亮问主藏吏曰：“黄门从汝求蜜耶？”曰：“向求之，实不敢与。”黄门不服，左右请付狱推，亮曰：“此易知耳。”令破鼠矢，里燥，亮曰：“若久在蜜中，当湿透；今里燥，必黄门所为!”于是黄门首服。"]},{"title":"察智部·赵广汉","content":["【原文】","赵广汉为颍川太守。先是颍川豪杰大姓，相与为婚姻，吏俗朋党。广汉患之，察其中可用者，受记。出有案问，既得罪名，行法罚之。广汉故漏泄其语，缶卢筒，及得投书，削其主名。而托以为豪杰大姓子弟所言，其后强宗大族家家结下仇怨，奸党散落，风俗大改。","广汉尤善为钩距，以得事情。钩距者，设欲知马价，则先问狗，已问羊，又问牛，然后及马，参伍④其价，以类相准，则知马之贵贱，不失实矣。唯广汉至精能行之，他人效者莫能及。"]},{"title":"察智部·周忱","content":["【原文】","周文襄公忱巡抚江南，有一册历，自记日行事，纤悉不遗，每日阴晴风雨，亦必详记。人初不解。一日某县民告粮船江行失风，公诘其失船为某日午前午后，东风西风，其人所对参错。公案籍以质，其人惊服。始知公之日记非漫书也。","〔评〕蒋颖叔为江淮发运，尝于所居公署前立占风旗，使日候之置籍焉。令诸漕纲吏程亦各记风之便逆。每运至，取而合之，责其稽缓者，纲吏畏服。文襄亦有所本。"]},{"title":"察智部·王世贞","content":["【原文】","王世贞备兵青州，部民雷龄以捕盗横莱、潍间，海道宋购之急而遁，以属世贞。世贞得其处，方欲掩取，而微露其语于王捕尉者，还报又遁矣。世贞阳曰：“置之。”又旬月，而王王世贞尉擒得他盗，世贞知其为龄力也，忽屏左右召王尉诘之：“若奈何匿雷龄？往立阶下闻捕龄者非汝邪？”王惊谢，愿以飞骑取龄自赎。俄龄至，世贞曰：“汝当死，然汝能执所善某某盗来，汝生矣。”而令王尉与俱，果得盗。世贞遂言于宋而宽之。","官校捕七盗，逸其一。盗首妄言逸者姓名，俄缚一人至，称冤。乃令置盗首庭下差远，而呼缚者跽阶上，其足蹑丝履，盗数后窥之。世贞密呼一隶，蒙缚者首，使隶肖之，而易其履以入。盗不知其易也，即指丝履者，世贞大笑曰：“尔乃以吾隶为盗!”即释缚者。"]},{"title":"察智部·范槚","content":["【原文】","范槚，会稽人，守淮安。景王出藩，大盗谋劫王，布党起天津至鄱阳，分徒五百人，往来游奕。一日晚衙罢，门卒报有贵客入僦潘氏园寓孥者，问：“有传牌乎？”曰：“否。”命调之，报曰：“从者众矣，而更出入。”心疑为盗，阴选健卒数十，易衣帽如庄农，曰：“若往视其徒入肆者，阳与饮，饮中挑与斗，相执絷以来。”而戒曰：“慎勿言捕贼也。”卒既散去，公命舆谒客西门，过街肆，持者前诉，即收之。比反，得十七人。阳怒骂曰：“王舟方至，官司不暇食，暇问汝斗乎？”叱令就系。入夜，传令儆备，而令吏饱食以需。漏下二十刻，出诸囚于庭，厉声叱之，吐实如所料。即往捕贼，贼首已遁。所留孥，妓也。于是飞骑驰报徐、扬诸将吏，而毙十七人于狱，全贼溃散。"]},{"title":"察智部·高湝 杨津","content":["【原文】","北齐任城王湝领并州刺史，有妇人临汾水浣衣，有乘马行人换其新靴，驰而去。妇人持故靴诣州言之，湝乃召居城诸妪，以靴示之。（边批：如妪多安得尽召？悬靴为招可也。）绐云：“有乘马人于路被贼劫害，遗此靴焉，得无亲族乎？”一妪抚膺哭曰：“儿昨着此靴向妻家也。”捕而获之，时称明察。","杨津为岐州刺史，有武功人赍绢三匹，去城十里为贼所劫。时有使者驰驿而至，被劫人因以告之。使者到州以状白津，津乃下教云：“有人着某色衣，乘某色马，在城东十里被杀，不知姓名，若有家人，可速收视。”有一老母行哭而出，云是己子。于是遣骑追收，并绢俱获，自是合境畏服。"]},{"title":"察智部·陈襄","content":["【原文】","襄摄浦城令，民有失物者，贼曹捕偷儿数辈至，相撑拄。襄曰：“某庙钟能辨盗，犯者扪之辄有声，否则寂。”乃遣吏先引盗行，自率同列诣钟所，祭祷而阴涂以墨，蔽以帷，命群盗往扪。少焉呼出，独一人手不污。扣之，乃盗也。盖畏钟有声，故不敢扪云。","〔评〕按襄倡道海滨，与陈烈、周希孟、郑穆为友，号“四先生”云。"]},{"title":"察智部·包拯","content":["【原文】","包拯包孝肃知天长县，有诉盗割牛舌者，公使归屠其牛鬻之，既有告此人盗杀牛者，公曰：“何为割其家牛舌，而又告之？”盗者惊伏。"]},{"title":"察智部·范纯仁","content":["【原文】","参军宋儋年暴死。范纯仁使子弟视丧，小殓，口鼻血出。纯仁疑其非命，按得其妾与小吏奸，因会，置毒鳖肉中。纯仁问：“食肉在第几巡？”曰：“岂有既中毒而尚能终席者乎？”再讯之，则儋年素不食鳖；其曰毒鳖肉者，盖妾与吏欲为变狱张本，以逃死尔。实儋年醉归。毒于酒而杀之，遂正其罪。"]},{"title":"胆智部·总序","content":["【原文】","冯子曰：凡任天下事，皆胆也；其济，则智也。知水溺，故不陷；知火灼，故不犯。其不入不犯，其无胆也，智也。若自信入水必不陷，入火必不灼，何惮而不入耶？智藏于心，心君而胆臣，君令则臣随。令而不往，与夫不令而横逞者，其君弱。故胆不足则以智炼之，胆有余则以智裁之。智能生胆，胆不能生智。刚之克也，勇之断也，智也。赵思绾尝言：“食人胆至千，刚勇无敌。”每杀人，辄取酒吞其胆。夫欲取他人之胆。益己之胆，其不智亦甚矣!必也取他人之智，以益己之智，智益老而胆益壮，则古人中之以“威克”、以“识断”者，若而人，吾师平!"]},{"title":"胆智部·班超","content":["【原文】","窦固出击匈奴，以班超为假司马，将兵别击伊吾，战于蒲类海，多斩首虏而还。固以为能，遣与从事郭恂俱使西域。超到鄯善，鄯善王广奉超，礼敬甚备，后忽更疏懈。超谓其官属曰：“宁觉广礼意薄乎？此必有北虏使来，狐疑未知所从故也。明者睹未萌，况已著耶？”乃召侍胡，诈之曰：“匈奴使来数日，今安在？”侍胡惶恐，具服其状。超乃闭侍胡，悉会其吏士三十六人，与共饮，酒酣，因激怒之曰：“卿曹与我俱在西域，欲立大功以求富贵，今虏使到数日，而王广礼敬即废，如令鄯善收吾属送匈奴，骸骨长为豺狼食矣，为之奈何？”官属皆曰：“今危亡之地，死生从司马。”超曰：“不入虎穴，焉得虎子!当今之计，独有因夜以火攻虏，使彼不知我多少，必大震怖，可殄尽也!灭此虏，则鄯善破胆，功成事立矣!”众不应有宜曰：“当与从事议之。”超怒曰：“吉凶决于今日，从事文俗吏，闻此必恐而谋泄，死无所名，非壮士也。”众曰：“善。”初夜，遂将吏士往奔虏营。（边批：古今第一大胆。）会天大风，超令十人持鼓，藏虏舍后，约曰：“见火然后鸣鼓大呼。”余人悉持弩，夹门而伏。（边批：三十六人用之有千万人之势。）超乃顺风纵火，前后鼓噪。虏众惊乱，超手格杀三人，吏兵斩其使及从士三十余级，余众百许人，悉烧死。明日乃还告郭恂，恂大惊，既而色动，超知其意，举手曰：“掾虽不行，班超何心独擅之乎？”恂乃悦，超于是召鄯善王广，以虏使首示之。一国震怖，超晓告抚慰，遂纳子为质，还奏于窦固。固大喜，具上超功效，并求更选使使西域。帝壮超节，诏固曰：“吏如班超，何故不遣而更选乎？今以超为军司马，令遂前功。”超复受使，（边批：明主。）因欲益其兵，超曰：“愿将本所从三十余人足矣。如有不虞，多益为累。”是时于阗王广德新攻破莎车，遂雄张南道，而匈奴遣使监护其国。超既西，先至于阗，广德礼意甚疏，且其俗信巫，巫言神怒：“何故欲向汉？汉使有马呙马，急求取以祠我。”广德乃遣使就超请马，超密知其状，报许之，而令巫自来取马。有顷，巫至，超即斩其首以送广德。因辞让之。广德素闻超在鄯善诛灭虏使，大惶恐，即攻杀匈奴使而降超。超重赐其王以下，因镇抚焉。","〔评〕必如班定远，方是满腹皆兵，浑身是胆。赵子龙、姜伯约不足道也。","辽东管家庄，长男子不在舍，建州虏至，驱其妻子去。三数日，壮者归，室皆空矣，无以为生。欲佣工于人，弗售。乃谋入虏地伺之，见其妻出汲，密约夜以薪积舍户外焚之，并积薪以焚其屋角。火发，贼惊觉。裸体起出户，壮者射之，贼皆死。挈其妻子，取贼所有归。是后他贼惮之，不敢过其庄云。此壮者胆勇，一时何减班定远，使室家无恙；或佣工而售，亦且安然不图矣。人急计生，信夫!"]},{"title":"胆智部·耿纯","content":["东汉真定王扬谋反，光武使耿纯持节收扬。纯既受命，若使州郡者至真定，止传舍。扬称疾不肯来，与纯书，欲令纯往。纯报曰：“奉使见侯王牧守，不得先往，宜自强来！”时扬弟让、从兄绀皆拥兵万余。扬自见兵强而纯意安静，即从官属诣传舍，兄弟将轻兵在门外。扬入，纯接以礼，因延请其兄弟，皆至，纯闭门悉诛之。勒兵而出，真定震怖，无敢动者。"]},{"title":"胆智部·哥舒翰 李光弼","content":["【原文】","唐哥舒翰为安西节度使，差都兵马使张擢上都奏事，逗留不返，纳贿交结杨国忠。翰适入朝，擢惧，求国忠除擢御史大夫兼剑南西川节度使。敕下，就第谒翰，翰命部下摔于庭，数其罪，杖杀之，然后奏闻。帝下诏褒奖，仍赐擢尸，更令翰决尸一百。（边批：圣主。）","太原节度王承业，军政不修，诏御史崔众交兵于河东。众侮易承业，或裹甲持枪突入承业厅事，玩谑之。李光弼闻之，素不平，至是交众兵于光弼，众以麾下来，光弼出迎，旌旗相接而不避。光弼怒其无礼，又不即交兵，令收系之。顷中使至，除众御史中丞，怀其敕，问众所在。光弼曰：“众有罪，系之矣。”中使以敕示光弼，光弼曰：“今只斩侍御史；若宣制命，即斩中丞；若拜宰相，亦斩宰相。”中使惧，遂寝之而还。翼日，以兵仗围众至碑堂下，斩之。威震三军，命其亲属吊之。","〔评〕或问擢与众诚有罪，然已除西川节度使及御史中丞矣，其如王命何？盖军事尚速，当用兵之际而逗留不返、拥兵不交，皆死法也。二人之除命必皆夤缘得之，而非出天子之意者，故二将得伸其权，而无人议其后耳。然在今日，莫可问矣。"]},{"title":"胆智部·杨素","content":["【原文】","杨素攻陈时，使军士三百人守营。军士惮北军之强，多愿守营。素闻之，即召所留三百人悉斩之，更令简留，无愿留者。又对阵时，先令一二百人赴敌，或不能陷阵而还者，悉斩之。更令二三百人复进，退亦如之。将士股栗，有必死之心，杨素以是战无不克。","〔评〕素用法似过峻，然以御积惰之兵，非此不能作其气。夫使法严于上，而士知必死，虽置之散地，犹背水矣。"]},{"title":"胆智部·安禄山","content":["【原文】","安禄山将反前两三日，于宅集宴大将十余人，锡赍绝厚。满厅施大图，图山川险易、攻取剽劫之势。每人付一图，令曰：“有违者斩!”直至洛阳，指挥皆毕。诸将承命，不敢出声而去。于是行至洛阳，悉如其画。","〔评〕此虏亦煞有过人处，用兵者可以为法。"]},{"title":"胆智部·宗泽","content":["【原文】","金寇犯阙，銮舆南幸。贼退，以宗公汝霖尹开封。初至，而物价腾贵，至有十倍于前者。郡人病之，公谓参佐曰：“此易事，自都人率以饮食为先，当治其所先，缓者不忧于平也。”密使人问米麦之值，且市之。计其值，与前此太平时初无甚增。乃呼庖人取面，令作市肆笼饼大小为之，乃取糯米一斛，令监军使臣如市沽酝酒，各估其值，而笼饼枚六钱，酒每觚七十足。出勘市价，则饼二十，酒二百也。公先呼作坊饼师至，讽之曰：“自我为举子时来京师，今三十年矣，笼饼枚七钱，而今二十，何也，岂麦价高倍乎？”饼师曰：“自都城经乱以来，米麦起落，初无定价，因袭至此，某不能违众独减，使贱市也。”公即出兵厨所作饼示之，且语之曰：“此饼与汝所市重轻一等，而我以目下市直，会计薪面工值之费，枚止六钱，若市八钱，则有二钱之息，今为将出令，止作八钱，敢擅增此价而市者，罪应处斩。且借汝头以行吾令也。”明日饼价仍旧，亦无敢闭肆者。次日呼官沽任修武至，讯之曰：“今都城糯米价不增，而酒值三倍，何也？”任恐悚以对曰：“某等开张承业，欲罢不能。而都城自遭寇以来，外居宗室及权贵亲属私酿甚多，不如是无以输纳官曲之值与工役油烛之费也。”公曰：“我为汝尽禁私酿，汝减值百钱，亦有利入乎？”任叩额曰：“若尔，则饮者俱集，多中取息，足办输役之费。”公熟视久之，曰：“且寄汝头颈上，出率汝曹即换招榜，一觚止作百钱，是不患乎私酝之搀夺也!”明日出令：“敢有私造曲酒者，捕至不问多寡，并行处斩。”于是倾糟破觚者不胜其数。数日之间，酒与饼值既并复旧，其他物价不令而次第自减，既不伤市人，而商旅四集，兵民欢呼，称为神明之政。时杜充守北京，号“南宗北杜”云。","〔评〕借饼师头虽似惨，然禁私酿、平物价，所以令出推行全不费力者，皆在于此。亦所谓权以济难者乎？当湖冯汝弼《祐山杂说》云：“甲辰凶荒之后，邑人行乞者什之三，逋负者什之九。明年，本府赵通判临县催征，命选竹板重七斤者，拶长三寸者，邑人大恐，或诳行乞者曰：‘赵公领府库银三千两来赈济，汝何不往？’行乞者更相传播，须臾数百人相率诣赵。赵不容入，则叫号跳跃，一拥而进，逋负者随之，逐隶人，毁刑具，呼声震动。赵惶惧莫知所措。余与上莘辈闻变趋入，赵意稍安，延入后堂。则击门排闼，势益猖獗。问欲何为，行乞者曰：‘求赈济。’逋负者曰：‘求免征。’赵问为首者姓名，余曰：‘勿问也，知其姓名，彼虑后祸，祸反不测，姑顺之耳。’于是出免征牌，及县备豆饼数百以进，未及门辄抢去，行乞者率不得食。抵暮，余辈出，则号呼愈甚，突入后堂矣!赵虑有他变，逾墙宵遁。自是民颇骄纵无忌。又二月，太守郭平川应奎推为首者数人于法，即惕然⑤相戒，莫敢复犯矣。向使赵不严刑，未必致变；郭不正法，何由弭乱？宽严操纵，唯识时务者知之。”"]},{"title":"胆智部·齐桓公","content":["【原文】","宁戚，卫人，饭牛车下，扣角而歌。齐桓公异之，将任以政。群臣曰：“卫去齐不远，可使人问之，果贤，用未晚也。”公曰：“问之，患其有小过，以小弃大，此世所以失天下士也。”乃举火而爵之上卿。","〔评〕孔明深知魏延之才，而又知其才之必不为人下，故未免虑之太深，防之太过，持之太严，宁使有余才，而不欲尽其用，其不听子午谷之计者，胆为识掩也。","呜呼，胆盖难言之矣!魏以夏侯楙镇长安。丞相亮伐魏，魏延献策曰：“楙怯而无谋，今假延精兵五千，直从褒中出，循秦岭而东，当子午而北，不过十日，可到长安。楙闻延奄至，必弃城走，比东方相合，尚二十许日。而公从斜谷来，亦足以达。如此则一举而咸阳以西可定矣!”亮以为危计，不用。","齐桓公任登为中牟令，荐士于襄主，曰瞻胥已，襄主以为中大夫。相室谏曰：“君其耳而未之目也，为中大夫若此其易也!”襄子曰：“我取登，既耳而目之矣，登之所取，又耳而目之，是耳目人终无已也!”此亦齐桓之智也。"]},{"title":"胆智部·周瑜 寇准 陈康伯","content":["【原文】","曹操既得荆州，顺流东下，遗孙权书，言：“治水军八十万众，与将军会猎于吴。”张昭等曰：“长江之险，已与敌共。且众寡不敌，不如迎之。”鲁肃独不然，劝权召周瑜于鄱阳。瑜至，谓权曰：“操托名汉相，实汉贼也。将军割据江东，兵精粮足，当为汉家除残去秽。况操自送死而可迎之耶？请为将军筹之。今北土未平，马超、韩遂尚在关西，为操后患；而操舍鞍马，仗舟楫，与吴越争衡；又今盛寒，马无藁草；中国士众，远涉江湖之险，不习水土，必生疾病。——此数者，用兵之患周瑜也。瑜请得精兵五万人，保为将军破之!”权曰：“孤与老贼誓不两立!”因拔刀砍案曰：“诸将敢复言迎操者，与此案同。”竟败操于赤壁。","契丹寇澶州，边书告急，一夕五至，中外震骇。寇准不发，饮笑自如。真宗闻之，召准问计，准曰：“陛下欲了此，不过五日。（边批：大言。）愿驾幸澶州。”帝难之，欲还内，准请毋还而行，乃召群臣议之。王钦若，临江人，请幸金陵；陈尧叟，阆州人，请幸成都。准曰：“陛下神武，将臣协和，若大驾亲征，敌当自遁，奈何弃庙社远幸楚、蜀？所在人心崩溃，敌乘势深入，天下可复保耶？”帝乃决策幸澶州，准曰：“陛下若入宫，臣不得到，又不得见，则大事去矣。请毋还内。”驾遂发，六军、有司追而及之。临河未渡，是夕内人相泣。上遣人瞷准。方饮酒鼾睡。明日又有言金陵之谋者，上意动。准固请渡河，议数日不决。准出见高烈武王琼，谓之曰：“子为上将，视国危不一言耶？”琼谢之，乃复入，请召问从官，至皆嘿然。上欲南下，准曰：“是弃中原也!”又欲断桥因河而守，准曰：“是弃河北也!”上摇首曰：“儒者不知兵。”准因请召诸将，琼至，曰：“蜀远，钦若之议是也，上与后宫御楼船，浮汴而下，数日可至。”众皆以为然，准大惊，色脱。琼又徐进曰：“臣言亦死，不言亦死，与其事至而死，不若言而死。（边批：此举全得高公力，上所信者，武臣也。）今陛下去都城一步，则城中别有主矣，吏卒皆北人，家在都下，将归事其主，谁肯送陛下者，金陵亦不可到也。”准又喜过望，曰：“琼知此，何不为上驾？”琼乃大呼逍遥子，准掖上以升，遂渡河，幸澶渊之北门。远近望见黄盖，诸军皆踊跃呼万岁，声闻数十里。契丹气夺，来薄城，射杀其帅顺国王挞览，敌惧，遂请和。","金主亮南侵，王权师溃昭关，帝命杨存中就陈康伯议，欲航海避敌。康伯延之入，解衣置酒。帝闻之，已自宽。明日康伯入奏曰：“闻有劝陛下幸海趋闽者，审尔，大事去矣!盍静以待之？”一日，帝忽降手诏曰：“如敌未退，散百官。”康伯焚诏而后奏曰：“百官散，主势孤矣。”帝意始坚。康伯乃劝帝亲征。","〔评〕是役，准先奏请，乘契丹兵未逼镇、定，先起定州军马三万南来镇州，又令河东兵出土门路会合，渐至邢、詺，使大名有恃，然后圣驾顺动。又遣将向东旁城塞牵拽，又募强壮入虏界，扰其乡村，俾虏有内顾之忧。又檄令州县坚壁，乡村入保，金币自随，谷不徙者，随在瘗藏。寇至勿战，故虏虽深入而无得。方破德清一城，而得不补失，未战而困。若无许多经略，则渡河真孤注矣。","迟魏之帝者，一周瑜也；保宋之帝者，一寇准也；延宋之帝者，一陈康伯也。"]},{"title":"胆智部·寇恂","content":["【原文】","高峻久不下，光武遣寇恂奉玺书往降之。恂至，峻第遣军师皇甫文出谒，辞礼不屈，恂怒，请诛之。诸将皆谏，恂不听，遂斩之。遣其副归，告曰：“军师无礼，已戮之矣。欲降即降。不则固守!”峻恐。即日开城门降。诸将皆贺，因曰：“敢问杀其使而降其城，何也？”恂曰：“皇甫文，峻之腹心，其所取计者也。（边批：千金不可购，今自送死，奈何失之？）今来辞意不屈，必无降心。全之则文得其计，杀之则峻亡其胆，是以降耳。”","〔评〕唐僖宗幸蜀，惧南蛮为梗，许以婚姻。蛮王命宰相赵隆眉、杨奇鲲、段义宗来朝行在，且迎公主。高太尉骈自淮南飞章云：“南蛮心膂，唯此数人，请止而鸩之。”迄僖宗还京，南方无虞，此亦寇恂之余智也。"]},{"title":"术智部·总序","content":["【原文】","冯子曰：“智者，术所以生也；术者，智所以转也。不智而言术，如傀儡百变，徒资嘻笑，而无益于事。无术而言智，如御人舟子，自炫执辔如组，运楫如风，原隰关津，若在其掌，一遇羊肠太行、危滩骇浪，辄束手而呼天，其不至颠且覆者几希矣。蠖之缩也，蛰之伏也，麝之决脐也，蚺之示创也，术也。物智其然，而况人乎？李耳化胡，禹入裸国而解衣，孔尼较猎，散宜生行贿，仲雍断发文身，裸以为饰。”不知者曰：“圣贤之智，有时而殚。”知者曰：“圣贤之术，无时而窘。”婉而不遂，谓之“委蛇”；匿而不章，谓之“谬数”；诡而不失，谓之“权奇”。不婉者，物将格之；不匿者，物将倾之；不诡者，物将厄之。呜呼!术神矣!智止矣!"]},{"title":"术智部·箕子","content":["【原文】","纣为长夜之饮而失日，问其左右，尽不知也。使问箕子，箕子谓其徒曰：“为天下主，而一国皆失日，天下共危矣。一国皆不知，而我独知之，吾其危矣!”辞以醉而不知。","〔评〕凡无道之世，名为天醉。夫天且醉矣，箕子何必独醒？观箕子之智，便觉屈原之愚。"]},{"title":"术智部·孔融","content":["【原文】","荆州牧刘表不供职贡，多行僭伪，遂乃郊祀天地，拟斥乘舆。诏书班下其事，孔融上疏，以为“齐兵次楚，唯责包茅，今王师未即行诛，且宜隐郊祀之事，以崇国体。若形之四方，非所以塞邪萌。”","〔评〕凡僭叛不道之事，骤见则骇，习闻则安。力未及剪除而章其恶，以习民之耳目，且使民知大逆之逋诛，朝廷何震之有？召陵之役，管夷吾不声楚僭，而仅责楚贡，取其易于结局，度势不得不尔。孔明使人贺吴称帝，非其欲也，势也。儒家“虽败犹荣”之说，误人不浅。"]},{"title":"术智部·王曾","content":["【原文】","丁晋公执政，不许同列留身奏事，唯王文正一切委顺，未尝忤其意。一日，文正谓丁曰：“曾无子，欲以弟之子为后，欲面求恩泽，又不敢留身。”丁曰：“如公不妨。”文正因独对，进文字一卷，具道丁事，丁去数步，大悔之。不数日，丁遂有珠崖之行。","〔评〕王曾独委顺丁谓，而卒以出谓，蔡京首奉行司马光，而竟以叛光，一则君子之苦心，一则小人之狡态。"]},{"title":"术智部·王翦 萧何","content":["【原文】","秦伐楚，使王翦将兵六十万人，始皇自送至灞上。王翦行，请美田宅园地甚众，始皇曰：“将军行矣，何忧贫乎？”王翦曰：“为大王将，有功终不得封侯；故及大王之向臣，臣亦及时以请园地，为子孙业耳。”始皇大笑。王翦既至关，使使还请善田者五辈，或曰：“将军之乞贷亦已甚矣!”王翦曰：“不然，夫秦王恒中粗而不信人，今空秦国甲士而专委于我，我不多请田宅为子孙业以自坚，顾令秦王坐而疑我耶？”","汉高专任萧何关中事。汉三年，与项羽相距京、索间。上数使使劳苦丞相，鲍生谓何曰：“今王暴衣露盖，数劳苦君者，有疑君心也，（边批：晁错使天子将兵而居守，所以招祸。）为君计，莫若遣君子孙昆第能胜兵者，悉诣军所。”于是何从其计，汉王大悦。","吕后用萧何计诛韩信，上已闻诛信，使使拜何为相国，益封五千户，令卒五百人，一都尉为相国卫。诸君皆贺，召平独吊。曰：“祸自此始矣!上暴露于外，而君守于内，非被矢石之难，而益封君置卫，非以宠君也，以今者淮阴新反，有疑君心，愿君让封勿受，悉以家财佐军。”何从之，上悦。其秋黥布反，上自将击之。数使使问相国何为，曰：“为上在军，拊循勉百姓，悉取所有佐军，如陈豨时。”客又说何曰：“君灭族不久矣!夫君位为相国，功第一，不可复加。然君初入关中，得百姓心十余年矣，尚复孳孳得民和。上所为数问君，畏君倾动关中。今君胡不多买田地，贱贳贷以自污。（边批：王翦之智。）上心必安。”于是何从其计。上还，百姓遮道诉相国，上乃大悦。","〔评〕汉史又言，何买田宅必居穷僻处，不治垣屋，曰：“令后世贤，师吾俭；不贤，无为势家所夺。”与前所云强买民田宅似属两截，不知前乃免祸之权，后乃保家之策，其智政不相妨也。宋赵韩王普强买人第宅，聚敛财贿，为御史中丞雷德骧所劾。韩世忠既罢，杜门绝客，口不言兵，时跨驴携酒，从一二奚童，纵游西湖以自乐。尝议买新淦县官田，高宗闻之，甚喜，赐御札，号其庄曰：“旌忠”。二公之买田，亦此意也。夫人主不能推肝胆以与豪杰功，至令有功之人，不惜自污以祈幸免。三代交泰之风荡如矣!然降而今日，大臣无论有功无功，无不多买田宅自污者，彼又持何说耶？","陈平当吕氏异议之际，日饮醇酒，弄妇人；裴度当宦官熏灼之际，退居绿野，把酒赋诗，不问人间事。古人明哲保身之术，例如此，皆所以绝其疑也。","国初，御史袁凯以忤旨引风疾归。太祖使人觇之，见凯方匍匐往篱下食猪犬矢，还报，乃免。盖凯逆知有此，使家人以炒面搅砂糖，从竹筒出之，潜布篱下耳，凯亦智矣哉!"]},{"title":"术智部·阮籍","content":["【原文】","魏、晋之际，天下多故，名士鲜有全者。阮籍托志酣饮，绝不与世事。司马昭初欲为子炎求昏于籍，籍一醉六十日，昭不得言而止。钟会数访以时事，欲因其可否致之阮籍罪，竟以酣醉不答获免。"]},{"title":"术智部·周武王","content":["【原文】","武王立重泉之戍，令曰：“民有百鼓之粟者不行。”民举所最粟以避重泉之戍，而国谷二十倍。","〔评〕假设戍名，欲人惮役而竟收粟，倘亦权宜之术，而或谓圣王不应为术以愚民，固矣!至若《韩非子》谓，汤放桀欲自立，而恐人议其贪也，让于务光，又虞其受，使人谓光曰：“汤弑其君，而欲以恶名予子。”光因自投于河；文王资费仲周武王而游于纣之旁，令之间纣以乱其心，此则孟氏所谓“好事者为之”。非其例也。"]},{"title":"术智部·范仲淹","content":["【原文】","皇祐二年，吴中大饥，时范仲淹领浙西，发粟及募民存饷，为术甚备。吴人喜竞渡，好为佛事。仲淹乃纵民竞渡，太守日出宴于湖上。自春至夏，居民空巷出游。又召诸佛寺主守，谕之曰：“今岁工价至贱，可以大兴土木。”于是诸寺工作并兴。又新仓廒吏舍，日役千夫。监司劾奏杭州不恤荒政，游宴兴作，伤财劳民。公乃条奏：“所以如此，正欲发有余之财，以惠贫者，使工技佣力之人，皆得仰食于公私，不致转徙沟壑耳。”是岁唯杭饥而不害。","〔评〕《周礼》荒政十二，或兴工作，以聚失业之人。但他人不能举行，而文正行之耳。凡出游者，必其力足以游者也。游者一人，而赖游以活者不知几十人矣。万历时吾苏大荒，当事者以岁俭禁游船。富家儿率治馔僧舍为乐，而游船数百人皆失业流徙，不通时务者类如此。"]},{"title":"术智部·王导","content":["【原文】","王导王丞相善于国事。初渡江，帑藏空竭，唯有练数千端。丞相与朝贤共制练布单衣。一时士人翕然竞服，练遂踊贵。乃令主者卖之，每端至一金。","〔评〕此事正与“恶紫”对照。谢安之乡人有罢官者，还，诣安。安问其归资，答曰：“唯有蒲葵扇五万。”安乃取一中者捉之。士庶竞市，价遂数倍。此即王丞相之故智。"]},{"title":"术智部·晏婴","content":["【原文】","晏婴齐人甚好毂击，相犯以为乐。禁之，不止，晏子患之。乃为新车良马，出与人相犯也，曰：“毂击者不祥。臣其祭祀不顺、居处不敬乎？”下车弃而去之，然后国人乃不为。"]},{"title":"术智部·东方朔","content":["【原文】","东方朔武帝好方士，使求神仙不死之药。东方朔乃进曰：“陛下所使取者，皆天下之药，不能使人不死；唯天上药，能使人不死。”上曰：“天何可上？”朔对曰：“臣能上天。”上知其谩诧，欲极其语，即使朔上天取药。朔既辞去，出殿门，复还曰：“今臣上天似谩诧者，愿得一人为信。”上即遣方士与俱，期三十日而返。朔既行，日过诸侯传饮，期且尽，无上天意，方士屡趋之，朔曰：“神鬼之事难豫言，当有神来迎我。”于是方士昼寝，良久，朔觉之曰：“呼君极久不应，我今者属从天上来。”方士大惊，具以闻，上以为面欺，诏下朔狱，朔啼曰：“朔顷几死者再。”上曰：“何也？”朔对曰：“天帝问臣：‘下方人何衣？’臣朔曰：‘衣虫。’‘虫何若？’臣朔曰：‘虫喙髯髯类马，色邠邠类虎。’天公大怒，以臣为谩言，使使下问，还报曰：‘有之，厥名蚕。’天公乃出臣。今陛下苛以臣为诈，愿使人上天问之。’”上大笑曰：“善。齐人多诈，欲以喻我止方士也。”由是罢诸方士不用。"]},{"title":"术智部·颜真卿","content":["【原文】","真卿为平原太守，禄山逆节颇著，真卿托以霖雨，修城浚壕，阴料丁壮，实储廪，佯命文士饮酒赋诗。禄山密侦之，以为书生不足虞，未几禄山反，河朔尽陷，唯平原有备。","〔评〕小寇以声驱之，大寇以实备之。或无备而示之有备者，杜其谋也；或有备而示之无备者，消其忌也。必有深沉之思，然后有通变之略。微乎!微乎!岂易言哉？"]},{"title":"术智部·谢安 李郃","content":["【原文】","桓温病笃，讽朝廷加己九锡。谢安使袁宏具草，安见之，辄使宏改，由是历旬不就，温薨，锡命遂寝。","大将军窦宪内妻，郡国俱往贺。汉中太守亦欲遣使，户曹李郃谏曰：谢安“窦氏恣横，危亡可立俟矣。愿明府勿与通。”太守固遣，郃乃请自行，故所在迟留，以观其变。行至扶风，而宪已诛，诸交通者皆连坐，唯太守以不预得免。","〔评〕按袁宏草成，以示王彪之。彪之曰：“卿文甚美，然此文何可示人？安之频改，有以也。”","李郃，字孟节，即知二使星来益部者。其决窦氏之败，或亦天文有征，然至理亦不过是。"]},{"title":"术智部·晏婴二","content":["【原文】","公孙接、田开疆、古冶子同事景公，恃其勇力而无礼，晏子请除之，公曰：“三子者搏之不得，刺之恐不中也。”晏子请公使人馈之二桃，曰：“三子何不计功而食桃？”公孙接曰：“接一搏豨，而再搏乳虎，若接之功，可以食桃而无与人同矣。”援桃而起。田开疆曰：“吾伏兵而却三军者再，若开疆之功，亦可以食桃而无与人同矣。”援桃而起。古冶子曰：“吾尝从君济于河，鼋衔左骖①，以入砥柱之流。当是时也，冶少不能游，潜行逆流百步，顺流九里，得鼋而杀之。左操骖尾，右挈鼋头，鹤跃而出，津人相惊，以为河伯。若冶之功，亦可以食桃而无与人同矣，二子何不反桃？”抽剑而起。公孙接、田开疆曰：“吾勇不子若，功不子逮，取桃不让，是贪也；然而不死，无勇也。”皆反其桃，挈领②而死。古冶子曰：“二子死之，冶独生之，不仁；耻人以言而夸其声，不义；恨乎所行不死，无勇。”亦反其桃，挈领而死。使者复命，公葬之以士礼。其后诸葛亮作《梁甫吟》以哀之。"]},{"title":"术智部·狄青","content":["【原文】","南俗尚鬼，狄武襄征侬智高时，大兵始出桂林之南，因祝曰：“胜负无以为据。”乃取百钱自持之，与神约：“果大捷，投此钱尽钱面。”左右谏止：“倘不如意，恐阻师。”武襄不听，万众方耸视，已而挥手倏一掷，百钱皆面，于是举军欢呼，声震林野。武襄亦大喜，顾左右取百钉来，即随钱疏密，布地而帖钉之，加以青纱笼，手自封焉，曰：“俟凯旋，当谢神取钱。”其后平邕州还师，如言取钱。幕府士大夫共视，乃两面钱也。","〔评〕桂林路险，士心惶感，故假神道以坚之。"]},{"title":"术智部·杨琎","content":["【原文】","杨琎授丹徒知县。会中使如浙，所至缚守令置舟中，得赂始释。将至丹徒，琎选善泅水者二人，令著耆老衣冠，先驰以迎。（边批：奇策奇想。）中使怒曰：“令安在，汝敢来谒我耶？”令左右执之，二人即跃入江中，潜遁去。琎徐至，绐曰：“闻公驱二人溺死江中，方今圣明之世，法令森严，如人命何？”中使惧，礼谢而去。虽历他所，亦不复放恣云。"]},{"title":"术智部·程婴","content":["【原文】","屠岸贾攻赵氏于下宫，杀赵朔、赵同、赵括、赵婴齐，皆灭其族。赵朔妻，成公姊也，有遗腹，走公宫匿，赵朔客曰公孙杵臼。杵臼谓朔友人程婴曰：“胡不死？”程婴曰：“朔之妇有遗腹。若幸而生男，吾奉之；即女也。吾徐死耳。”居无何，而朔妇娩身生男，屠岸贾闻之，索于宫中，夫人置儿裤中，祝曰：“赵宗灭乎，若号；即不灭，若无声。”及索儿，竟无声，已脱。程婴谓公孙杵臼曰：“今一索不得，后必且复索之，奈何？”公孙杵臼曰：“立孤与死孰难？”（边批：只一问，便定了局。）程婴曰：“死易，立孤难耳。”公孙杵臼曰：“赵氏先君遇子厚，子强为其难者。吾为其易者，请先死。”乃谋取他人婴儿负之，衣以文葆，匿山中。（边批：妙计。）程婴出，谬谓诸将军曰：“婴不肖，不能立赵孤，谁能与我千金，我告赵氏孤处。”（边批：更妙。）诸将军皆喜，许之。发师随程婴攻公孙杵臼，杵臼谬曰：“小人哉程婴!昔下宫之难不能死，与我谋匿赵氏孤儿，今又卖我，纵不能立，而忍卖之乎？”抱儿呼曰：“天乎!天乎!赵氏孤儿何罪？请活之，独杀杵臼可也!”诸将不许，遂杀杵臼与孤儿。诸将以为赵氏孤儿良已死，皆喜。然赵氏真孤乃反在，程婴卒与俱匿山中。居十五年，晋景公疾，卜之：“大业之后不遂者为祟。”（边批：安知非赂卜者使为此言。）景公问韩厥，厥知赵孤在，（边批：妙人。）乃以赵氏对，景公问：“赵尚有后子孙乎？”厥具以实告。于是景公乃与韩厥谋立赵孤儿，召而匿之宫中。诸将入问疾，景公因韩厥之众以胁诸将而见赵孤，赵孤名曰武。诸将不得已，皆委罪于屠岸贾，于是武、婴遍拜诸将，相与攻岸贾，灭其族。复与赵武田邑如故。及武既冠成人，婴曰：“吾将下报公孙杵臼。”遂自杀。","〔评〕赵氏知人，能得死士力，所以蹶而复起，卒有晋国。后世缙绅门下，不以利投，则以谀合，一旦有事，孰为婴、杵？","鲁武公与其二子括与戏朝周，宣王爱戏，立为鲁世子。武公薨，戏立，是为懿公。时公子称最少，其保母臧寡妇与其子俱入宫养公子称。括死，而其子伯御与鲁人作乱，攻杀懿公而自立，求公子称，将杀之。臧闻之，乃衣其子以称之衣，卧于称处，伯御杀之。臧遂抱称以出，遂与称舅同匿之。十一年，鲁大夫知称在，于是请于周而杀伯御，立称，是为孝公。时呼臧为“孝义保”。事在婴、杵前，婴、杵盖袭其智也。然婴之首孤，杵之责婴，假装酷似，不唯仇人不疑，而举国皆不知，其术更神矣，其心更苦矣!"]},{"title":"术智部·太史慈","content":["【原文】","北海相孔融闻太史慈避地东太史慈海，数使人馈问其母。后融为黄巾贼所围，慈适还，闻之，即从问道入围，见融。融使告急于平原相刘备。时贼围已密，众难其出，慈乃带鞬弯弓，将两骑自从，各持一的持之，开门出，观者并骇。慈径引马至城下堑内，植所持的射之，射毕还。明日复然，如是者再。围下人或起或卧，乃至无复起者。慈遂严行蓐食，鞭马直突其围。比贼觉，则驰去数里许矣，竟从备乞兵解围。"]},{"title":"术智部·司马懿 杨行密 孙坚 仇钺","content":["【原文】","曹爽擅政，懿谋诛之，惧事泄，乃诈称疾笃。会河南尹李胜将莅荆州，来候懿，懿使两婢侍持衣，指口言渴，婢进粥，粥皆流出沾胸，胜曰：“外间谓公旧风发动耳，何意乃尔？”懿微举声言：“君今屈并州，并州近胡，好为之备，吾死在旦夕，恐不复相见，以子师、昭为托。”胜曰：“当忝本州，非并州。”懿故乱其词曰：“君方到并州。”胜复曰：“忝荆州。”懿曰：“年老意荒，不解君语。”胜退告爽曰：“司马公尸居余气，形神已离，不足复虑。”于是爽遂不设备。寻诛爽。","安仁义、朱延寿，皆吴王杨行密将也，延寿又行密朱夫人之弟。淮徐已定，二人颇骄恣，且谋叛，行密思除之。乃阳为目疾，每接延寿使者，必错乱其所见以示之，行则故触柱而仆，朱夫人挟之，良久乃苏，泣曰：“吾业成而丧明，此天废我也，诸儿皆不足任事，得延寿付之，吾无恨矣。”朱夫人喜，急召延寿。延寿至，行密迎之寝门，刺杀之，即出朱夫人，而执斩仁义。","孙坚举兵诛董卓，至南阳，众数万人，檄南阳太守张咨，请军粮，咨曰：“坚邻二千石耳，与我等，不应调发。”竟不与。坚欲见之，又不肯见。坚曰：“吾方举兵而遂见阻，何以威后？”遂诈称急疾，举兵震惶，迎呼巫医，祷祠山川，而遣所亲人说咨，言欲以兵付咨。咨心利其兵，即将步骑五百人，持牛酒诣坚营。坚卧见，亡何起，设酒饮咨，酒酣，长沙主簿入白：“前移南阳，道路不治，军资不具，太守咨稽停义兵，使贼不时讨，请收按军法。”咨大惧，欲去。兵阵四围，不得出，遂缚于军门斩之。一郡震栗，无求不获，所过郡县皆陈糗粮以待坚军。君子谓坚能用法矣。法者，国之植也，是以能开东国。","正德五年，安化王寘鐇反，游击仇钺陷贼中，京师讹言钺从贼，兴武营守备保勋为之外应。李文正曰：“钺必不从贼，勋以贼姻家，遂疑不用，则诸与贼通者皆惧，不复归正矣。”乃举勋为参将，钺为副戎，责以讨贼。勋感激自奋，钺称病卧，阴约游兵壮士，候勋兵至河上，乃从中发为内应。俄得勋信，即嗾人谓贼党何锦：“宜急出守渡口，防决河灌城。遏东岸兵，勿使渡河。”锦果出，而留贼周昂守城。钺又称病亟，昂来问病，钺犹坚卧呻吟，言旦夕且死。苍头卒起，捶杀昂，斩首。钺起披甲仗剑，跨马出门一呼，诸游兵将士皆集，遂夺城门，擒寘鐇。"]},{"title":"术智部·曹冲","content":["【原文】","曹公有马鞍在库，为鼠所伤。库吏惧，欲自缚请死。冲谓曰：“待三日。”冲乃以刀穿其单衣，若鼠啮者，入见，谬为愁状。公问之，对曰：“俗言鼠啮衣不吉，今儿衣见啮，是以忧。”公曰：“妄言耳，无苦。”俄而库吏以啮鞍白，公笑曰：“儿衣在侧且啮，况鞍悬柱乎。”竟不问。"]},{"title":"术智部·司马相如","content":["【原文】","卓文君既奔相如，相如与驰归成都，家居徒四壁立。卓王孙大怒，不分一钱。相如与文君谋，乃复如临邛，尽卖其车骑，置一酒舍酤酒，而令文君当缶卢，身自穿犊鼻褌，与庸保杂作，涤器市中。王孙闻而耻之，不得已，分予文君僮百人、钱百万，乃复还成都为富人。","〔评〕卓王孙始非能客相如也，但看临邛令面耳；终非能婿相如也，但恐辱富家门面耳。文君为之女，真可谓犁牛骍角矣!王吉始则重客相如，及其持节喻蜀，又为之负弩前驱，而当缶卢涤器时，不闻下车慰劳，如信陵之于毛公、薛公也，其眼珠亦在文君下哉。"]},{"title":"捷智部·总序","content":["【原文】","冯子曰：成大事者，争百年，不争一息。然而一息固百年之始也。夫事变之会，如火如风。愚者犯焉，稍觉，则去而违之，贺不害斯已也。今有道于此，能返风而灭火，则虽拔木燎原，适足以试其伎而不惊。尝试譬之足力，一里之程，必有先至，所争逾刻耳。累之而十里百里，则其为刻弥多矣；又况乎智之迟疾，相去不啻千万里者乎!军志有之：“兵闻拙速，未闻巧之久。”夫速而无巧者，必久而愈拙者也。今有径尺之樽，置诸通衢，先至者得醉，继至者得尝，最后至则干唇而返矣。叶叶而摘之，穷日不能髡一树；秋风下霜，一夕零落：此言造化之捷也。人若是其捷也，其灵万变，而不穷于应卒，此唯敏悟者庶几焉。呜呼!事变之不能停而俟我也审矣，天下亦乌有智而不捷，不捷而智者哉!"]},{"title":"捷智部·汉高祖","content":["【原文】","楚、汉久相持未决，项羽谓汉王曰：“天下汹汹，徒以我两人。愿与王挑战决雌雄，毋徒罢天下父子为也。”汉王笑谢曰：“吾宁斗智，不能斗力。”项王乃与汉王相与临广武间而语，汉王数羽罪十，项王大怒，伏弩射中汉王，汉王伤胸，乃扪足曰：“虏中吾指。”汉王病创卧，张良强起行劳军，以安士卒，毋令楚乘胜于汉。汉王出行军，病甚，因驰入成皋。","〔评〕小白不僵而僵，汉王伤而不伤。一时之计，俱造百世之业!"]},{"title":"捷智部·宗典 李穆 昙永","content":["【原文】","晋元帝叔父东安王繇，为成都王颖所害，惧祸及，潜出奔。至河阳，为津吏所止，从者宗典后至，以马鞭拂之，谓曰：“舍长，官禁贵人，而汝亦被拘耶？”因大笑，由是得释。","宇文泰与侯景战，泰马中流矢，惊逸，泰坠地。东魏兵及之，左右皆散。李穆下马，以策击泰背，骂之曰：“笼东军士，尔曹主何在？”追者不疑是贵人，因舍而过。穆以马授泰，与之俱逸。","王廒之败，沙门昙永匿其幼子华，使提衣幞自随。津逻疑之，昙永呵华曰：“奴子何不速行？”捶之数十，由是得免。"]},{"title":"捷智部·王羲之","content":["【原文】","王右军幼时，大将军甚爱之，恒置帐中眠。大将军尝先起，须臾，钱凤入，屏人论逆节事，都忘右军在帐中。右军觉，既闻所论，知无活理，乃剔吐污头面被褥，诈熟眠。敦论事半，方悟右军未起，相与大惊曰：“不得不除之。”王羲之及开帐，乃见吐唾纵横，信其实熟眠。由是得全。"]},{"title":"捷智部·刘备","content":["【原文】","曹公素忌先主。公尝从容谓先主曰：“今天下英雄，唯使君与操耳!本初之徒，不足数也!”先主方食，失匕箸。适雷震，因谓公曰：“圣人云，迅雷风烈必变。良有以也。一震之威，乃至于此。”刘备","〔评〕相传曹公以酒后畏雷，闲时灌圃轻先主，卒免于难。然则先主好结牦，焉知非灌圃故智？"]},{"title":"捷智部·张咏 徐达","content":["【原文】","张乖崖守成都，兵火之余，人怀反侧。一日大阅，始出，众遂嵩呼者三。乖崖亦下马，东北望而三呼，复揽辔而行。众不敢讙。（边批：石敬瑭斩三十余人犹不止，泳乃不劳而定。）","上尝召徐中山王饮，迨夜，强之醉。醉甚，命内侍送旧内宿焉。旧内，上为吴王时所居也。中夜，王酒醒，问宿何地，内侍曰：“旧内也。”即起，趋丹陛下，北面再拜，三叩头乃出。上闻之，大说。","〔评〕乖崖三呼，而军哗顿息；中山三叩头，而主信益坚。仓卒间乃有许大主张，非特恪谨而已!"]},{"title":"捷智部·颜真卿 李揆","content":["【原文】","安禄山反，破东都，遣段子光传李憕、卢奕、蒋清首，以徇河北。真卿绐诸将曰：“吾素识憕等，其首皆非是。”乃斩光而藏三首。","李尚书揆素为卢杞所恶，用为入蕃会盟使。揆辞老，恐死道路，不能达命。帝恻然，杞曰：“和戎当择练朝事者，非揆不可，揆行，则年少于揆者，后无所避矣。”（边批：佞口似是。）揆不敢辞。揆至蕃，酋长曰：“闻唐有第一人李揆，公是否？”揆畏留，因绐之曰：“彼李揆安肯来耶？”"]},{"title":"捷智部·李迪","content":["【原文】","真宗不豫，李迪与宰执以祈禳宿内殿。时仁宗幼冲，八大王元俨素有威名，以问疾留禁中，累日不出。执政患之，无以为计。偶翰林司以金盂贮熟水，曰：“王所需也。”迪取案上墨笔搅水中尽黑，令持去，王见之，大惊。意其毒也，即上马驰去。"]},{"title":"捷智部·太史慈","content":["【原文】","太史慈在郡。会郡与州有隙，曲直未分，以先闻者为善。时州章已去，郡守恐后之，求可使者。慈以选行，晨夜取道到洛阳，诣公车门，则州吏才至，方求通。慈问曰：“君欲通章耶？”吏曰：“然。”“章安在？题署得无误耶？”因假章看，便裂败之，吏大呼持慈，慈与语曰：“君不以相与，吾亦无因得败，祸福等耳，吾不独受罪，岂若默然俱去？”因与遁还，郡章竟得直。"]},{"title":"捷智部·张良","content":["【原文】","高帝已封大功臣二十余人，其余日夜争功不决。上在洛阳南宫，望见诸将往往相与坐沙中偶语。以问留侯，对曰：“陛下起布衣。以此属取天下，今为天子。而所封皆故人，所诛皆仇怨，故相聚谋反耳。”上忧之。曰：“奈何？”留侯曰：“上生平所憎，群臣所共知，谁最甚者？”上曰：“雍齿数窘我。”留侯曰：“今急。先封雍齿，则群臣人人自坚矣。”乃封齿为什邡侯，群臣喜曰：“雍齿且侯。吾属无患矣。”","〔评〕温公曰：“诸将所言，未必反也。果谋反，良亦何待问而后言邪？徒以帝初得天下，数用爱憎行诛赏。群臣往往有觖望自危之心。故良因事纳忠以变移帝意耳!”袁了凡曰：“子房为雍齿游说，使帝自是有疑功臣之心，致三大功臣相继屠戮，未必非一言之害也!”由前言，良为忠谋；由后言，良为罪案。要之布衣称帝，自汉创局，群臣皆比肩共事之人，若觖望自危，其势必反。帝所虑亦止此一著，良乘机道破，所以其言易入，而诸将之浮议顿息，不可谓非奇谋也!若韩、彭俎醢，良亦何能逆料之哉!"]},{"title":"捷智部·宋太宗","content":["【原文】","太宗以北兵渡淮，时无一苇之楫。有人于囊中取干猪脬十余，内气其中，环著腰间，泅水而南。径夺舟以济。"]},{"title":"捷智部·颜常道","content":["【原文】","颜常道曰：“某年河水围濮州，城窦失戒，夜发声如雷，须臾巷水没骭。士有献衣袽之法，其要，取绵絮胎，缚作团，大小不一，使善泅卒沿城扪漏便塞之，水势即弭，众工随兴，城堞无虞。”"]},{"title":"捷智部·侯叔献","content":["【原文】","熙宁中，睢阳界中发汴堤淤田。汴水暴至，堤防颇坏陷，人力不可制。时都水丞侯叔献莅役相视，其上数十里有一古城，急发汴堤注水入古城中，下流遂涸，使人亟治堤陷。次日，古城中水盈，汴流复行，而堤陷已完矣，徐塞古城所决，内外之水，平而不流，瞬息可塞。众皆伏其机敏。"]},{"title":"捷智部·孙权","content":["【原文】","孙权濡须之战，孙权与曹操相持月余。权尝乘大船来观公军，公军弓弩乱发，箭着船旁，船偏重，权乃令回船，更一面以受箭，箭均船平。"]},{"title":"捷智部·司马遹","content":["【原文】","司马遹晋惠帝太子遹。自幼聪慧，宫中尝夜失火，武帝登楼望之，太子乃牵帝衣入暗中。帝问其故，对曰：“暮夜仓卒，宜备非常，不可令照见人主。”时遹才五岁耳，帝大奇之。尝从帝观豕牢，言于帝曰：“豕甚肥，何不杀以养士，而令坐费五谷？”帝抚其背曰：“是儿当兴吾家。”后竟以贾后谗废死，谥愍怀。吁，真可愍可怀也!","〔评〕此智识人，何以不禄？噫!斯人而禄也，司马氏必昌，而天道僭矣。遹谥愍怀。而继惠世者，一怀一愍，马遂革而为牛，天之巧于示应乎？"]},{"title":"捷智部·文彦博 司马光","content":["【原文】","彦博幼时，与群儿戏，击球，球入柱穴中，不能取，公以水灌之，球浮出。司马光幼与群儿戏，一儿误堕大水瓮中，已没，群儿惊走，公取石破瓮，遂得出。","〔评〕二公应变之才，济人之术，已露一斑。孰谓“小时了了者，大定不佳”耶？"]},{"title":"捷智部·王戎","content":["【原文】","王戎年七岁时，尝与诸小儿游，瞩见道旁李树，有子扳折，诸小儿竞走之，唯戎不动。人问之，答曰：“树在道旁而多子，此必苦李。”试之果然。","〔评〕许衡少时，尝暑中过河阳，其道有梨，众争取啖之，衡独危坐树下自若。或问之，曰：“非其有而取之，不可。”曰：“人亡世乱，此无主矣。”衡曰：“梨无主，吾心独无主乎？”（边批：真道学。）合二事观，戎为智，衡为义，皆神童也。"]},{"title":"捷智部·曹冲","content":["【原文】","曹冲，自幼聪慧。孙权尝致巨象于曹公。公欲知其斤重，以访群下，莫能得策。冲曰：“置象大船之上，而刻其水痕所至，称物以载之，一较可知矣。”冲时仅五六岁，公大奇之。"]},{"title":"捷智部·怀丙","content":["【原文】","宋河中府浮梁，用铁牛八维之，一牛且数万斤。治平中，水暴涨绝梁，牵牛没于河。募能出之者。真定僧怀丙以二大舟实土，夹牛维之，用大木为权衡状钩牛，徐去其土，舟浮牛出。转运使张焘以闻，赐之紫衣。"]},{"title":"捷智部·梁武帝","content":["【原文】","台城陷，武帝语人曰：“侯景必为帝，但不久耳。破‘侯景’字乃成‘小人百日天子’。”景篡位，果百日而亡。"]},{"title":"捷智部·杨修","content":["【原文】","杨修为魏武主簿。时作相国门，始构榱桷。魏武自出看，题门作“活”字，便去。杨见，便令坏之，曰：“门中活，‘阔’字，王正嫌门大也。”","人饷魏武一杯酪，魏武啖少许，盖头上题“合”字以示众。众莫能解，次至杨修。修便啖之，曰：“公教人啖一口也，复何疑？”","魏武尝过“曹娥碑”下，杨修从。碑背上见题作“黄绢幼妇外孙薹臼”八字。魏武谓修曰：“解否？”答曰：“解。”魏武曰：“卿未可言，俟我思之。”行三十里，魏武乃曰：“吾已得。”令修别记所知。修曰：“黄绢，色丝，于字为‘绝’；幼妇，少女，于字为‘妙’；外孙，女子，于字为‘好’；薹臼，受五辛之器，于字为‘辞’。所谓‘绝妙好辞’也!”魏武亦记之，与修同，叹曰：“吾才去卿乃三十里。”","操既平汉中，欲讨刘备而不得进，欲守又难为功。护军不知进止，操出教，唯曰：“鸡肋。”外曹莫能晓，杨修曰：“夫鸡肋，食之则无所得，弃之则殊可惜，公归计决矣。”乃私语营中戒装，俄操果班师。","〔评〕德祖聪颖太露，为操所忌，其能免乎？晋、宋人主多与臣下争胜诗、字，故鲍照多累句，僧虔用拙笔，皆以避祸也。"]},{"title":"捷智部·丁谓","content":["【原文】","广州押衙崔庆成抵皇华驿，夜见美人，盖鬼也。掷书云：“川中狗，百姓眼，马扑儿，御厨饭。”庆成不解，述于丁晋公，丁解云：“川中狗，蜀犬也；百姓眼，民目也；马扑儿，瓜子也；御厨饭，官食也。乃‘独眠孤馆’四字。”"]},{"title":"捷智部·刘伯温","content":["【原文】","高祖方欲刑人，刘伯温适入，亟语之梦：“以头有血而土傅之，不祥，欲以应之。”公曰：“头上血，‘眾’字也，傅以土，得众且得土也，应在三日。”上为停三日待之，而海宁降。"]},{"title":"捷智部·占状元","content":["【原文】","孙龙光状元及第，前一年，尝梦积木数百，龙光践履往复。既而请一李处士圆之，处士曰：“贺郎君喜，来年必是状元。何者？已居众材之上。”","郭俊应举时，梦见一老僧着屐。于卧榻上蹒跚而行。既寤，甚恶之。占者曰：“老僧，上座也；着屐于卧榻上，行屐高也；君其巍峨矣。”及见榜，乃状元也。"]},{"title":"捷智部·剃髭 剃发","content":["【原文】","宋李迪美须髯，御试日，梦剃削俱尽。占者曰：“剃者，替也，解元是刘滋，今替滋矣。”果状元及第。","曹确判度支，亦有台辅之望，或梦剃发为僧，心甚恶之，有一士善占梦，确召而诘之。此士曰：“前贺侍郎，旦夕必登庸；出家者，剃度也，度、杜同音，必代杜为相矣。”无何。杜相出镇江西，而确大拜。"]},{"title":"捷智部·季毅","content":["【原文】","王濬梦悬三刀于梁上，须臾又益一刀。季毅曰：“三刀为州，又益者，明府其临益州乎？”果迁益州刺史。"]},{"title":"捷智部·筮疾","content":["【原文】","有人父官刺史，得书云：“有疾。”是人诣赵辅和馆，别托相知者筮，遇“泰”。筮者云：“甚吉。”是人出后，辅和语筮者云：“‘泰’，乾下坤上，则父已入土矣，岂得言吉？”果凶问至。","顾士群母病，筮得“归妹”之“随”，或以为“男女有家”之卦，必无患。郭璞曰：“‘归妹’，女之终也，兑主秋，至立秋日终矣。”果然。"]},{"title":"语智部·总序","content":["【原文】","冯子曰：智非语也，语智非智也，喋喋者必穷，期期者有庸，丈夫者何必有口哉!固也，抑有异焉。两舌相战，理者必伸；两理相质，辩者先售。子房以之师，仲连以之高，庄生以之旷达，仪、衍以之富贵，端木子以之列于四科，孟氏以之承三圣。故一言而或重于九鼎，单说而或强于十万师，片纸书而或贤于十部从事，口舌之权顾不重与？“谈言微中，足以解纷”；“言之无文，行之不远”。君子一言以为智，一言以为不智。智泽于内，言溢于外。《诗》曰：“唯其有之，是以似之。”此之谓也。"]},{"title":"语智部·鲁仲连","content":["【原文】","秦围赵邯郸，诸侯莫敢先救。魏王使客将军辛垣衍间入邯郸，欲与赵尊秦为帝。鲁仲连适在赵，闻之，见平原君胜。胜为介绍，而见之于辛垣衍。鲁连见辛垣衍而无言。辛垣衍曰：“吾视居此围城之中者，皆有求于平原君者也，今观先生之玉貌，非有求于平原君者，曷为久居此围城之中而不去也？”鲁连曰：“秦弃礼义、上首功之国也，权使其士，虏使其民，彼肆然而为帝，则连有赴东海而死耳，不忍为之民也。所为见将军者，欲以助赵也。”辛垣衍曰：“助之奈何？”鲁连曰：“吾将使梁及燕助之，齐、楚固助之矣。”辛垣衍曰：“燕吾不知；若梁，则吾乃梁人也。先生恶能使梁助之耶？”鲁连曰：“梁未睹秦称帝之害故也，使睹秦称帝之害，则必助赵矣。”辛垣衍曰：“秦称帝之害奈何？”鲁连曰：“昔齐威王尝为仁义矣，率天下诸侯而朝周。周贫且微，诸侯莫朝，而齐独朝之。居岁余，周烈王崩，诸侯皆到，齐后往，周怒，赴于齐曰：‘天崩地坼，天子下席，东藩之臣田婴齐后至，则斩之!’威王勃然怒曰：‘叱嗟，鲁仲连而母婢也!’卒为天下笑。故生则朝周，死则叱之，诚不忍其求也。彼天子固然，其无足怪。”辛垣衍曰：“先生独未见夫仆乎？十人而从一人者，宁力不胜，智不若耶？畏之也!”鲁连曰：“梁之比于秦若仆耶？”（边批：激之。）辛垣衍曰：“然。”鲁连曰：“然则吾将使秦王烹醢梁王。”（边批：重激之。）辛垣衍怏然不悦，曰：“嘻，亦太甚矣，先生又恶能使秦王烹醢梁王？”鲁连曰：“固也，待吾言之。昔者鬼侯、鄂侯、文王，纣之三公也。鬼侯有子而好，故入之于纣，纣以为恶，醢鬼侯；鄂侯争之急，辩之疾，并脯鄂侯；文王闻而叹息，拘于羑里之库百日，而欲令之死。曷为与人俱称帝王，卒就脯醢之地也？齐湣王将之鲁，夷维子执策而从，谓鲁人曰：‘子将何以待吾君？’鲁人曰：‘吾将以十太牢待子之君。’夷维子曰：‘吾君，天子也。天子巡狩，诸侯避舍，纳管键，摄衽抱几，视膳于堂下，天子已食，退而听朝也。’鲁人投其钥，不果纳。将之薛，假途于邹。当是时，邹君死，湣王欲入吊，夷维子谓邹之孤曰：‘天子吊，主人必将倍殡柩，设北面于南方，然后天子南面吊也。’邹之群臣曰：‘必若此，吾将伏剑而死。’故不敢入于邹。邹、鲁之臣。生则不能事养，死则不得饭含，（边批：为齐强横故。）然且欲行天子之礼于邹、鲁之臣，不果纳。今秦万乘之国，梁亦万乘之国，交有称王之名，睹其一战而胜，欲从而帝之，是使三晋之大臣，未如邹、鲁之仆妾也。且秦无已而帝，则且变易诸侯之大臣，彼将夺其所谓不肖，而予其所谓贤，夺其所憎，而予其所爱，彼又将使其子女谗妾为诸侯妃姬，处梁之宫，梁王安得晏然而已乎？而将军又何以得故宠乎？”于是辛垣衍起，再拜谢曰：“吾乃今知先生为天下之士也，吾请去，不敢复言帝秦矣。”秦将闻之，为却军五十里。","〔评〕苏轼曰：“仲连辩过仪、秦，气凌髡、衍，排难解纷，功成而逃，实战国一人而已。”穆文熙曰：“仲连挫帝秦之说，而秦将为之却军，此《淮南》之所谓‘庙战’也。”"]},{"title":"语智部·狄仁杰","content":["【原文】","武承嗣、三思营求为太子，狄仁杰从容言于太后曰：“姑侄与子母孰亲？陛下立子，则千秋万岁后配食太庙；若立侄，则未闻侄为天子，而祔姑于庙者也。”太后乃寤。","〔评〕议论到十分醒快处，虽欲不从而不可得。庐陵反正，虽因鹦鹉折翼及双陆不胜之梦，实姑侄子母之说有以动之。凡恋生前，未有不计死后者。时王方庆居相位，以其子为眉州司士参军，天后问曰：“君在相位，子何远乎？”对曰：“庐陵是陛下爱子，今犹在远；臣之子，安敢相近？”此亦可谓善讽矣。然慈主可以情动，明主当以理格，则天明而不慈，故梁公辱昌宗而不怒，进张柬之而不疑，皆因其明而用之。"]},{"title":"语智部·富弼","content":["【原文】","契丹乘朝廷有西夏之忧，遣使来言关南之地。地是石晋所割，后为周世宗所取。富弼奉使，往见契丹主曰：“两朝继好，垂四十年，一旦求割地，何也？”契丹主曰：“南朝违约，塞雁门，增塘水，治城隍，籍民兵，将以何为？群臣请举兵而南，吾谓不若遣使求地，求而不获，举兵未晚。”弼曰：“北朝忘章圣皇帝之大德乎？澶渊之役，苟从诸将言，北兵无得脱者。且北朝与富弼中国通好，则人主专其利，而臣下无所获；若用兵，则利归臣下，而人主任其祸。故劝用兵者，皆为身谋耳。今中国提封万里，精兵百万，北朝欲用兵，能保必胜乎？就使其胜，所亡士马，群臣当之与，抑人主当之与？若通好不绝，岁币尽归人主，群臣何利焉？”契丹主大悟，首肯者久之。弼又曰：“雁门者，备元昊也。塘水始于何承矩，事在通好前。城隍修旧，民兵亦补阙，非违约也。”契丹主曰：“虽然，吾祖宗故地，当见还耳。”弼曰：“晋以卢龙赂契丹，周世宗复取关南地，皆异代事，若各求地，岂北朝之利哉。”（边批：占上风。）既退，刘六符曰：“吾主耻受金币，坚欲十县，何如？”弼曰：“本朝皇帝言：‘为祖宗守国，岂敢望以土地与人？北朝所欲，不过租赋耳，朕不忍多杀两朝赤子，故屈地增币以代之。’（边批：占上风。）若必欲得地，是志在败盟，假此为辞耳。”明日契丹主召弼同猎，引弼马自近，谓曰：“得地则欢好可久。”弼曰：“北朝既以得地为荣，南朝必以失地为辱，兄弟之国，岂可一荣一辱哉？”猎罢，六符曰：“吾主闻公荣辱之言，意甚感悟，今唯结姻可议耳。”弼曰：“婚姻易生嫌隙，本朝长公主出嫁，赍送不过十万缗，岂若岁币无穷之利哉。”弼还报，帝许增币。契丹主曰：“南朝既增我币，辞当曰‘献’。”弼曰：“南朝为兄，岂有兄献于弟乎？”（边批：占上风。）契丹主曰：“然则为‘纳’。”，弼亦不可，契丹主曰：“南朝既以厚币遗我，是惧我矣，于二字何有？若我拥兵而南，得无悔乎？”弼曰：“本朝兼爱南北，（边批：占上风。）故不惮更成，何名为惧？或不得已而至于用兵，则当以曲直为胜负，非使臣之所知也。”契丹主曰：“卿勿固执，古有之矣。”弼曰：“自古唯唐高祖借兵突厥。当时赠遗，或称献纳，其后颉利为太宗所擒。（边批：占上风。）岂复有此哉？”契丹主知不可夺，自遣人来议。帝用晏殊议，竟以“纳”字与之。（边批：可恨。）","〔评〕富郑公与契丹主往复再四，句句占上风，而语气又和婉，使人可听。此可与李邺侯参看，说辞之最善也。弼始受命往，闻一女卒，再往，闻一男生，皆不顾。得家书，未尝发，辄焚之，曰：“徒乱人意。”有此一片精诚，自然不辱君命。"]},{"title":"语智部·马圉 中牟令","content":["【原文】","景公有马，其圉人杀之。公怒，援戈将自击之。晏子曰：“此不知其罪而死，臣请为君数之。”公曰：“诺。”晏子举戈临之曰：“汝为我君养马而杀之，而罪当死；汝使吾君以马之故杀圉人，而罪又当死；汝使吾君以马故杀圉人，闻于四邻诸侯，而罪又当死。”公曰：“夫子释之，勿伤吾仁也。”","后唐庄宗猎于中牟，践蹂民田，中牟令当马而谏。庄宗大怒，命叱去斩之。伶人敬新磨率诸伶走追其令，擒至马前。数之曰：“汝为县令，独不闻天子好田猎乎？奈何纵民稼穑，以供岁赋，何不饥饿汝民，空此田地，以待天子驰逐？汝罪当死，亟请行刑!”诸伶复唱和，于是庄宗大笑，赦之。"]},{"title":"语智部·东方朔","content":["【原文】","武帝乳母尝于外犯事，帝欲申宪，乳母求东方朔。朔曰：“此非唇舌所争，尔必望济者，将去时，但当屡顾帝，慎勿言。此或可万一冀耳。”乳母既至，朔亦侍侧，因谓之曰：“汝痴耳。帝今已长，岂复赖汝乳哺活耶？”帝凄然，即敕免罪。"]},{"title":"语智部·魏征","content":["【原文】","魏征文德皇后既葬。太宗即苑中作层观，以望昭陵，引魏征同升。征熟视曰：“臣昏眊，不能见。”帝指示之。征曰：“此昭陵耶？”帝曰：“然。”征曰：“臣以为陛下望献陵。若昭陵，则臣固见之矣。”帝泣，为之毁观。"]},{"title":"语智部·简雍","content":["【原文】","先主时天旱，禁私酿，吏于人家索得酿具，欲论罚。简雍与先主游，见男女行道，谓先主曰：“彼欲行淫，何以不缚？”先主曰：“何以知之？”对曰：“彼有其具。”先主大笑而止。"]},{"title":"语智部·贾诩","content":["【原文】","贾诩事操。时临淄侯植才名方盛，操尝欲废丕立植。一日屏左右问诩，诩默不对。操曰：“与卿言，不答，何也？”对曰：“属有所思。”操曰：“何思？”诩曰：“思袁本初、刘景升父子。”操大笑，丕位遂定。","〔评〕卫瓘“此座可惜”一语，不下于诩，晋武悟而不从，以致于败。"]},{"title":"语智部·解缙","content":["【原文】","解缙应制题“虎顾众彪图”，曰：“虎为百兽尊，谁敢触其怒。唯有父子情，一步一回顾。”文皇见诗有感，即命夏原吉迎太子于南京。文皇与解缙同游。文皇登桥，问缙：“当做何语？”缙曰：“此谓‘一步高一步’。”及下桥，又问之，缙曰：“此谓‘后面更高似前面’。”"]},{"title":"语智部·李纲","content":["【原文】","李纲欲用张所，然所尝论宰相黄潜善，纲颇难之。一日遇潜善，款语曰：“今当艰难之秋，负天下重责，而四方士大夫，号召未有来者。前议置河北宣抚司，独一张所可用。又以狂妄有言得罪，如所之罪，孰谓不宜？第今日势迫，不得不试用之，如用以为台谏，处要地，则不可；使之借官为招抚，冒死立功以赎过，似无嫌。”潜善欣然许之。"]},{"title":"语智部·苏辙","content":["【原文】","《元城先生语录》云：东坡御史狱，张安道致仕在南京，上书救之，欲附南京递进，府官不敢受，乃令其子恕至登闻鼓院投进。恕徘徊不敢投。久之，东坡出狱。其后东坡见其副本，因吐舌色动。人问其故，东坡不答。后子由见之，曰：“宜召兄之吐舌也，此事正得张恕力!”仆曰：“何谓也？”子由曰：“独不见郑昌之救盖宽饶乎？疏云：‘上无许、史之属，下无金、张之托’，此语正是激宣帝之怒耳!且宽饶何罪？正以犯许、史辈得祸，今再讦之，是益其怒也。今东坡亦无罪，独以名太高，与朝廷争胜耳。安道之疏乃云‘实天下之奇才’，独不激人主之怒乎？”仆曰：“然则尔时救东坡者，宜为何说？”子由曰：“但言本朝未尝杀士大夫，今乃是陛下开端，后世子孙必援陛下以为例，神宗好名而畏义，疑可以止之。”苏辙","〔评〕此条正堪为李纲荐张所于黄潜善语参看。"]},{"title":"兵智部·总序","content":["【原文】","冯子曰：岳忠武论兵曰：“仁、智、信、勇、严，缺一不可。”愚以为“智”尤甚焉。智者，知也。知者，知仁、知信、知勇、知严也。为将者，患不知耳。诚知，差之暴骨，不如践之问孤；楚之坑降，不如晋之释原；偃之迁延，不如罂之斩嬖；季之负载，不如孟之焚舟。虽欲不仁、不信、不严、不勇，而不可得也。又况夫泓水之襄败于仁，鄢陵之共败于信，阆中之飞败于严，邲河之縠败于勇。越公委千人以尝敌，马服须后令以济功，李广罢刁斗之警，淮阴忍胯下之羞。以仁、信、勇、严而若彼，以不仁、不信、不严、不勇而若此。其故何哉？智与不智之异耳!愚遇智，智胜；智遇尤智，尤智胜。故或不战而胜，或百战百胜，或正胜，或谲胜，或出新意而胜，或仿古兵法而胜。天异时，地异利，敌异情，我亦异势。用势者，因之以取胜焉。往志之论兵者备矣，其成败列在简编，的的可据。吾于其成而无败者，择著于篇，首“不战”，次“制胜”，次“诡道”，次“武案”。岳忠武曰：“运用之妙，在乎一心”。武案则运用之迹也。儒者不言兵，然儒者政不可与言兵。儒者之言兵恶诈；智者之言兵政恐不能诈。夫唯能诈者能战；能战者，斯能为不诈者乎!"]},{"title":"兵智部·荀罂 伍员","content":["【原文】","鲁襄时，晋、楚争郑。襄公九年，晋悼公帅诸侯之师围郑，郑人恐，乃行成。荀偃曰：“遂围之，以待楚人之救也，而与之战。不然，无成。”（边批：亦是。）荀罂曰：“许之盟而还师以敝楚：吾三分四军，与诸侯之锐，以逆来者，于我未病，楚不能矣。犹愈于战，暴骨以逞，不可以争。大劳未艾。君子劳心，伍员小人劳力，先王之制也。”乃许郑成，后三驾郑，而楚卒道敝，不能争，晋终得郑。","吴阖闾既立，问于伍员曰：“初而言伐楚，余知其可也。而恐其使余往也，又恶人之有余之功也。今余将自有之矣，伐楚何如？”对曰：“楚执政众而乖，莫适任患。若为三师以肄焉，一师至，彼必皆出；彼出则归，彼归则出，楚必道敝。亟肄以罢之，多方以误之。既罢，而后以三军继之，必大克之。”阖闾从之，楚于是乎始病。","〔评〕晋、吴敝楚，若出一辙。然吴能破楚，而晋不能者，终少柏举之一战也。宋儒乃以城濮之战咎晋文非王者之师。噫!有此议论，所以养成南宋为不战之天下，而竟奄奄以亡。悲夫!","按：吴璘制金，亦用此术。虏性忍耐坚久，令酷而下必死，每战非累日不决。于是选据形便，出锐卒，更迭挠之，与之为无穷，使不得休暇，以沮其坚忍之气，俟其少怠，出奇胜之。"]},{"title":"兵智部·周德威","content":["【原文】","晋王存勖大败梁兵，梁兵亦退。周德威言于晋王曰：“贼势甚盛，宜按兵以待其衰。”王曰：“吾孤军远来，救人之急，三镇乌合，利于速战。公乃欲按兵持重，何也？”德威曰：“镇、定之兵，长于守城，短于野战；吾所恃者骑兵，利于平原旷野，可以驰突。今压城垒门，骑无所展其足；且众寡不敌，使彼知己虚实，则事危矣。”王不悦，退卧帐中，诸将莫敢言。德威往见张承业，曰：“大王骤胜而轻敌，不量力而务速战，今去贼咫尺，所限者一水耳，彼若造桥以薄我，我众立尽矣，不若退军高邑，诱贼离营，彼出则归，彼归则出，别以轻骑，掠其馈饷，不过逾月，破之必矣!”承业入，褰帐抚王曰：“此岂王安寝时邪？周德威老将知兵，言不可忽也。”王蹶然而兴，曰：“予方思之。”时梁王闭垒不出，有降者，诘之，曰：“景仁方多造浮桥。”王谓德威曰：“果如公言。”"]},{"title":"兵智部·岳飞","content":["【原文】","杨幺为寇。岳飞所部皆西北人，不习水战。飞曰：“兵何常，顾用之何如耳!”先遣使招谕之，贼党黄佐曰：“岳节使号令如山，若与之敌，万无生理，不如往降，必善遇我。”遂降。飞单骑按其部，拊佐背曰：“子知逆顺者，果能立功，封侯岂足道，欲复遣子至湖中，视其可乘者擒之，可劝者招之，如何？”佐感泣，誓以死报。时张浚以都督军事至潭，参政席益与浚语，疑飞玩寇。（边批：庸才何知大计？）欲以闻。浚曰：“岳侯忠孝人也。兵有深机，何可易言？”益惭而止。黄佐袭周伦砦，杀伦，擒其统制陈贵等。会召浚还防秋。飞袖小图示浚，浚欲待来年议之。飞曰：“王四厢以王师攻水寇，则难；飞以水寇攻水寇，则易。水战，我短彼长，以所短攻所长，所以难；若因敌将用敌兵，夺其手足之助，离其腹心之托，使孤立，而后以王师乘之，八日之内，当俘诸酋。”浚许之。飞遂如鼎州。黄佐招杨钦来降，飞喜曰：“杨钦骁悍，既降。贼腹心溃矣!”","表授钦武义大夫，礼遇甚厚，乃复遣归湖中。两日，钦说全琮、刘锐等降。飞诡骂曰：“贼不尽降，何来也？”杖之，复令入湖。是夜掩敌营，降其众数万。幺负固不服，方浮舟湖中，以轮激水，其行如飞；旁置撞竿，官舟迎之，辄碎。飞伐君山木为巨筏，塞诸港汊，又以腐木乱草，浮上流而下。择水浅处，遣善骂者挑之，且行且骂。贼怒来追，则草壅积，舟轮碍不行，飞亟遣兵击之，贼奔港中，为筏所拒，官军乘筏，张牛革以蔽矢石，举巨木撞其舟，尽坏。幺投水中，牛皋擒斩。飞入贼垒，余酋惊曰：“何神也？”俱降，飞亲行诸砦慰抚之。纵老弱归籍，少壮为军，果八日而贼平。浚叹曰：“岳侯神算也!”","〔评〕杨幺据洞庭，陆耕水战，楼船十余丈，官军徒仰视，不得近。岳飞谋亦欲造大舟，湖南运判薛弼谓岳曰：“若是，非岁月不胜。且彼之所长，（边批：名言可以触类。）可避而不可斗也。今大旱，河水落洪，若重购舟首，勿与战，遂筏断江路。藁其上流，使彼之长坐废。而精骑直捣其垒，则彼坏在目前矣。”岳从之，遂平幺。人知岳侯神算，平幺于八日之间，而不知计出薛弼。从来名将名相，未有不资人以成功者。","岳忠武善以少击众，尝以八百人破群盗王善等五十万众于南薰门；以八千人破曹成十万众于桂岭；其战兀术于颍昌，则以背嵬八百，于朱仙镇则以五百，皆破其众十余万。凡有所举，尽召诸统制与谋，谋定而后战。故有战无败，猝遇敌，不动，敌人为之语曰：“撼山易，撼岳家军难!”其御军严而有恩，卒有取民麻一缕以束刍⑧者，立斩以徇。卒夜宿，民开门愿纳，无敢入者。军虽冻死不拆屋，饿死不卤掠。卒有疾，则亲为调药；诸将远戍，则遣妻问劳其家；死事者，哭之而育其孤，或以子婚其女；凡有颁赏，分给军吏，秋毫不私；每有功，必归之将士。吁!此则其制胜之本也。近日将官事事与忠武反，欲功成，得乎？"]},{"title":"兵智部·李愬","content":["【原文】","宪宗讨吴元济。唐邓节度使高霞寓既败，袁滋代将，复无功。李愬求自试，遂为随唐邓节度使。愬以军初伤夷，士气未完，乃不为斥候部伍。或有言者，愬曰：“贼方安袁公之宽，我不欲使震而备我。”乃令于军中曰：“天子知愬能忍耻，故委以抚养，战非我事也。（边批：能而示之不能。）齐人以想名轻，果易之。","愬沉鸷，能推诚待士，贼来降，辄听其便，或父母与孤未葬者，给粟帛遣还，劳之曰：“而亦王人也，无弃亲戚。”众愿为愬死，故山川险易，与贼情伪，皆能晓之。（边批：虏在目中，不然不轻战。）居半岁，知士可用，乃请济师。于是缮铠厉兵，攻马鞍山，下之。拔道口栅，战楂枒山，以取炉冶城，平青陵城。擒骠将丁士良，异其才，不杀。署捉生将，士良策曰：“吴秀琳以数千兵不可破者，陈光洽为之谋也，我能为公取之。”乃擒以献，于是秀琳举文城栅降。遂以其众攻吴房，残外垣，始出攻。吏曰：“往亡日，法当避。”愬曰：“彼谓我不来，此可击也。”众决死战，贼乃走。或劝遂取吴房，愬曰：“不可。吴房拔，则贼力专，不若留之，以分其力。”","初，秀琳降，愬单骑抵栅下与语，亲释缚，署以为将。秀琳为愬策曰：“必破贼，非李祐无以成功者。”祐，贼健将也，守兴桥栅，其战常易官军。愬候祐护获于野，遣史用诚以壮士三百伏其旁，见羸卒若将燔聚者，祐果轻出，用诚擒而还。诸将素苦祐，请杀之，（边批：能苦诸将，定是有用之人。）愬不听，以为客将，间召祐及李忠义，屏人语至夜艾。忠义亦贼将，军中多谏此二人不可近。愬待益厚。乃募死士三千为突将，自教之。","会雨，自五月至七月不止，军中以为不杀祐之罚，（边批：不通。）将吏杂然不解。想力不能独完祐，乃持以泣，曰：“天不欲平贼乎？何见夺者众耶？”则械而送之朝，表言：“必杀祐，无与共谋蔡者。”","诏释以还愬，愬乃令佩剑出入帐下，署六院兵马使，祐奉檄呜咽。诸将乃不敢言，由是始定袭蔡之谋矣。","李愬之将袭蔡也，旧令敢舍谍者族。愬刊其令，一切抚之，故谍者反效以情，愬益悉贼虚实。","时李光颜战数胜，元济率锐师屯洄曲以抗光颜。愬知其隙可乘，乃夜起师，祐以突将三千为前锋，李忠义副之，愬率中军三千，田进诚以下军殿，出文城栅，令曰：“引而东。”六十里止，袭张柴，歼其戍，敕士少休，益治鞍铠，发刃彀矢。会大雨雪，天晦，凛风偃旗裂肤，马皆缩栗，士抱戈冻死于道十一二。张柴之东，陂泽阻奥，众未尝蹈也，皆谓投不测，始发。吏请所向，愬曰：“入蔡州取吴元济。”（边批：抖然。）士失色，监军使者泣曰：“果落祐计。”然业从愬，人人不敢自为计。（边批：士有必死之心矣。）愬分轻兵断桥道，以绝洄曲道；又以兵朗山道。行七十里，夜半，至悬瓠城，雪甚。城旁皆鹅鹜池，愬令击之，以乱军声。贼吴房、朗山戍晏然无知者，祐等坎墉先登，众从之，杀门者开关，留持柝，传夜自如。黎明雪止，愬入驻元济外宅，蔡吏惊曰：“城陷矣!”元济尚不信，曰：“是洄曲子弟来索褚衣耳。”及闻号令，曰：“常侍传语。”始惊，曰：“何常侍得至此。”率左右登牙城。田进诚进兵薄之，愬计元济且望救于董重质，乃访其家慰安之，使无怖，以书召重质，重质以单骑白衣降。进诚火南门，元济请罪，梯而下，槛送京师。","〔评〕不械送祐，则谤者不息。此与司马懿祁山请战奉诏而止同一机轴，皆成言先入，度其必不忤而后行之者也。辛毗持节而蜀师老，李祐还幕而吴寇平，虽将之善，君亦与焉。","岳侯平杨幺，李愬克元济，无一不资才于敌，亦由威信素孚，操纵在手故也。后人漫然学之，鲜不堕敌之间矣!岑彭、费祎，亡其身，俱为降人刺杀，曹瞒、苻坚亡其师，赤壁之役，操信黄盖之降以取败；淝水之战，降将朱序谋归晋，阴导晋败秦，彼皆老于兵事者，而犹如此。可不慎与？","能用谍，不妨舍谍。然必先知谍，方能用谍；必能使民不隐谍，方能知谍；必恩威有以服民，方能使民不隐谍。呜呼，难言矣。","近有邑宰，急欲弭盗，谓诸盗往往获自妓家，必驱妓出境，乃清盗薮。夫妓家果薮盗，正宜留之，以为捕役耳目之径。若薮之境外，与薮之境内庸愈？假令盗薮民家，亦将尽民而驱之乎？不深严捕役之督，而求盗无薮，斯无策之甚者也。"]},{"title":"兵智部·赵充国","content":["【原文】","先零、罕、开皆西羌种，各有豪，数相攻击，成仇。匈奴连合诸羌，使解仇作约。充国料其到秋变必起，宜遣使行边预为备。于是两府白遣义渠安国行视诸边，分别善恶。安国至，召先零诸豪三十余人，以尤桀黠，皆斩之，纵兵击斩千余级，诸降羌悉叛，攻城邑，杀长吏。上问：“谁可将者。”充国对曰：“无逾于老臣者矣。”充国时年七十余。上问：“将军度羌虏何如?当用几人?”充国曰：“百闻不如一见，兵难隃度。臣愿驰至金城，图上方略。”充国至金城，须兵满万骑，方渡河，恐为虏所遮，即夜遣三校衔枚先渡，渡辄营阵。及明，以次尽渡。虏数十百骑来，出入军旁。充国意此骁骑难制，且恐为诱，戒军勿击，曰：“吾士马新倦，不可驰逐，击虏以殄灭为期，小利不足贪也。”","遣骑候四望峡中，亡虏。夜引兵至落都，谓诸校司马曰：“吾知羌无能为矣。使发数千人守杜四望、峡中，兵岂得人哉!”遂西至西部都尉府，日飨军士，士皆欲为用。虏数挑战，充国坚守。（边批：节节持重。）初罕开豪靡当儿使弟雕库来告都尉曰：“先零将反。”后数日，果反。雕库种人颇在先零中，都尉赵充国即留雕库为质。充国以为亡罪，遣归告种豪：“大兵诛有罪，毋取并灭，能相捕斩者，除罪：斩大豪有罪者一人，赐钱四十万，中豪十五万，下豪二万，大男三千，女子及老小千钱。又以所捕妻子财物与之。”欲以威信招降罕开及劫略者，解散虏谋。酒泉太守辛武贤上言：“今虏朝夕为寇，土地寒苦，汉马不能冬，可益马食，以七月上旬赍三十日粮，分兵并出张掖、酒泉，合击罕开。”天子下其议，充国以为：“佗负三十日食，又有衣装兵器，难以追逐。据前险，守后阨，以绝粮道，必有伤危之患。且先零首为畔逆，宜捐罕开暗昧之过，先诛先零以震动之。”朝议谓：“先零兵盛而负罕开之助，不先破罕开，则先零未可图。”（边批：似是而非。）天子遂敕充国进兵。充国上书谢罪，因陈利害曰：“臣闻兵法：‘攻不足者守有余。’‘善战者致人，不致于人。’即罕羌欲为寇，宜简练以俟其至，以逸待劳，必胜之道也。今释致虏之术，而从为虏所致之道，愚以为不便。先零羌欲为背畔。故与罕开解仇结约。然其私心，亦恐汉兵至而罕开背之。其计常欲先赴罕开之急，以坚其约。先击罕羌，先零必助之。今虏马肥、食足，击之未见利，适使先零得施德于罕羌以坚其约。党坚势盛，附者浸多，臣恐国家之忧不二三岁而已。于臣之计，先诛先零，则罕开不烦兵而服；如其不服，须正月击之未晚。”上从充国议，充国引兵至先零，虏久屯聚，解弛，望见大军，弃车重，欲渡湟水，道阨狭，充国徐行驱之。（边批：又持重。）或曰：“逐利宜亟。”充国曰：“此穷寇，不可迫也，缓之则走不顾，急之则还致死。”诸校皆曰：“善。”虏赴水溺死数百，降及斩首五百余人。兵至罕地，令军毋燔聚落刍牧田中。罕羌闻之，喜曰：“汉果不击我矣。”豪靡忘来自归，充国赐饮食，遣还谕种人，时羌降者万余人。充国度羌必坏，请罢骑兵，留万人屯田，以待其敝。"]},{"title":"兵智部·李牧","content":["【原文】","李牧，赵北边良将也。尝居雁门备匈奴，以便宜置吏，市租皆输入幕府，为士卒费。日击牛飨士，习骑射、谨烽火、多间谍、厚遇战士，为约曰：“匈奴即入盗，急入收保，有敢捕虏者，斩。”如此数岁，匈奴以牧为怯，虽赵边兵亦以为吾将怯。赵王让李牧，牧如故；赵王怒，召之，使他人代将。岁余，匈奴每来，出战数不利，失亡多，边不得田畜。乃复请李牧。牧固称疾，赵王强起之，牧曰：“必用臣，臣如前，乃可奉令。”王许之，李牧如故约。匈奴终岁无所得，然终以为怯。边士日得赏赐而不用，皆愿一战。于是乃具选车，得千三百乘，选骑得万三千匹，百金之士五万人，彀者十万人，悉勒习战。大纵畜牧，人民满野。匈奴小入，佯北，以数千人委之，单于闻之，大率众来入。牧多为奇阵，张左右翼击之，大破，杀匈奴十余万骑。单于奔走，其后十余岁，不敢近边。","〔评〕厚其遇，故其报重；蓄其气，故气发猛。故名将用死士。兵之力，往往一试而不再，亦一试而不必再也!今之所谓兵者，除一二家丁外，率丐而甲，尪而立者耳。呜呼!尪也，丐也，又多乎哉!"]},{"title":"兵智部·周亚夫","content":["【原文】","吴、楚反，景帝拜周亚夫太尉击之。既发，至霸上，赵涉遮说之曰：“吴王怀辑死士久矣，此知将军且行，必置人于殽、渑阨陋之间。且兵事尚神密，将军何不从此右去，走蓝田，出武关，抵洛阳，间不过差一二日，直入武库，击鸣鼓，诸侯闻之，以为将军从天而下也。”太尉如其计，至洛阳，使殽、渑间，果得伏兵。","太尉会兵荥阳，坚壁不出。吴方攻梁急，梁请救，太尉守便宜，欲以梁委吴，不肯往。梁王上书自言，帝使使诏救梁，太尉亦不奉诏，而使轻骑兵绝吴、楚后，吴兵求战不得，饿而走。太尉出精兵击破之。","〔评〕吴王之初发也，其大将田禄伯曰：“兵屯聚而西，无他奇道，难以立功，臣愿得五万人，别循江、淮而上，收淮南、长沙，入武关，与大王会，此亦一奇也。”（边批：魏延子午谷之计相似。）吴太子谏曰：“王以反为名，若借人兵，亦且反王。”（边批：何不谏他勿反。）于是吴王不许。少将桓将军说王曰：“吴多步兵，利险；汉多车骑，利平地。愿大王所过城不下，直去疾西，据洛阳武库，食敖仓粟，阻山河之险，以令诸侯，虽无入关，天下固已定矣，大王徐行，留下城邑，汉军车骑至，驰入梁、楚之郊，事败矣。”吴老将皆言：“此少年摧锋可耳，安知大虑。”吴王于是亦不许。假令二计得行，亚夫未遽得志也。","亚夫之功，涉与吴王分半，而后世第功亚夫，竟无理田、桓二将军之言者，悲夫!","李牧、周亚夫，皆不万全不战者，故一战而功成；赵括以轻战而败，夫差以累战而败。君知不可战而不禁之，子玉之败是也；将知不可战而迫使之，杨无敌之败是也。"]},{"title":"兵智部·耿弇","content":["【原文】","张步弟蓝，将精兵二万守西安，而诸郡合万人守临淄。相距四十里。耿弇进军二城之间，视西安城小而坚，临淄虽大实易取，乃下令，后五日攻西安。蓝闻，日夜警备。至期，夜半，弇敕诸将皆蓐食，及旦，径趋临淄。半日拔其城，蓝惧，弃城走。诸将曰：“敕攻西安而乃先临淄，竟并下之，何也？”弇曰：“西安闻吾攻，必严守具；临淄出不意而至，必自警扰，攻之，必立拔；拔临淄则西安孤，此击一而得二也!若先攻西安，顿耿弇兵坚城，死伤必多，即拔之，吾深入其地，后乏转输，旬月间不自困乎？”诸将皆服。"]},{"title":"兵智部·韩世忠","content":["【原文】","世忠驻镇江，金人与刘豫合兵分道入侵。帝手札命世忠饬守备，图进取，辞旨恳切。世忠遂自镇江渡师，俾统制解元守高邮，候金步卒；亲提骑兵驻大仪，当敌骑。伐木为栅。自断归路，会遣魏良臣使金，世忠撤炊爨，绐良臣：“有诏移屯守江。”（边批：灵变。）良臣疾驰去，世忠度良臣已出境，而上马令军中曰：“视吾鞭所向。”于是引军至大仪，勒五阵，设伏二十余所，约闻鼓即起击。良臣至金军，金人问王师动息，具以所见对。聂儿孛堇闻世忠退，喜甚。引兵至江口，距大仪五里，别将挞孛也引千骑过五阵东，世忠传小麾，鸣鼓，伏兵四起。旗色与金人旗杂出。金军乱，我军迭进，背嵬军各持长斧，上揕人胸，下斫马足。敌披重甲，陷泥淖，世忠麾劲骑四面蹂躏，人马俱毙，遂擒挞孛也等。"]},{"title":"兵智部·狄青","content":["【原文】","狄青在泾原，常以寡当众。密令军中闻钲一声则止，再声则严阵而阳却，声止即大呼驰突。士卒皆如教。才遇敌，未接，遽声钲，士卒皆止，再声再却。虏大笑曰：“孰谓狄天使勇？”钲声止，忽前突之，虏兵大乱，相蹂多死。追奔数里，前临深涧，虏忽壅遏山隅，青遽鸣钲而止。虏得引去，时将佐悔不追击，青曰：“奔命之际，忽止而拒我，安知非谋，军已大胜，残寇不足贪也。”","侬智高反邕州，诏以青为宣抚使击之，或言：“贼标牌不可当。”青曰：“标牌，步兵也，遇骑兵必不能施，愿得西边蕃落民自从。”或又言：“南方非骑兵所宜。”青曰：“蕃部善射，耐艰苦，上下山如平地，当瘴未发时，疾驰破之，必胜之道也。”及行，日不过一驿，所至州，辄休士一日。（边批：未战养力。）至潭州，遂立行伍，明约束，军人有夺逆旅菜一把者，立斩以徇，于是一军肃然。时智高还守邕州，青惧昆仑关险厄为所据，乃按兵不动，下令宾州具五日粮，休士卒。值上元节，令大张灯烛，首夜宴将佐，次夜宴从军官，三夜飨军校。首夜乐饮彻晓，次夜大风雨，二鼓时，青忽称病，暂起如内。久之，使人谕孙沔，令暂主席行酒，少服药乃出。数使劝劳座客，至晓，客未敢退。忽有驰报者，云：“夜时三鼓，元帅已夺昆仑关矣。”（边批：自营中且不知，况敌人乎？）青既渡，喜曰：“贼不知守此，无能为也。”已近邕州，贼方觉，逆战于归仁铺，青登高望之，贼据坡上，我军薄之，青使步卒居前，匿骑兵于后。蛮使骁勇者当前，尽执长枪。前锋孙节战不利，死。将士畏青，莫敢退。（边批：畏主将，必不畏敌矣。）青登高山，执五色旗，麾骑兵为左右翼，出其后，断蛮军为三，旋而击之。左者右，右者左，已而右者复左，左者复右，贼不知所为。贼之标牌军，为马军所冲突，皆不能驻，枪立如束，我军又纵马上铁连枷击之，遂皆披靡。智高焚城遁去。","〔评〕按是役，谏官韩绛言：“青武人，不足专任，请以侍从文臣为之副。”（边批：顾其人何如，岂在文武!）时庞籍独为相，（边批：赖有此人。）对曰：“属者王师屡败，皆由大将轻，偏裨自用，不能制也。今青起于行伍，若以侍从之臣副之，号令复不得行。青昔在鄜延，居臣麾下，沉勇有智略，若专以智高事委之，必能办贼。”（边批：兵法，将能而君不御者胜。）于是诏岭南用兵，皆受节制。（边批：成功在此。）青临行，上言：“古之俘馘奏凯，割耳鼻则有之，不闻以获首者，秦、汉以来，获一首，赐爵一级，因谓之‘首级’。故军士争首级，以致相杀。又其间多以首级为货，售于无功不战之人，（边批：大弊。）愿一切皆罢之。”","又青行时，有因贵近求从行者。青谓之曰：“君欲从行甚善，然智高小寇，至遣青行，可以知事急矣。从青之士，击贼有功，当有厚赏；不然，军中法重，青不能私，君自思之，愿行则即奏取君矣。”于是无复敢言求从行者，即此一节，知青能持法，必能成功。","又青既入邕州，敛积尸内有衣金龙之衣者，又得金龙楯于其旁，或言：“智高已死，当亟奏!”青曰：“安知非诈，宁失智高，敢欺朝廷耶？”","合观二事，不唯不敢使人冒功，即己亦不敢冒不可知之功。"]},{"title":"兵智部·王阳明","content":["【原文】","王阳明以勘事过丰城，闻逆濠之变，兵力未具，亟欲溯流趋吉安。舟人闻濠发千余人来劫公，畏不敢发，公拔剑馘其耳，遂行。薄暮，度不可前，潜觅渔舟，以微服行，留麾下一人，服己冠服，居舟中。濠兵果犯舟，得伪者，知公去远，乃罢。公至中途，恐濠速出，乃为间谍，假奉朝廷密旨，行令两广、湖襄都御史及南京兵部，各命将出师，暗伏要害地方，以俟宁府兵至袭杀。复取优人数辈，各将公文置夹衣絮中。将发间，又捕捉伪太师家属至舟尾，令其觇知，公即佯怒，牵之上岸处斩，已而故纵之，令其奔报。濠获优，果于衣中搜得公文，遂迟疑不发。公至吉安，调度兵粮粗备，始传檄征兵，暴濠罪恶。濠知为公所卖，愤然欲出。公谓：“急犯其锋，非计也。宜示以自守不出之形，必俟其出，然后尾而图之。先复省城，以倾其巢。彼闻，必回兵来援，我则出兵邀而击之，此全胜之策。”濠果使人探公不出，乃留兵万余守省城，而自引兵东下，公闻濠已出，遂急促各府兵，刻期会于丰城，时濠兵已围安庆，众议宜急往救。公谓：“九江、南康皆已为贼所据，而南昌城中精悍万余，食货重积，我兵若抵安庆，贼必回军死斗，安庆之兵仅足自守，必不能出而夹攻。贼令南昌兵绝我粮道，九江、南康合势挠摄，而四方之援又不可望，事其危矣!今我师骤集，先声所加，城中必恐，并力急攻，其势必下，此孙子救韩趋魏之计也!”侦者言：“新、旧厂伏兵万余，以备犄角。”公遣兵从间道袭破之，溃卒入城，城中知王师雨集，皆大骇，遂一鼓下之。濠闻我兵至丰城，即欲回舟，李士实谏，以为，“必须径往南京，既登大宝，则江西自服。”濠不听，遂解安庆之围，移兵泊阮子江，为归援计。公闻濠兵且至，召众议之。众云：“宜敛兵入城，坚壁待援。”公曰：“不然，彼闻巢破，胆已丧矣，先出锐卒，要其惰归，一挫其锐，将不战而溃，所谓‘先声有夺人之气’也。”乃指授伍文定等方略，先以游兵诱之，复佯北以致之，俟其争前趋利，然后四面合击，伏兵并起，又虑城中宗室或内应为变，亲慰谕之，出给告示，凡胁从者不问，虽尝受贼官职，能逃归者，皆免死，能斩贼徒归降者，皆给赏，使内外居民及乡导人等四路传布。又分兵攻九江、南康，以绝其援。于是群力并举，逆首就擒。","〔评〕按陈眉公《见闻录》，谓宸濠之败，虽结于江西，而实溃于安庆。虽收功于王阳明，而实得力于李梧山。李讳充嗣，四川内江人，正德十四年巡抚南畿，闻宸濠请增护卫，叹曰：“虎而翼，祸将作矣。”遂力陈反状，廷议难之。公乃旦夕设方略，饬武备，以御贼为念。谓安庆畿辅，适当贼冲，非得人莫守。当诸将庭参，于众中独揖指挥使杨锐而进之曰：“皖城保障，委之于子，毋负我!”十五年，贼兵陷九江，公自将万人，屯采石，以塞上游之路。飞檄皖城，谕以忠义。锐感激思奋，相机应敌，发无不捷。","节发间谍火牌云：“为紧急军情事，该钦差太监总兵等官，统领边官军十万余，一半将到南京，一半径趋安庆，并调两广狼兵，湖广土兵，即日水陆并进，俱赴安庆会集，刻期进攻江西叛贼。今将火牌飞报前路官司，一体同心防守，预备粮草，听候应用等因。”","宸濠舟至李阳河，遇火牌，览之惊骇，由是散亡居半。继又发水卒千人，盛其标帜，乘飞舰百余艘，鼓噪而进，声为安庆应援，城中望见，士气百倍，锐即开门出敌，水陆夹攻，贼遂大溃。","时宸濠营于黄石矶，闻败将遁，公自将兵逐北，宸濠奔入鄱阳湖，适遇巡抚王公阳明引兵至湖，遂成擒焉。后论功竟不及公，胡御史洁目击其事，特为论列，不报。故今人盛称阳明，而不及梧山，亦有幸有不幸欤？","又按宸濠兵起，声言直取南京，道经安庆。太守张文锦与守备杨锐等合谋，令军士鼓噪登城大骂，激怒逆濠，使顿兵挫锐于坚城之下。而阳明得成其功，虽天夺其魄，而张、杨诸公之智，亦足述矣。"]},{"title":"兵智部·田单","content":["【原文】","燕昭王卒，惠王立，与乐毅有隙。（边批：肉先腐而虫生。）田单闻之，乃纵反间于燕，宣言曰：“齐王已死，城之不拔者二耳。乐毅畏诛不敢归，以伐齐为名，实欲连兵南面而王齐。齐人未附。故且缓攻即墨。以待其事。齐人所惧，唯恐他将来，即墨残矣。”燕王以为然，使骑劫代毅。毅归赵，燕军共忿。而田单乃令城中，食必祭其先祖于庭，飞鸟悉翔舞下食，燕人怪之，田单因宣言曰：“神来下教我。”乃令城中曰：“当有神人为我师。”有一卒曰：“臣可以为师乎？”因反走。田单乃起，引还，东向坐。师事之，卒曰：“臣欺君，实无能也。”单曰：“子勿言。”因师之，每出约束，必称神师。乃宣言曰：“君唯惧燕军之劓所得齐卒，置之前行与我战，即墨败矣。”燕人闻之，如其言。城中人见齐诸降者悉劓，皆坚守，唯恐见得。单又宣言：“君惧燕人掘君城外冢墓，戮先人，可为寒心。”燕军尽掘垄墓、烧死人。即墨人从城上望见，皆涕泣，俱欲出战，怒自十倍。田单知士卒之可用，乃身操版锸，与士卒分功，妻妾编于行伍之间。尽散饮食飨士，令甲卒皆伏。使老弱女子乘城，遣使约降于燕。燕皆呼“万岁”。田单乃收民金，得千镒，令即墨富豪遗燕将，曰：“即墨即降，愿无掳掠吾族家妻妾。”燕将大喜，许之，燕军由此益懈。单乃收城中，得千余牛，为绛缯衣，画以五采龙文，束兵刃于其角。而灌脂束苇于尾，烧其端，凿城数十穴，夜纵牛，壮士五千人随其后，牛尾热，怒而奔，燕军夜大惊，牛尾炬火光炫耀，燕军视之。皆龙文，所触尽死伤，五千人因衔枚击之，城中鼓噪从之，老弱皆击铜器为声，声动天地。燕军大骇，败走，遂杀骑劫。"]},{"title":"兵智部·孙膑 虞诩","content":["【原文】","魏庞涓攻韩。齐田忌救韩，直走大梁。涓闻之，去韩而归，齐军已过而西矣。孙子谓田忌曰：“彼三晋之兵，素悍勇而轻齐，齐号为怯。善战者，因其势而利导之。兵法：‘百里而趣利者，蹶上将；五十里而趣利者，军半至。’”使齐军入魏地，为十万灶，明日为五万灶，又明日为三万灶。涓行三日，大喜曰：“吾固知齐军怯，入吾地三日，士卒亡者过半矣!”乃弃其步军，与其轻锐兼程逐之。孙子度其行，暮当至马陵。马陵道狭，而孙膑旁多阻隘，可伏兵，乃斫大树，白而书之，曰：“庞涓死此树下。”（边批：奇计独造。）于是令齐军善射者万弩夹道而伏，期曰：“暮见火举而俱发。”涓果夜至斫木下，见白书，乃钻火烛之。读未毕，齐军万弩俱发，魏军乱，大败，庞涓自刭。","羌寇武都。迁虞诩为武都太守。羌乃率众数千，遮诩于陈仓崤谷。诩军停车不进，而宣言“上书请兵，须到乃发”。羌闻之，乃分钞旁县。诩因其兵散，日夜进道，兼行百余里，令军士各作两灶，日增倍之。羌不敢逼，或问曰：“孙膑减灶，而君增之，兵法曰：‘行不过三十里。’而今且二百里，何也？”诩曰：“虏众我寡，徐行则易为所及，速进则彼所不测；虏见吾灶日增，必谓郡兵来迎，众多行速，必惮追我。孙膑见弱，吾今示强，势不同也。”既到郡，兵不满三千，而羌众万余，攻围赤亭数十日，诩乃令军中使强弩勿发，而潜发小弩。羌以为矢力弱不能至，并兵急攻，诩于是使二十强弩共射一人，发无不中，羌大震退。诩因出城奋击，多所杀伤，明日悉阵其众，令从东郭门出，北郭门入，贸易衣服，回转数周，羌不知其数，更相恐动。诩计贼当退，乃潜遣五百余人，浅水设伏，候其走路。虏果大奔，因掩击。大破之。"]},{"title":"兵智部·祖逖 檀道济 岳飞","content":["【原文】","祖逖将韩潜与后赵将桃豹分据陈川故城，相守四旬。逖以布囊盛土，使千余人运以馈。潜又使数人担米息于道，豹兵逐之，即弃而走，豹兵久饥，以为逖士众丰饱，大惧，宵遁。","宋檀道济伐魏，累胜。至历城，魏以轻骑邀其前后，焚烧谷草。道济军食尽，引还。有卒亡降魏，具告之。魏人追之，众洶惧将溃。道济夜唱筹量沙，以所余少米覆其上。及旦，魏兵见之，谓道济资粮有余，以降者为妄而斩之，道济全军以归。","岳飞奉诏招抚岭表贼曹成，不从，乃上奏：“群盗力强则肆横，力屈则就招，不加剿而遽议招，未易也。”遂率兵入。会得成谍者，缚之帐下。飞出帐，调兵食。吏白曰：“粮尽矣，奈何？”边批：飞使之。飞阳曰：“且反茶陵。”已而顾谍作失意状，顿足而入。阴令逸之，计谍归告，成必来追。即下令蓐食，潜趣绕岭。未明，已逼贼垒。出不意，惊呼曰：“岳家军至矣!”飞乘之，遂大溃。自是连夺其险隘。贼穷，飞乃曰：“招今可行矣。”","〔评〕孙膑强而示之弱，虞诩弱而示之强，祖逖、檀道济饥而示之饱，岳忠武饱而示之饥。"]},{"title":"兵智部·勾践 柴绍","content":["【原文】","吴阖闾伐越，越子勾践御之，陈于携李。勾践患吴之整也，使死士再禽焉，不动。使罪人三行，属剑于颈，而辞曰：“二君有治，臣奸旗鼓，不敏于君之行前，不敢逃刑，敢归死!”遂自刭也。吴师属目，越子因而伐之，大败之。","吐谷浑寇洮、岷二州。遣柴绍救之，为其所围。虏乘高射之，矢如雨下，绍遣人弹胡琵琶，二女子对舞。虏怪之，相与聚观。绍察其无备，潜遣精骑，出虏阵后，击之，虏众大溃。","〔评〕罪人胜如死士，女子胜如劲卒，是皆创奇设诱，得未曾有。"]},{"title":"兵智部·冯异 王晙","content":["【原文】","冯异与赤眉战，使壮士变服与赤眉同，伏于道侧。旦日，赤眉使万人攻异前部。贼见势弱，遂悉众攻异。异乃纵兵大战，日昃，贼气衰，伏兵卒起，服色相乱，赤眉不复识别，众遂惊溃。异追击，大破之。","吐蕃寇临洮，次大来谷。安北大都护王晙率所部二千，与临洮兵合，料奇兵七百，易胡服，夜袭敌营，去贼五里，令曰：“前遇寇大呼，鼓角应之。”贼惊，疑伏兵在旁，自相斗，死者万计。"]},{"title":"兵智部·张齐贤","content":["【原文】","齐贤知代州，契丹入寇。齐贤遣使期潘美以并师来会战。使为契丹所执，俄而美使至云：“师出至柏井，得密诏，不许出战，已还州矣。”齐贤曰：“敌知美之来，而不知美之退。”乃夜发兵二百人，人持一帜，负一束刍，距州西南三十里，列炽燃刍，契丹兵遥见火光中有旗帜，意谓并师至，骇而北走。齐贤先伏卒二千于土镫砦，掩击，大破之。"]},{"title":"兵智部·藁人","content":["【原文】","令狐潮围睢阳，城中矢尽。张巡缚藁为人。披黑衣，夜缒城下。潮兵争射之，得箭数十万。其后复夜缒人，贼笑不设备。乃以死士五百斫潮营，焚垒幕，追奔十余里。","开禧中，毕再遇被围于六合，军中矢尽，再遇令人张青盖往来城上，金人意主兵官也，争射之，须臾矢集楼墙如猬，获矢二十余万。又敌尝以水柜败我，再遇夜缚藁人数千，衣以甲胄，持旗帜戈矛，俨立戎行。昧爽，鸣鼓，敌虏惊视，急放水柜，旋知其非真也，意甚沮。急出师攻之，敌遂大败。","沅州蛮叛，荆湖制置遣兵讨之。蛮以竹为箭，傅以毒药，血濡缕立死。官军畏之，莫敢前。乃束藁人，罗列焜耀，蛮见之，以为官军，万矢俱发。伺其矢尽，乃出兵攻之，直捣其穴。"]},{"title":"兵智部·李光弼","content":["【原文】","史思明有良马千余匹，每日出于河南渚浴之，循环不休。李光弼命索军中牝马，得五百匹，絷其驹而出之。思明马见之，悉浮渡河，尽驱入城。思明怒，泛火船欲烧浮桥，光弼先贮百尺长竿，以巨木承其根，毡裹铁叉，置其首，以迎火船而叉之，船不能进，须臾自焚尽。"]},{"title":"兵智部·程昱","content":["【原文】","昱，东阿人，黄巾贼起，县丞王度反应之。吏民皆负老幼，东奔渠丘山。度出城西五、六里止屯。昱因谓县中大姓薛房曰：“度得城郭而不居，其志可知，此不过欲掠财物耳。何不相率还城而守之？”吏民不肯从，昱谓房等“愚民不可计事”，乃密遣数骑举幡东山上，令房等望见，因大呼曰：“贼至矣!”便下山趣城，吏民奔走相随，昱遂与之共守，度来攻。昱击破之。"]},{"title":"兵智部·战车","content":["【原文】","李纲请造战车，曰：“虏以铁骑胜中国，其说有三，而非车不足以制之。步兵不足以当其驰突，一也，用车则驰突可御。骑兵、马弗如之，二也，用车则骑兵在后，度便乃出。战卒多怯，见敌辄溃，虽有长技，不得而施，三也，用车则人有所依，可施其力，部伍有束，不得而逃。则车可以制胜明矣。","靖康间，献车制者甚众，独总制官张行中者可取。其造车之法：用两竿双轮，推竿则轮转；两竿之间，以横木筦之，设架以载巨弩；其上施皮篱以捍矢石，绘神兽之象，弩矢发于口中，而窍其目以望敌；其下施甲裙以卫人足；其前施枪刃两重，重各四枚，上长而下短，长者以御人也，短者以御马也；其两旁以铁为钩索，止则联属以为营。其出战之法：则每车用步卒二十五人，四人推竿以运车，一人登车望敌以发弩矢，二十人执牌、弓弩、长枪、斩马刀，列车两旁。重行，行五人；凡遇敌，则牌居前，弓弩次之，枪刀又次之；敌在百步内，则偃牌，弓弩间发以射之；既逼近，则弓弩退后，枪刀进前，枪以刺人，而刀以斩马足；贼退，则车徙鼓噪，相联以进，及险乃止，以骑兵出两翼，追击以取胜。其布阵之法，则每军二千五百人，以五分之一，凡五百人为将佐卫兵及辎重之属，余二千人为车八十乘，欲布方阵，则面各用车二十乘，车相联，而步卒弥缝于其间，前者其车向敌，后者其车倒行，左右者其车顺行，贼攻左右而掩后，则随所攻而向之，前后左右，其变可以无穷，而将佐卫兵及辎重之属，皆处其中，方圆曲直，随地之便，行则鳞次以为阵。止则钩联以为营，不必开沟堑，筑营垒，最为简便而完固。”","〔评〕先臣余子俊言：“大同宣抚地方，地多旷衍，车战为宜。器械干粮，不烦马驮，运有用之城，策不饲之马。”（边批：二句尽车之利。）因献图本，及兵部造试，所费不赀，而迟重难行，率归于废。故有“鹧鸪车”之号，谓“行不得”也。夫古人战皆用车，何便于昔而不便于今？殆考之未精，制之未善，而当事者遂以一试弃之耳。且如秦筑长城，万世为利；而今之筑堡筑垣者，皆云沙浮易圮。赵充国屯田，亦万世为利；而今之开屯者，亦多筑舍无成。是皆无实心任事之人，合群策以求万全故也!法曷故哉？呜呼!苟无实心任事之人，即尽圣祖神宗之法制，皆题之曰“鹧鸪”可也!"]},{"title":"兵智部·吴玠 吴磷","content":["【原文】","吴玠每战，选劲弩，命诸将分番迭射，号“驻队矢”，连发不绝，繁如雨注，敌不能当。","吴璘仿车战余意，立“叠阵法”，每战以长枪居前，坐不得起；次最强弓，次强弩跪膝俟，次神臂弓。约贼相搏，至百步内，则神臂先发，七十步，强弓并发。次阵如之。凡阵，以拒马为限，铁钩相连。伤则更代之，遇更代则以鼓为节。骑为两翼蔽于前，阵成而骑退，谓之叠阵。战士心定，则能持满④，敌虽锐，不能当也。","〔评〕璘著《兵法》二篇，大略谓，金人有四长，我有四短。当反我之短，制彼之长。四长曰骑兵，曰坚忍，曰重甲，曰弓矢。吾集番、汉所长，兼收而用之：以分队制其骑兵，以番休迭战制其坚忍，以劲弓强弩制其重甲，以远克近、强制弱制其弓矢。布阵之法，则以步军为阵心，翼以马军，为左右肋，而拒马布两肋之间。"]},{"title":"兵智部·戚继光","content":["【原文】","戚继光戚继光每以“鸳鸯阵”取胜。其法：二牌平列，狼筅各跟一牌；每牌用长枪二支夹之，短兵居后。遇战，伍长低头执挨牌前进，如已闻鼓声而迟留不进，即以军法斩首。其余紧随牌进。交锋，筅以救牌，长枪救筅，短兵救长枪；牌手阵亡，伍下兵通斩。"]},{"title":"兵智部·张浚","content":["【原文】","绍兴中，虏趋京，所过城邑，欲立取之。会天大寒，城池皆冻。虏籍冰梯城，不攻而入。张魏公在大名，闻之，先弛濠鱼之禁，人争出取鱼，冰不得合，虏至城下，睥睨久之，叹息而去。"]},{"title":"兵智部·孟珙","content":["【原文】","孟珙攻蔡。蔡人恃柴潭为固，外即汝河。潭高于河五六丈，城上金字号楼伏巨弩，相传下有龙，人不敢近。将士疑畏。珙召麾下饮酒，再行，谓曰：“此潭楼非天造地设，伏弩能及远，而不可射近，彼所恃，此水耳。决而注之，涸可立待。”遣人凿其两翼，潭果决，实以薪苇，遂济师，攻城克之。"]},{"title":"兵智部·李存进 樊若水","content":["【原文】","晋副总管李存进造浮梁于德胜。旧制浮梁须竹笮、铁牛、石囷。存进以苇笮维巨舰，系于土山巨木，逾月而成。浮梁之简便，自存进始。","唐池州人樊若水，举进士不第，因谋归宋。乃渔钓于采石江上，乘小舟，载系绳维南岸，疾棹抵北岸，以度江之广狭。因诣阙上书，请造浮梁以济。议者谓江阔水深，古未有浮梁而济者，帝不听，擢若水右赞善大夫，遣石全振往荆湖，造黄黑龙船数千艘。又以大舰载巨竹絙，自荆渚而下，先试于石碑口。移置采石，三日而成，不差寸尺。"]},{"title":"兵智部·王濬 王彦章","content":["【原文】","吴人于江碛要害处，并以铁锁横截之；又作铁锥，长丈余，暗置江中，以逆拒舟舰，濬作大筏数十，方百余步，令善水者以筏先行，遇铁锥，锥辄着筏而去，又作大炬，灌以麻油，遇锁燃炬烧之，须臾熔液断绝，舟行无碍。","晋王尽有河北，以铁锁断德胜口，筑河南、北为两城，号“夹寨”。王彦章受命至滑州，置酒大会，阴遣人具舟于杨村，命甲士六百人，皆持巨斧，载冶者，具鞴炭，乘流而下。彦章会饮酒半，佯醉，起更衣，引精兵千，沿河以趋德胜。舟兵举火熔锁，因以巨斧斩断浮桥，而彦章引兵急击南城，遂破之。"]},{"title":"兵智部·贺若弼 崔乾祐","content":["【原文】","隋兵与陈师战，退走数四，贺若弼辄纵烟以自隐。","哥舒翰追贼入隘道，贼乘高下木石，击杀甚众。翰以毡车驾马为前驱，欲以冲贼。会东风暴急，贼将崔乾祐以草车数十乘，塞毡车之前，纵火焚之，烟所被，官军不能开目，妄自相杀。"]},{"title":"兵智部·王朴","content":["【原文】","周世宗时，拾遗王朴献《平边策》，略云：“攻取之道，从易者始。当今唯吴易图，东至海，南至江，可挠之地二千里。从少备处先挠之，备东则挠其西，备西则挠其东。彼奔走以救弊，则奔走之间，我可窥其虚实。避实击虚，所向无前，则江北诸州举矣。既得江北，用彼之民，扬我之兵，江南亦不难下也。江南下，而桂、广、岷、蜀，可飞书召之矣。吴、蜀既平，幽必望风而至，唯并为必死之寇，必须强兵力攻，然不足为边患也。”世宗奇之，未及试，其后宋兴，卒如其策。"]},{"title":"兵智部·习马练刀法","content":["【原文】","北虏马生驹数日，则系骒马于山半，驹在下盘旋，母子哀鸣相应，力挣而上，乃得乳。渐移系高处，驹亦渐登，故能陟峻如砥。今养马宜就高山所在放牧，亦仿其法，马自可用。","又，倭国每生儿，亲朋敛铁相贺，即投于井中。岁取锻炼一度，至长成刀，利不可当。今勋卫之家，世武为业，而家无锐刃。愚意亦宜仿此，箕裘弓冶，不足为笑也。"]},{"title":"闺智部·总序","content":["【原文】","冯子曰：语有之：“男子有德便是才，妇人无才便是德。”其然，岂其然乎？夫祥麟虽祥，不能搏鼠；文凤虽文，不能攫兔。世有申生，孝己之行，才竟何居焉？成周圣善，首推邑姜，孔子称其才与九臣埒，不闻以才贬德也!夫才者，智而已矣，不智则懵，无才而可以为德，则天下之懵妇人毋乃皆德类也乎？譬之日月：男，日也；女，月也。日光而月借，妻所以齐也；日殁而月代，妇所以辅也。此亦日月之智，日月之才也!今日必赫赫，月必噎噎，曜一而已，何必二？余是以有取于闺智也。贤哲者，以别于愚也；雄略者，以别于雌也。吕、武之智，横而不可训也。灵芸之属智于技，上官之属智于文，纤而不足，术也。非横也，非纤也，谓之才可也，谓之德亦可也。若夫孝义节烈，彤管传馨，则亦闺闼中之麟祥凤文，而品智者未之及也。"]},{"title":"闺智部·马皇后","content":["【原文】","高皇帝初造宝钞，屡不成。梦人告曰：“欲钞成，须取秀才心肝为之。”觉而思曰：“岂欲我杀士耶？”马皇后启曰：“以妾观之，秀才们所作文章，即心肝也。”上悦，即于本监取进呈文字用之，钞遂成。"]},{"title":"闺智部·唐肃宗公主","content":["【原文】","肃宗宴于宫中，女优弄假戏，有绿衣秉简为参军者。天宝末，番将阿布思伏法，其妻配掖庭，善为优，因隶乐工，遂令为参军之戏。公主谏曰：“禁中妓女不少，何须此人？使阿布思真逆人耶，其妻亦同刑人，不合近至尊之座；若果冤横，又岂忍使其妻与群优杂处，为笑谑之具哉？妾虽至愚，深以为不可。”上亦悯恻，遂罢戏而免阿布思之妻，由是咸重公主。公主，即柳晟母也。"]},{"title":"闺智部·乐羊子妻","content":["【原文】","乐羊子尝于行路拾遗金一饼，还以语妻，妻曰：“志士不饮盗泉，廉士不食嗟来，况拾遗金乎？”羊子大惭，即捐之野。","乐羊子游学，一年而归。妻问故，羊子曰：“久客怀思耳。”妻乃引刀趋机而言曰：“此织自一丝而累寸，寸而累丈，丈而累匹。今若断斯机，则前功尽捐矣!学废半途，何以异是？”羊子感其言，还卒业，七年不返。","乐羊子游学，其妻勤作以养姑。尝有他舍鸡谬入园，姑杀而烹之，妻对鸡不餐而泣，姑怪问故，对曰：“自伤居贫，不能备物，使食有他肉耳。”姑遂弃去不食。","〔评〕返遗金，则妻为益友；卒业，则妻为严师；谕姑于道，成夫之德，则妻又为大贤孝妇。"]},{"title":"闺智部·陶侃母","content":["【原文】","陶侃母湛氏，豫章新淦人。初侃父丹聘为妾，生侃。而陶氏贫贱，湛每纺绩赀给之，使交结胜己。侃少为浔阳县吏，尝监鱼梁，以一封鲊遗母，湛还鲊，以书责侃曰：“尔为吏，以官物遗我，非唯不能益我，乃以增吾忧矣。”鄱阳范逵素知名，举孝廉，投侃宿。时冰雪积日，侃室如悬磬，而逵仆马甚多，湛语侃曰：“汝但出外留客，吾自为计。”湛头发委地，下为二髲，卖得数斛米。斫诸屋柱，悉割半为薪，剉卧荐④以为马草，遂具精馔，从者俱给，逵闻叹曰：“非此母不生此子。”至洛阳，大为延誉，侃遂通显。"]},{"title":"闺智部·赵括母 柴克宏母","content":["【原文】","秦、赵相距长平，赵王信秦反间，欲以赵奢之子括为将而代廉颇。括平日每易言兵，奢不以为然，及是将行，其母上书言于王曰：“括不可使将。”王曰：“何以？”对曰：“始妾事其父，时为将，身所奉饭饮而进食者以十数，所友者以百数，大王及宗室所赏赐者，尽以予军吏，受命之日，不问家事；今括一旦为将，东向而朝，军吏无敢仰视之者，王所赐金帛，归藏于家，而日视便利田宅可买者买之，父子异志，愿王勿遣。”王曰：“母置之，吾已决矣。”括母因曰：“王终遣之，即有不称，妾得无坐。”王许诺。括既将，悉变廉颇约束，兵败身死，赵王亦以括母先言，竟不诛也。","后唐龙武都虞侯柴克宏，再用之子也。沈默好施，不事家产，虽典宿卫，日与宾客博弈饮酒，未尝言兵，时人以为非将帅才。及吴越围常州，克宏请效死行阵，其母亦表称克宏有父风，可为将，苟不胜任，分甘孥戮。”元宗用为左武卫将军，使救常州，大破敌兵。","〔评〕括母不独知人，其论将处亦高。","括唯不知兵，故易言兵；克宏未尝言兵，政深于兵。赵母知败，柴母知胜，皆以其父决之，异哉!"]},{"title":"闺智部·陈婴母 王陵母","content":["【原文】","东阳少年起兵，欲立令史陈婴为王。婴母曰：“暴得大名不祥，不如有所属，事成封侯；不成，非世所指名也。”婴乃推项梁。","王陵以兵属汉，项羽取陵母置军中。陵使至，则东向坐陵母，欲以招陵。陵母私送使者，泣曰：“愿为妾语陵，善事汉王，汉王长者，毋以老妾故持二心。”遂伏剑而死。（边批：干净。）","〔评〕婴母知废，胜于陈涉、韩广、田横、英布、陈豨诸人；陵母知兴，胜于亚父、蒯通、贯高诸人。姜叙讨贼，其母速之，马超叛，杀刺史、太守，叙议讨之，母曰：“当速发，勿顾我。”超袭执叙母，母骂超而死，明大义也；乃楚项争衡，雌雄未定，而陵母预识天下必属长者，而唯恐陵失之，且伏剑以绝其念，死生之际，能断决如此，女子中伟丈夫哉!徐庶之不终于昭烈也，其母存也，陵母不伏剑，陵亦庶也。"]},{"title":"闺智部·叔向母","content":["【原文】","初，叔向晋大夫羊舌肸欲娶于申公巫臣氏，其母欲娶其党。叔向曰：“吾母多而庶鲜，吾惩舅氏矣。”其母曰：“子灵之妻夏姬也杀三夫、一君、一子，而亡一国两卿矣，可无惩乎？吾闻之：甚美必有甚恶。昔有仍氏生女，发黑而美，光可以鉴，名曰玄妻。乐正后夔取之，生伯封，实有豕心，贪惏无厌，忿颣无期，谓之封豕。有穷后羿灭之，夔是以不祀。今三代之亡，共子之废，皆是物也，汝何以为哉？夫有尤物，足以移人，苟非德义，则必有祸。”叔向惧，不敢取。平公强使取之。生伯石。伯石始生，叔向之母视之，及堂，闻其声而还，曰：“是豺狼之声也!狼子野心，非是，莫丧羊舌氏矣。”遂弗视。"]},{"title":"闺智部·严延年母","content":["【原文】","严延年守河南，酷烈好杀，号曰“屠伯”。其母从东海来，适见报囚，大惊，便止都亭，不肯入府。因责延年曰：“天道神明，人不可独杀，我不意当老见壮子被刑戮也，行矣，去汝东归，扫除墓地。”遂去归郡。后岁余，果败诛。东海莫不贤智其母。"]},{"title":"闺智部·伯宗妻","content":["【原文】","晋伯宗朝，以喜归。其妻曰：“子貌有喜，何也？”曰：“吾言于朝，诸大夫皆谓我智似阳子。”对曰：“阳子华而不实，主言而无谋，是以难及其身，子何喜焉？”伯宗曰：“我饮诸大夫而与之语，尔试听之。”曰：“诺。”其妻曰：“诸大夫莫子若也。然而民不能戴其上久矣，难必及子，盍亟索士，憖庇州犁，伯宗子焉？”得毕阳。后诸大夫害伯宗，毕阳实送州犁于荆。初，伯宗每朝，其妻必戒之曰：“盗憎主人，民怨其上，子好直言，必及于难。”"]},{"title":"闺智部·僖负羁妻","content":["【原文】","晋公子重耳至曹，曹共公闻其骈胁，使浴而窥之。曹大夫僖负羁之妻曰：“吾观晋公子之从者皆足以相国，若以相，夫子必反其国，反其国，必得志于诸侯，得志于诸侯而诛无礼，曹其首也，子盍早自贰焉。”乃馈盘餐，置璧焉，公子受餐反璧，及重耳入曹，令无入僖负羁之宫。","〔评〕僖负羁始不能效郑叔詹之谏，而私欢晋客；及晋报曹，又不能夫妻肉袒为曹君谢罪，盖庸人耳。独其妻能识人，能料事，有不可泯没者。"]},{"title":"闺智部·李夫人","content":["【原文】","李夫人病笃，上自临候之。夫人蒙被谢曰：“妾久寝病，形貌毁坏，不可以见帝，愿以王及兄弟为托。”李生昌邑哀王。上曰：“夫人病甚，殆将不起，属托王及兄弟，岂不快哉!”夫人曰：“妇人貌不修饰，不见君父，妾不敢以燕媠见帝。”上曰：“夫人第一见我，将加赐千金，而予兄弟尊官。”夫人曰：“尊官在帝，不在一见。”上复言，必欲见之，夫人遂转向嘘唏而不复言。于是上不悦而起，夫人姊妹让之曰：“贵人独不可一见上，属托兄弟耶？何为恨上如此？”夫人曰：“夫以色事人者，李夫人色衰而爱弛，爱弛则恩绝，上所以恋恋我者，以平生容貌故。今日我毁坏，必畏恶吐弃我，（边批：识透人情。）尚肯复追思闵录其兄弟哉？所以不欲见帝者，乃欲以深托兄弟也。”及夫人卒，上思念不已。"]},{"title":"闺智部·齐姜 张后","content":["【原文】","晋公子重耳出亡至齐，齐桓妻以宗女，有马二十乘，公子安之。留齐五岁，无去心。赵衰、咎犯辈乃于桑下谋行，蚕妾在桑上闻之，以告姜氏。姜氏杀之，劝公子趣行，公子曰：“人生安乐，孰知其他？”姜氏曰：“子一国公子，穷而来此。数子者以子为命，子不疾反国报劳臣，而怀女德，窃为子羞之。且不求，何时得功？”乃与赵衰等谋醉重耳，载以行。","张氏，司马懿后也，有智略。懿初辞魏武命，托病风痹不起。一日晒书，忽暴雨至，懿不觉自起收之，家唯一婢见，后即手杀婢以灭口，而亲自执爨。","〔评〕五伯桓、文为盛，即一女一妻，已足千古。"]},{"title":"闺智部·刘知远夫人","content":["【原文】","刘知远至晋阳，议率民财以赏将士。夫人李氏谏曰：“陛下因河东创大业，未有惠泽及民，而先夺其生资，殆非新天子所以救民之意也!请悉出军中所有劳军，虽复不厚，人无怨言。”知远从之，中外大悦。"]},{"title":"闺智部·李景让母","content":["【原文】","唐李景让母郑氏，性严明。景让宦达，发已斑白，小有过，不免捶楚。其为浙西观察使，有牙将逆意，杖之而毙，军中愤怒，将为变。母闻之，出坐厅事，立景让于庭而责之曰：“天子付汝以方面，岂得以国家刑法为喜怒之资，而妄杀无罪，万一致一方不宁，岂唯上负朝廷，使垂老之母含羞入地，何以见汝之先人哉？”命左右褫其衣，将挞其背，将佐皆为之请，良久乃释，军中遂安。","〔评〕按郑氏早寡，家贫子幼，母自教之。宅后墙陷，得钱盈船，母祝之曰：“吾闻无劳而获，身之灾也。天若矜我贫，则愿诸孤学问有成，此不敢取。”遽掩而筑之，盖妇人中有大见识者。景让弟景庄，老于场屋。每被黜，母辄挞景让。此事可笑，然景让终不肯属主司，曰：“朝廷取士，自有公道，岂可效人求关节乎？”其渐于义方深矣。"]},{"title":"闺智部·洗氏","content":["【原文】","高凉洗氏，世为蛮酋，部落十余万家。有女，多筹略，罗州刺史冯融聘以为子宝妇。融虽世为方伯，非其土人，号令不行。洗氏约束本宗，使从民礼；参决词讼，犯者虽亲不赦。由是冯氏得行其政。高州刺史李迁仕遣使召宝，宝欲往，洗氏止之曰：“刺史被召援台，时台城被围。乃称有疾，铸兵聚众而后召君，此必欲质君以发君之兵也!愿且勿往，以观其变。”数日，迁仕果反，遣主帅杜平虏将兵逼南康。陈霸先使周文育击之，洗氏谓宝曰：“平虏今与官军相拒，势不得还；迁仕在州，无能为也，君若自往，必有战斗，宜遣使卑词厚礼，告之曰：‘身未敢出，欲遣妇参。’彼必喜而无备，我将千余人步担杂物，昌言输赕，得至栅下，破之必矣。”宝从之，迁仕果不设备，洗氏袭击，破走之。与霸先会于灨石，还谓宝曰：“陈都督非常人也，甚得众心，必能平贼，宜厚资之。”及宝卒，岭表大乱，夫人怀集百粤，数州宴然，共奉夫人为“圣母”。","隋文帝时，番州总管赵讷贪虐，诸俚獠多叛，夫人遣长史上封事，论安抚之宜，并言讷罪状。上置讷于法，敕夫人招慰亡叛，夫人亲载诏书，自称“使者”，历十余州，宣述上意，所至皆降。及卒，谥“诚敬夫人”。","〔评〕智勇具足，女中大将。"]},{"title":"闺智部·谢小娥","content":["【原文】","谢小娥者，豫章估客女也。生八岁，丧母，嫁历阳段氏。故二姓常同舟，贸易江湖间。小娥年十四，始及笄，父与夫皆为劫盗所杀，二姓之党歼焉。小娥亦伤脑折足，漂流水中，为他船所获，经夕而活。因流转乞食，至上元县，依妙果寺尼净悟。初，小娥父死时，梦父谓曰：“杀我者，‘车中猿，门东草。’”又数日后，梦其夫谓曰：“杀我者，‘禾中走，一日夫’。”小娥不能解，常书此语，广求智者辨之，历年不得。至元和八年，李公佐罢江西从事，泊舟建业，登瓦官寺阁。僧赍物为李述之，李凭栏书空，疑思嘿虑，忽然了悟，令寺童疾召小娥，谓之曰：“杀汝父者申兰，杀汝夫者申春也，其日‘车中猿’者，车字之中乃‘申’字，申非属猴乎?草下有门，门中有东，‘兰’字也。又‘禾中走’，是穿田过，亦是‘申’字，‘一日夫’者，夫上更一画，下一日，是‘春’字。其为申兰、申春可明矣!”小娥恸哭再拜，密书四字于衣，誓访二贼以复其冤。更为男子服，佣保江湖间。岁余，至浔阳郡，见纸榜子召佣者，娥应召，问其主，果申兰也。娥心愤貌顺。（边批：大有心人。）在兰左右，积二岁余，甚见亲爱，金帛出入之数无不委之。每睹谢之衣物器具，未尝不暗泣。兰与春，宗昆弟也，春家在大江北独树浦，往来密洽。一日春携大鲤兼酒诣兰，至夕，群贼毕至。酣饮，暨诸凶既去，春沉醉卧于内室。兰亦覆寝于庭，小娥潜锁春于内，（边批：贼在掌中，从容摆布。）抽佩刃先斩兰首，呼号邻人并至。春擒于内，兰死于外，获赃货至数千万。初，兰、春有党数十人，暗记其名，悉擒就戮。时浔阳太守张公嘉其孝节，免死，娥竟剪发为尼以终。（边批：还当旌异，岂特免死?）","〔评〕其智勇或有之，其坚忍处，万万难及。"]},{"title":"闺智部·红拂","content":["【原文】","杨素守西京日，李靖以布衣献策。素踞床而见，靖长揖曰：“天下方乱，英雄竞起，公为重臣，须以收罗豪杰为心，不宜倨见宾客。”素敛容谢之。时妓妾罗列，内有执红拂者，有殊色，独目靖。靖既去，而执拂者临轩指吏曰：“问去者处士第几？住何处？”（边批：见便识李靖。）靖具以对。妓诵而去。靖归逆旅，其夜五更初，忽闻叩门而声低者，靖启视，则紫衣红拂纱帽人，杖一囊，问之，曰：“杨家红拂妓也。”延入，脱衣去帽，遽向靖拜，靖惊答之，再叩来意，曰：“妾侍杨司空久，阅天下之人多矣，无如公者，故来相就耳。”靖曰：“如司空何？”曰：“彼尸居余气，（边批：又识杨素。）不足畏也。诸妓知其无成，去者甚众矣，彼亦不甚逐也。计之详矣，幸无疑焉。”问其姓，曰：“张。”问其伯仲之次，曰：“最长。”观其肌肤仪状、言辞气语，真天人也。靖不自意获之，愈喜愈惧，万虑不安，而窥户者无停履。数日，亦闻追讨之声，意亦非峻。乃雄服乘马，排闼⑤而去，将归太原。行次灵石旅舍，既设床，炉中烹肉且熟。张氏以发长委地，立梳床前；靖方刷马，忽有一客，中形，赤髯如虬，策蹇驴而来，投革囊于驴前，取枕欹卧，看张梳头。（边批：便知非常人。）靖怒甚，欲发，张熟视客，一手映身摇示靖，令勿怒。（边批：又识虬髯客。）急梳毕，敛衽前问其姓，客卧而答之，曰：“姓张。”对曰：“妾亦姓张，合是妹。”遽拜之。问其第几，曰：“行三。”亦问妹第几，曰：“最长。”客喜曰：“今日幸逢一妹。”张氏遥呼：“李郎，且来见三兄!”靖骤拜之，遂环坐，问煮何肉，曰：“羊肉，计已熟矣。”客曰饥，靖出市胡饼。客抽腰间匕首，切肉共食，复索酒饮，于是开革囊，取下酒物，乃一人首并心肝，却头囊中，以匕首切心肝共食之，曰：“此人乃天下负心者，衔之十年，今始获之。”又曰：“观李郎贫士，何以得致异人？”靖不敢隐，具言其由，曰：“然。故知非君所致也，今将何之？”曰：“将避地太原。”曰：“望气者言太原有奇气，吾将访之。”靖因言州将子李世民，客与靖期会于汾阳桥，遂乘驴疾去。及期候之，相见大喜，靖诈言客善相，因友人刘文靖得见。“世民真天子矣!”废然而返，遂邀靖夫妇至家，令其妻出见，酒极奢，因倾家财付靖，文簿匙锁，共二十床，曰：“赠李郎佐真主立功业也。”与其妻戎服跃马，一奴从之。数步遂不复见。靖竟佐命，封卫公。","〔评〕吴长卿曰：“红拂见卫公，自以为不世之遇，视杨素蔑如矣；孰知又有一虬髯也，视李郎又蔑如矣。惜哉，不及见李公子也!”"]},{"title":"闺智部·沈小霞妾","content":["【原文】","锦衣卫经历沈炼，以攻严相得罪，谪佃保安。时总督杨顺、巡按路楷皆嵩客，受世蕃指：“若除吾疡，大者侯，小者卿。”顺因与楷合策，捕诸白莲教通虏者，窜炼名籍中，论斩，籍其家。顺以功荫一子锦衣千户，楷侯选五品卿寺。顺犹怏怏曰：“相君薄我赏，犹有不足乎。”取炼二子杖杀之，而移檄越，逮公长子诸生襄。至则日掠治，困急且死。会顺、楷被劾，卒奉旨逮治，而襄得末减问戍。襄之始来也，只一爱妾从行，及是与妾俱赴戍所，中道微闻严氏将使人要而杀之，襄惧欲窜，而顾妾不能割，妾曰：“君一身，沈氏宗祧所系，第去勿忧我。”襄遂绐押者：“城中有年家某，负吾家金钱，往索可得。”押者恃妾在，不疑，纵之去。久之不返，押者往年家询之，云：“未尝至。”还复叩妾，妾把其襟大恸曰：“吾夫妇患难相守，无倾刻离，今去而不返，必汝曹受严氏指，戕杀我夫矣。”观者如市，不能判，闻于监司，监司亦疑严氏真有此事，不得已，权使妾寄食尼庵，而立限责押者迹襄。押者物色不得，屡受笞，乃哀恳于妾，言：“襄实自窜，毋枉我。”因以问亡命去。久之，嵩败，襄始出讼冤，捕顺、楷抵罪，妾复相从。襄号小霞，楚人江进之有《沈小霞妾传》。","〔评〕严氏将要襄杀之，事之有无不可知。然襄此去实大便宜，大干净。得此妾一番撒赖，即上官亦疑真有是事，而襄始安然亡命无患矣!顺、楷辈死，肉不足喂狗，而此妾与沈氏父子并传，忠智萃于一门，盛矣哉!"]},{"title":"闺智部·崔简妻","content":["【原文】","唐滕王极淫。诸官美妻，无得白者，诈言妃唤，即行无礼。时典签崔简妻郑氏初到，王遣唤。欲不去，则惧王之威；去则被王之辱。郑曰：“无害。”遂入王中门外小阁。王在其中，郑入，欲逼之，郑大叫左右曰：“大王岂作如是，必家奴耳。”取只履击王头破，抓面流血，妃闻而出。郑乃得还。王惭，旬日不视事。简每日参候，不敢离门。后王坐，简向前谢，王惭，乃出。诸官之妻曾被唤入者，莫不羞之。","〔评〕不唯自全，又能全人，此妇有胆有识。"]},{"title":"闺智部·新妇","content":["【原文】","某家娶妇之夕，有贼来穴壁。已入矣，会其地有大木，贼触木倒，破头死。烛之，乃所识邻人。仓惶间，惧反饵祸。新妇曰：“无妨。”令空一箱，纳贼尸于内，舁至贼家门首，剥啄数下，贼妇开门见箱，谓是夫盗来之物，欣然收纳。数日夫不还，发视，乃是夫尸。莫知谁杀，因密瘗之而遁。"]},{"title":"闺智部·辽阳妇","content":["【原文】","辽阳东山虏，剽掠至一家，男子俱不在，在者唯三四妇人耳。虏不知虚实，不敢入其室，于院中以弓矢恐之。室中两妇引绳，一妇安矢于绳，自窗绷而射之。数矢后，贼犹不退，矢竭矣，乃大声诡呼曰：“取箭来。”自绷上以麻秸一束掷之地，作矢声，贼惊曰：“彼矢多如是，不易制也。”遂退去。","〔评〕妇引绳发矢，犹能退贼。始知贼未尝不畏人，人自过怯，让贼得利耳。"]},{"title":"闺智部·木兰 韩保宁 黄善聪","content":["【原文】","秦发卒戍边，女子木兰悯父年老，代之行。在边十二年始归，人无知者。","韩氏保宁，民家女也。明玉珍乱蜀，女恐为所掠，乃易男子饰，托名从军，调征云南。往返七年，人无知者。虽同伍亦莫觉也，后遇其叔，一见惊异，乃明是女，携归四川，当时皆呼为“贞女”。","黄善聪，应天淮清桥民家女，年十二，失母。其姊已适人，独父业贩线香。怜善聪孤幼，无所寄养，乃令为男子装饰，携之旅游庐、凤间者数年，父亦死。善聪即诡姓名曰张胜，（边批：大智术。）仍习其业自活。同辈有李英者，亦贩香，自金陵来，不知其女也，约为火伴。同寝食者逾年，恒称有疾，不解衣袜，夜乃溲溺。弘治辛亥正月，与英皆返南京，已年二十矣，巾帽往见其姊，乃以姊称之。姊言：“我初无弟，安得来此？”善聪乃笑曰：“弟即善聪也。”泣语其故，姊大怒，（边批：亦奇人。）且詈之曰：“男女乱群，玷辱我家甚矣!汝虽自明，谁则信之？”因逐不纳，善聪不胜愤懑，泣且誓曰：“妹此身苟污。有死而已。须令明白，以表寸心。”其邻即稳婆居，姊聊呼验之，乃果处子，始相持恸哭，手为易去男装。越日，英来候，再约同往，则善聪出见，忽为女子矣，英大惊，骇问，知其故，怏怏而归，如有所失，盖恨其往事之愚也，乃告其母，母亦嗟叹不已。时英犹未室，母贤之，即为求婚，善聪不从，曰：“妾竟归英，保人无疑乎？”边批，大是。交亲邻里来劝，则涕泗横流，所执益坚。众口喧传，以为奇事，厂卫闻之，（边批：好媒人。）乃助其聘礼，判为夫妇。","〔评〕木兰十二年，最久；韩贞女七年，善聪逾年耳。至于善藏其用，以权济变，其智一也。","若南齐之东阳娄逞、五代之临邛黄崇嘏，无故而诈为丈夫，窜入仕宦，是岂女子之分乎？至如唐贞元之孟妪，年二十六而从夫，夫死而伪为夫之弟，以事郭汾阳；郭死，寡居一十五年，军中累奏兼御史大夫。忽思茕独，复嫁人，时年已七十二。又生二子，寿百余岁而卒。斯殆人妖与？又不可以常理论矣!"]},{"title":"杂智部·总序","content":["【原文】","冯子曰：智何以名杂也？以其黠而狡，慧而小也。正智无取于狡，而正智或反为狡者困；大智无取于小，而大智或反为小者欺。破其狡，则正者胜矣；识其小，则大者又胜矣。况狡而归之于正，未始非正；小而充之于大，未始不大乎？一饧也，夷以娱老，跖以脂户，是故狡可正，而正可狡也。一不龟乎也，或以战胜封，或不免于洴澼，是故大可小，而小可大也。杂智具而天下无余智矣。难之者曰：“大智若愚，是不有余智乎？”吾应之曰：“政唯无余智，乃可以有余智。太山而却撮土，河海而辞涓流，则亦不成其太山河海矣!”鸡鸣狗盗，卒免孟尝，为薛上客，顾用之何如耳。吾又安知古人之所谓正且大者，不反为不善用智者之贼乎？是故以“杂智”终其篇焉。得其智，化其杂也可；略其杂，采其智也可。"]},{"title":"杂智部·郭纯 王燧","content":["【原文】","东海孝子郭纯丧母，每哭则群鸟大集。使检有实，旌表门闾。复讯，乃是每哭即撒饼于地，群鸟争来食之。其后数数如此，鸟闻哭声，莫不竞凑，非有灵也。","河东孝子王燧家猫、犬互乳，其子言之州县，遂蒙旌表。讯之，乃是猫、犬同时产子，取其子互置窠中，饮其乳惯，遂以为常。","〔评〕田单妙计，可惜小用。然撒饼亦资冥福，称孝可矣!即使非伪，与孝何干？"]},{"title":"杂智部·京邸假宦官","content":["【原文】","嘉靖间，一士人候选京邸有官矣，然久客橐，欲贷千金。与所故游客谈。数日报命，曰：“某中贵允尔五百。”士人犹恨少，客曰：“凡贷者例以厚贽先。内相性喜谀苟得其欢，即请益非难也。”士人拮据，凑贷器币，约值百金，为期人谒及门。堂轩丽巨，苍头庐儿皆曳绮缟，两壁米袋充栋，皆有御用字。久之，主人出。壮横肥，以两童子头抵背而行，享礼微笑，许贷八百，庐儿曰：“已晚，须明日。”主人可之。士人既出，喜不自胜，客复属耳：“当早至，我俟于此。”及明往，寥然空宅，堂下煤土两堆，皆袋所倾。问主宅者，曰：“昨有内相赁宅半日，知是谁？”客亦灭迹，方悟其诈。"]},{"title":"杂智部·老妪骗局","content":["【原文】","万历戊子，杭郡北门外有居民，年望六而丧妻。二子妇皆美，而事翁皆孝敬。一日忽有老妪立于门，自晨至午，若有期待而不至者。翁出入数次。怜其久立，命二子妇询其故，妇曰：“吾子忤逆，将诉之官，期姐子同往，久候不来，腹且枵矣。”子妇怜而饭之，言论甚相惬，至暮，期者不来，因留之宿，一住旬日。凡子妇操作，悉代其劳，而女工尤精。子妇唯恐其去也，谓妪无夫而子不孝，茕茕无归，力劝翁娶之，翁乃与合。又旬余，妪之子与姐子始寻觅而来，拜跪告罪，妪犹厉詈不已，翁解之，乃留饮。其人即拜翁为继父，喜母有所托也。如此往来三月，一日妪之孙来，请翁一门，云已行聘，妪曰：“子妇来何容易，吾与翁及两郎君来耳。”往则醉而返。又月余，其孙复来请云：“某日毕姻，必求二姆同降。”子妇允其请，且多贷衣饰，盛妆而往，妪子妇出迎，面黄如病者，日将晡，妪子请二姆迎亲，且曰：“乡间风俗若是耳。”妪佯曰：“汝妻虽病，今日称姑矣，何以不自往迎，而烦二位乎？”其子曰：“规模不雅，无以取重。既来此，何惜一往？”妪乃许之，于是妪与病妇及二子妇俱下船去，更余不返，妪子假出觇，孙又继之，皆去矣。（边批：金蝉脱壳计。）及天明，遍觅无踪，访之房主，则云：“五六月前来租房住，不知其故。”翁父子怅怅而归，亲友来取衣饰，倾囊偿之，而二妇家来觅女不得，讼之官，翁与子恨极，因自尽。"]},{"title":"杂智部·乘驴妇","content":["【原文】","有三妇人雇驴骑行，一男子执鞭随之。忽少妇欲下驴择便地，呼二妇曰：“缓行俟我。”因倩男子佐之下，即与调谑，若相悦者。已乘驴，曰：“我心痛，不能急行。”男子既不欲强少妇。追二妇又不可得，乃憩道旁。而不知少妇反走久矣，是日三驴皆失。"]},{"title":"杂智部·窃磬","content":["【原文】","乡一老妪，向诵经，有古铜磬，一贼以石块作包，负之至媪门外。人问何物，曰：“铜磬，将鬻耳。”入门见无人，弃石于地，负磬反向门内曰：“欲买磬乎？”曰：“家自有。”贼包磬复负而出，内外皆不觉。"]},{"title":"杂智部·假跛书生 假断脚偷","content":["【原文】","阊门有匠，凿金于肆。忽一士人，巾服甚伟，跛曳而来，自语曰：“暴令以小过毒挞我，我必报之!”因袖出一大膏药，薰于炉次，若将以治疮者。俟其熔化，急糊匠面孔，匠畏热，援以手，其人即持金奔去。","又一家门集米袋，忽有躄者，垂腹甚大，盘旋其足而来，坐米袋上，众所共观，不知何由。匿米一袋于胯下，复盘旋而去。后失米，始知之。盖其腹衬塞而成，而躄亦伪也。"]},{"title":"杂智部·断脚盗","content":["【原文】","有躄盗者，一足躄，善穿窬。尝夜从二盗入巨姓家，登屋翻瓦，使二盗以绳下之，搜资入之柜，命二盗系上已，复下其柜，入资上之，如是者三矣。躄盗自度曰：“柜上，彼无置我去乎。”遂自入坐柜中，二盗系上之，果私语曰：“资重矣，彼出必多取，不如弃去。”遂持柜行大野中，一人曰：“躄盗称善偷，乃为我二人卖。”一人曰：“此时将见主人翁矣。”相与大笑欢喜，不知躄盗乃在柜中，顷二盗倦，坐道上，躄盗度将曙，又闻远舍有人语笑，从柜中大声曰：“盗劫我。”二盗惶讶遁去，躄盗顾乃得金资归。何大复作《躄盗篇》。"]},{"title":"杂智部·江南士子","content":["【原文】","江南有文科者，衣冠之族，性奸巧，好以术困人而取其资。有房一所，货于徽人。业经改造久矣，科执原直取赎，不可，乃售计于奴，使其夫妇往投徽人为仆，徽人不疑也。两月余，此仆夫妇潜窜还家，科即使他奴数辈谓徽人曰：“吾家有逃奴某，闻靠汝家，今安在？”徽人曰：“某来投，实有之，初不知为贵仆，昨已逸去矣。”奴辈曰：“吾家昨始缉知在宅，岂有逸去之事？必汝家匿之耳，吾当搜之!”徽人自信不欺，乃屏家眷于一室，而纵诸奴入视，诸奴搜至酒房，见有土松处，佯疑，取锄发之，得死人腿一只，乃哄曰：“汝谋害吾家人矣!不然，此腿从何而来？当执此讼官耳。”徽人惧，乃倩人居间，科曰：“还吾屋契，当寝其事耳。”徽人不得已，与之期而迁去。向酒房之人腿，则前投靠之奴所埋也。","科尝为人居间公事。其人约于公所封物，正较量次，有一跛丐，右持杖，左携竹篮，篮内有破衣，捱入乞赏。科拈零星与之，丐嫌少，科佯怒，取元宝一锭掷篮中，叱曰：“汝欲此耶？”丐悚惧，曰：“财主不添则已，何必怒？”双手捧宝置几上而去。后事不谐，其人启封，则元宝乃伪物，为向丐者易去矣，丐者，即科党所假也。","〔评〕苏城四方辐凑之地；骗局甚多。曾记万历季年，有徽人叔侄争坟事，结讼数年矣，其侄先有人通郡司理，欲于抚台准一词发之。忽有某公子寓阊门外，云是抚公年侄，衣冠甚伟，仆从亦都。徽侄往拜，因邀之饮。偶谈及此事，公子一力承当。遂封物为质，及期，公子公服，取讼词纳袖中，径人抚台之门，徽侄从外伺之，忽公事已毕而门闭矣，意抚公留公子餐也。询门役，俱莫知，乃晚衙，公子从人丛中酒容而出，意气扬扬，云：“抚公相待颇厚，所请已谐。”抵徽寓，出官封袖中，印识宛然。徽侄大喜，复饮食之，公子索酬如议而去，明日徽侄以文书付驿卒，此公子私从驿卒索文书自投，驿卒不与，公子言是伪封不可投。驿卒大惊，还责徽侄，急访公子，故在寓也，反叱徽人用假批假印，欲行出首。徽人惧，复出数十金赂之始免。后访知此棍惯假宦、假公子为骗局。时有春元谒见抚院，彼乘闹混入，潜匿于土地堂中，众不及察，遂掩门。渠预藏酒糕以烧酒制糕，食之醉饱，啗之，晚衙复乘闹出，封筒印识皆预造藏于袖中者，小人行险侥幸至此，亦可谓神棍矣。"]},{"title":"杂智部·猾吏奸官","content":["【原文】","包孝肃尹京日，有民犯法当杖脊。吏受赇，与约曰：“今见尹必付我责状，汝第呼号自辩，我与汝分此罪。”既而包引囚问毕，果付吏责状，囚如吏教，分辩不已，吏大声呵之曰：“但受杖出去，何用多言？”包谓其市权，捽吏于庭，杖之七十，特宽囚罪以抑吏势，不知为所卖也。","有县令监视用印。暗数已多一颗，检不得，严讯吏，亦不承。令乃好谓曰：“我明知汝盗印，今不汝罪矣，第为我言藏处。”此令素不食言者，于是吏叩头谢罪曰：“实有之，即折置印匣内，俟后开印时方取出耳。”","又闻某按院疑一吏书途中受贿，亲自简查，无迹而止。盖按院止搜其通身行李，而串铃与马鞭，大帽明置案前，贿即在内，不及察也。吏之奸弊，何所不至哉!","〔评〕“包铁面”尚尔，况他人乎!"]},{"title":"杂智部·韩昭侯 子之","content":["【原文】","韩昭侯握爪而佯亡一爪，求之甚急。左右因割其爪而效之，昭侯以此察左右之诚。","子之相燕，坐而佯言曰：“走出门者何白马也。”左右皆言不见，有一人走追之，报曰：“有。”子之以此知左右之不诚信。"]},{"title":"杂智部·江西术士","content":["【原文】","赵王李德诚镇江西。有日者，自称世人贵贱，一见辄分。王使女妓数人与其妻滕国君同妆梳服饰，立庭中，请辨良贱，客俯躬而进曰：“国君头上有黄云。”群妓不觉皆仰视，日者因指所视者为国君。"]},{"title":"杂智部·俞羡章","content":["【原文】","吴中镂书多利，而甚苦翻刻。俞羡章刻《唐类函》将成，先出讼牒，谬言新印书若干，载往某处，被盗劫去，乞官为捕之，因出赏格，募盗书贼。由是《类函》盛行，无敢翻者。"]},{"title":"杂智部·黠童子","content":["【原文】","一童子随主人宦游。从县中索骑，彼所值甚驽下。望后来人得骏马，驰而来，手握缰绳，佯泣于马上。后来问曰：“何泣也？”曰：“吾马奔逸绝尘，深惧其泛驾而伤我也。”后来以为稚弱可信，意此马更佳，乃下地与之易。童子既得马，策而去，后来人乘马，始悟其欺，追之不及。"]},{"title":"杂智部·智胜力","content":["【原文】","王卞于军中置宴。一角牴夫甚魁岸，负大力，诸健卒与较，悉不敌。坐间一秀才自言能胜之，乃以左指略展，魁岸者辄倒。卞以为神，叩其故。秀才云：“此人怕酱，预得之同伴；先入厨，求得少许酱，彼见辄倒耳。”"]},{"title":"杂智部·定远弓手","content":["【原文】","濠州定远县一弓手善用矛。有一偷亦精此技，每欲与决生死。一日，弓手因事至村，值偷适在市饮，势不可避，遂曳矛而斗。观者如堵。久之，各未能进，弓手忽谓偷曰：“尉至矣，我与你皆健者，汝敢与我尉前决生死乎？”偷曰：“诺。”弓手应声刺之而毙，盖乘其隙也。","又有人曾遇强寇，斗方接刃，寇先含水满口，忽噀其面，其人愕然，刃已揕胸。后有一壮士复与寇遇，已先知噀水之事，寇复用之，反为所刺。"]},{"title":"杂智部·王守仁","content":["【原文】","王守仁王阳明年十二，继母待之不慈。父官京师，公度不能免。以母信佛，乃夜潜起，列五托子于室门。母晨兴，见而心悸。他日复如之，母愈骇，然犹不悛也。公乃于郊外访射鸟者，得一异形鸟，生置母衾内，母整衾，见怪鸟飞去。大惧，召巫媪问之。公怀金赂媪，诈言：“王状元前室责母虐其遗婴，今诉于天，遣阴兵收汝魂魄，衾中之鸟是也。”后母大恸，叩头谢不敢，公亦泣拜良久。巫故作恨恨，乃蹶然苏。自是母性骤改。"]},{"title":"杂智部·京城士人","content":["【原文】","《艺文类聚》：京邑士人妇大妒，尝以长绳系夫脚，唤便牵绳。士密与巫妪谋，因妇眠，士以绳系羊，缘墙走避。妇觉，牵绳而羊至，大惊，召问巫。巫曰：“先人怪娘积恶，故郎君变羊，能悔，可祈请。”妇因抱羊痛哭悔誓，巫乃令七日斋。举家大小悉诣神前祈祝，士徐徐还，妇见，泣曰：“多日作羊，不辛苦耶？”士曰：“犹忆啖草不美，时作腹痛。”妇愈悲哀，后略复妒，士即伏地作羊鸣，妇惊起，永谢不敢。"]}]}