{"name":"颜氏家训","description":"南北朝时期记述个人经历、思想、学识以告诫子孙的著作。编。七卷，共二十篇。颜之推（531年～591以后），字介。颜氏原籍琅邪临沂（今山东临沂北），先世随东晋渡江，寓居建康。侯景之乱，梁元帝萧绎自立于江陵，之推任散骑侍郎。承圣三年（554），西魏破江陵，之推被俘西去。他为回江南，乘黄河水涨，从弘农（今河南三门峡西南）偷渡，经砥柱之险，先逃奔北齐。但南方陈朝代替了梁朝，之推南归之愿未遂，即留居北齐，官至黄门侍郎。577年齐亡入周。隋代周后，又仕于隋。家训一书在隋灭陈（589）以后完成。","articles":[{"title":"序致篇","content":["夫圣贤之书，教人诚孝，慎言检迹，立身扬名，亦已备矣。魏晋已来，所著诸子，理重事复，递相模学，犹屋下架屋、床上施床耳。吾今所以复为此者，非敢轨物范世也，业已整齐门内，提撕子孙。夫同言而信，信其所亲；同命而行，行其所服。禁童子之暴道，则师友之诫，不如傅婢之指挥，止凡人之斗阋，则尧舜之道，不如寡妻之诲谕。吾望此书为汝曹之所信，犹贤于傅婢、寡妻耳。(已 通：以)","吾家风教，素为整密，昔在龆龀，便蒙诱诲。每从两兄，晓夕温清，规行矩步，安辞定色，锵锵翼翼，若朝严君焉。赐以优言，问所好尚，励短引长，莫不恳笃。年始九岁，便丁茶蓼，家涂离散，百口索然。慈兄鞠养，苦辛备至，有仁无威，导示不切。虽读《礼》、《传》，微爱属文，颇为凡人之所陶染。肆欲轻言，不修边幅。年十八九，少知砥砺，习若自然，卒难洗荡。二十已后，大过稀焉。每常心共口敌，性与情竞，夜觉晓非，今悔昨失，自怜无教，以至於斯。追思平昔之指，铭肌镂骨；非徒古书之诫，经目过耳也。故留此二十篇，以为汝曹后车耳。"]},{"title":"教子篇","content":["上智不教而成，下愚虽教无益，中庸之人，不教不知也。古者圣王，有“胎教”之法，怀子三月，出居别宫，目不邪视，耳不妄听，音声滋味，以礼节之。书之玉版，藏诸金匮。生子咳提，师保固明孝仁礼义，导习之矣。凡庶纵不能尔，当及婴稚识人颜色、知人喜怒，便加教诲，使为则为，使止则止，比及数岁，可省笞罚。父母威严而有慈，则子女畏慎而生孝矣。","吾见世间无教而有爱，每不能然，饮食运为，恣其所欲，宜诫翻奖，应呵反笑，至有识知，谓法当尔。骄慢已习，方复制之，捶挞至死而无威，忿怒日隆而增怨，逮于成长，终为败德。孔子云：“少成若天性，习惯如自然。”是也。俗谚曰：“教妇初来，教儿婴孩。”诚哉斯语。","凡人不能教子女者，亦非欲陷其罪恶，但重於呵怒伤其颜色，不忍楚挞惨其肌肤耳。当以疾病为谕，安得不用汤药针艾救之哉？又宜思勤督训者，可愿苛虐於骨肉乎？诚不得已也！","父子之严，不可以狎；骨肉之爱，不可以简。简则慈孝不接，狎则怠慢生焉。","人之爱子，罕亦能均，自古及今，此弊多矣。贤俊者自可赏爱，顽鲁者亦当矜怜。有偏宠者，虽欲以厚之，更所以祸之。齐朝有一士大夫，尝谓吾曰：“我有一儿，年已十七，颇晓书疏，教其鲜卑语及弹琵琶，稍欲通解，以此伏事公卿，无不宠爱，亦要事也。”吾时俯而不答。异哉，此人之教子也！若由此业自致卿相，亦不愿汝曹为之。"]},{"title":"兄弟篇","content":["夫有人民而后有夫妇，有夫妇而后有父子，有父子而后有兄弟，一家之亲，此三而已矣。自兹以往，至於九族，皆本於三亲焉，故於人伦为重者也，不可不笃。","兄弟者，分形连气之人也。方其幼也，父母左提右挈，前襟后裾，食则同案，衣则传服，学则连业，游则共方，虽有悖乱之人，不能不相爱也。及其壮也，各妻其妻，各子其子，虽有笃厚之人，不能不少衰也。娣姒之比兄弟，则疏薄矣。今使疏薄之人，而节量亲厚之恩，犹方底而圆盖，必不合矣。惟友悌深至，不为旁人之所移者免夫！","二亲既殁，兄弟相顾，当如形之与影，声之与响，爱先人之遗体，惜己身之分气，非兄弟何念哉？兄弟之际，异於他人，望深则易怨，地亲则易弭。譬犹居室，一穴则塞之，一隙则涂之，则无颓毁之虑；如雀鼠之不恤，风雨之不防，壁陷楹沦，无可救矣。仆妾之为雀鼠，妻子之为风雨，甚哉！","兄弟不睦，则于侄不爱；子侄不爱，则群从疏薄；群从疏薄，则僮仆为仇敌矣。如此，则行路皆躇其面而蹈其心，谁救之哉？人或交天下之士皆有欢爱而失敬于兄者，何其能多而不能少也；人或将数万之师得其死力而失恩于弟者，何其能疏而不能亲也！","娣姒者，多争之地也。使骨肉居之，亦不若各归四海，感霜露而相思，伫日月之相望也。况以行路之人，处多争之地，能无间者鲜矣。所以然者，以其当公务而执私情，处重责而怀薄义也。若能恕己而行，换子而抚，则此患不生矣。","人之事兄，不可同于事父，何怨爱弟不及爱子乎？是反照而不明也！"]},{"title":"后娶篇","content":["吉甫，贤父也。伯奇，孝子也。以贤 父御孝子，合得终於天性，而后妻之，伯奇遂放。曾参妇死，谓其子曰：“吾 不及吉甫，汝不及伯奇。”王骏丧妻，亦谓人曰：“我不及曾参，子不如华、元。” 并终身不娶。此等足以为诫。其后假继 惨虐孤遗，离间骨肉，伤心断肠者何 可胜数。慎之哉！慎之哉！","江左不讳庶孽，丧室之后，多以 妾媵终家事。疥癣蚊虫，或未能免；限以大分，故稀斗阋之耻。河北鄙於侧出，不预人流，是以必须重娶，至於三四，母年有少於子者。后母之弟与前妇之兄，衣服饮食受及婚宦，至於士庶贵贱之隔，俗以为常。","身没之后，辞讼盈公门，谤辱彰道路，子诬母为妾，弟黜兄为佣，播扬先人之辞迹，暴露祖考之长短，以求直己者，往往而有，悲夫！自古奸臣佞妾，以一言陷人者众矣，况夫妇之义，晓夕移之，婢仆求容，助相说 引，积年累月，安有孝子平？此不可不畏。","凡庸之性，后夫多宠前夫之孤，后妻必虐前妻之子。非唯妇人怀嫉妒之情，丈夫有沉惑之僻，亦事势使之然也。前夫之孤，不敢与我子争家，提携鞠养，积习生爱，故宠之；前妻之子，每居己生之上，宦学婚嫁，莫不为防焉，故虐之。异姓宠则父母被怨，继亲虐则兄弟为仇，家有此者，皆门户之祸也。"]},{"title":"治家篇","content":["夫风化者，自上而行于下者也，自先而施于后者也。是以父不慈则子不孝，兄不友则弟不恭，夫不义则妇不顺矣。父慈而子逆，兄友而弟傲，夫义而妇陵，则天之凶民，乃刑戮之所摄，非训导之所移也。","笞怒废于家，则竖子之过立见；刑罚不中，则民无所措手足。治家之宽猛，亦犹国焉。","孔子曰：“奢则不孙，俭则固。与其不孙也，宁固。”又云：“如有周公之才之美，使骄且吝，其余不足观也已。”然则可俭而不可吝已。俭者，省约为礼之谓也；吝者，穷急不恤之谓也。今有施则奢，俭则吝；如能施而不奢，俭而不吝，可矣。","生民之本，要当稼稽而食，桑麻以衣。蔬果之畜，园场之所产；鸡豚之善，树圈之所生。复及栋宇器械，樵苏脂烛，莫非种殖之物也。至能守其业者，闭门而为生之具以足，但家无盐井耳。令北土风俗，率能躬俭节用，以赡衣食。江南奢侈，多不逮焉。","世间名士，但务宽仁，至于饮食饷馈，僮仆减损，施惠然诺，妻子节量，狎侮宾客，侵耗乡党，此亦为家之巨蠹矣。","裴子野有疏亲故属饥寒不能自济者。皆收养之。家素清贫，时逢水旱，二石米为薄粥，仅得遍焉，躬自同之，常无厌色。邺下有一领军，贪积已甚，家童八百，誓满一千，朝夕每人肴膳，以十五钱为率，遇有客旅，更无以兼。后坐事伏法，籍其家产，麻鞋一屋，弊衣数库，其余财宝，不可胜言。南阳有人，为生奥博，性殊俭吝。冬至后女婿谒之，乃设一铜瓯酒，数脔獐肉，婿恨其单率，一举尽之，主人愕然，俯仰命益，如此者再，退而责其女曰：“某郎好酒，故汝常贫。”及其死后，诸子争财，兄遂杀弟。","妇主中馈，惟事酒食衣服之礼耳，国不可使预政，家不可使干蛊。如有聪明才智，识达古今，正当辅佐君子，助其不足。必无牝鸡晨鸣，以致祸也。","江东妇女，略无交游，其婚姻之家，或十数年间来相识者，惟以信命赠遗，致殷勤焉。邺下风俗，专以妇持门户，争讼曲直，造请逢迎，车乘填街衢，绮罗盈府寺，代子求官，为夫诉屈，此乃恒代之遗风平？南间贫素，皆事外饰，车乘衣服，必贵整齐，家人妻子，不免饥寒。河北人事，多由内政，绮罗金翠，不可废阙，羸马悴奴，仅充而已，倡和之礼，或尔汝之。","河北妇人，织任组训之事，黼黻 锦绣罗绮之工，大优于江东也。","太公曰：“养女太多，一费也。” 陈蕃曰：“盗不过五女之门。”女之为累，亦以深矣。然天生蕃民，先人传体，其如之何？世人多不举女，贼行骨肉，岂当如此而望福于天乎？吾有疏亲，家饶妓媵，诞育将及，便遣阍竖守之，体有不安，窥窗倚户，若生女者，辄持将去，母随号泣，使人不忍闻也。","妇人之性，率宠子婿而虐儿妇，宠婿则兄弟之怨生焉，虐妇则姊妹之谗行焉。然则女之行留，皆得罪于其家者，母实为之。至有谚曰：“落索阿姑餐。”此其相报也。家之常弊，可不诫哉！","婚姻素对，靖候成规。近世嫁娶，遂有卖女纳财，买妇输绢，比量父祖，计较锱铢，责多还少，市井无异。或猥婿在门，或傲妇擅室，贪荣求利，反招羞耻，可不慎欤？","借人典籍，皆须爱护，先有缺坏，就为科治，此亦士大夫百行之一也。济阳江禄，读书未竟，虽有急速，必待卷束整齐，然后得起，故无损败，人不厌其求假焉。或有狼藉几案，分散部帙，多为童幼婢妾之所点污。风雨虫鼠之所毁伤，实为累德。吾每读圣人之书，未尝不肃敬对之。其故纸有《五经》词义及贤达姓名，不敢秽用也。","吾家巫觋祷请，绝于言议；符书章酸，亦无祈焉。并汝曹所见也，勿为妖妄之费。"]},{"title":"风操篇","content":["《礼》曰：“见似目瞿，闻名心瞿。”有所感触，侧怆心眼，若在从容平常之地，幸须申其情耳。必不可避，亦当忍之，犹如伯叔、兄弟，酷类先人，可得终身肠断与之绝耶？又“临文不讳，庙中不讳，君所无私讳”。盖知闻名须有消息，不必期於颠沛而走也。梁世谢举”，甚有声誉，闻讳必哭，为世所讥。又有臧逢世，臧严之子也，笃学修行，不坠门风，孝元经牧江州，遣往建昌督事，郡县民庶，竞修笺书，朝夕辐辏，几案盈积，书有称“严寒”者，必对之流涕，不省取记，多废公事，物情怨骇’，竟以不办而还。此并过事也。","近在扬都，有一士人讳审，而与沉氏交给周厚，沉与其书，名而不姓，此非人情也。","昔候霸之子孙，称其祖父曰家公；陈思王称其父为家父，母为家母；潘尼 称其祖曰家祖：古人之所行，令人之所笑也。今南北风俗，言其祖及二亲，无云人言，言已世父“，以次第称之，不云“家”者，以尊于父，不敢“家”也。凡言姑、姊妹、女子子，已嫁则以夫氏称之，在室则以次第称之，言礼成他族，不得云“家”也。子孙不得称“家”者，轻略之也。蔡邕书集呼其姑、姊为家姑、家姊，班固书集亦云家孙，今并不行也。","凡与人言，称彼祖父母、世父母；父母及长姑，皆加“尊”字，自叔父母已下，则加“贤”子，尊卑之差也。王羲之书，称彼之母与自称己母同，不云“尊”字，今所非也。","昔者，王侯自称孤、寡、不谷。自兹以降，虽孔子圣师，及闸人言皆称名也。后虽有臣、仆之称，行者盖亦寡焉。江南轻重，各有谓号，具诸《书仪》。北人多称名者，乃古之遗风。吾善其称名焉。","古人皆呼伯父、叔父，而今世多单呼伯、叔。从父兄弟姊妹已孤，而对其前呼其母为伯叔母，此未可避者也。兄弟之子已孤，与他人言，对孤者前呼为兄子。弟子，颇为不忍，北土人多呼为佳。案《尔雅》、《丧服经》、《左传》，侄虽名通男女，并是对姑之称，晋世以来，始呼叔侄。今呼为侄，于理为胜也。","古者，名以正体，字以表德，名终则讳之，字乃可以为孙氏。孔子弟子记事者，皆称仲尼；吕后微时，尝字高祖为季；至汉麦种，字其叔父曰丝；王丹与侯霸子语，字霸为君房。江南至今不讳字也。河北人士全不辨之，名亦呼为字，字固呼为字。尚书王元景兄弟，皆号名人，其父名云，字罗汉，一皆讳之，其馀不足怪也。","偏傍之书，死有归杀，子孙逃窜，莫肯在家；画瓦书符，作诸厌胜；丧出之日，门前然火，户外列灰，祓送家鬼，章断注连。凡如此比，不近有情，乃儒雅之罪人，弹议所当加也。","《礼经》：“父之遗书，母之杯圈，感其手口之泽，不忍读用。”政为常所讲习，讎校缮写，及偏如服用，有迹可思者耳。若寻常坟典，为生什物，安可悉废之乎？既不读用，无容散逸，惟当缄保，以留后世耳。","江南风俗，儿生一期，为制新衣，盥浴装饰，男则用弓矢纸笔，女则刀尺针缕，并加饮食之物，及珍宝服玩，置之儿前，观其发意所取，以验贪廉愚智，名之为试儿。亲表聚集，致宴享焉。……","四海之人，结为兄弟，亦何容易，必有志均义敌，令终如始者，方可议之。一尔之后，命子拜伏，呼为丈人，申父交之敬，身事彼亲，亦宜加礼。比见北人甚轻此节，行路相逢，便定昆季，望年观貌，不择是非，至有结父为兄、托子为弟者。"]},{"title":"慕贤篇","content":["古人云：“千载一圣，犹旦暮也；五百年一贤，犹比膊也。”言圣贤之难得疏阔如此。傥遭不世明达君子，安可不攀附景仰之乎！吾生於乱世，长於戎马，流离播越，闻见已多，所值名贤，未尝不心醉魂迷向慕之也。人在年少，神情未定，所与款狎，熏渍陶染，言笑举动，无心於学，潜移暗化，自然似之，何况操履艺能，较明易习者也！是以与善人居，如入芝兰之室，久而自芳也；与恶人居，如入鲍鱼之肆，久而自臭也。墨子悲於染丝，是之谓矣，君子必慎交游焉。孔子曰：“无友不如己者。”颜、闵之徒，何可世得，但优於我，便足贵之。","世人多蔽，贵耳贱目，重遥轻近。少长周旋，如有贤哲，每相狎侮，不加礼敬；他乡异县，微借风声，延颈企踵，甚於饥渴。校其长短，核其精粗，或 彼不能如此矣，所以鲁人谓孔子为东家丘。昔虞国宫之奇少长於君，君狎之， 不纳其谏，以至亡国，不可不留心也！","梁孝元前在荆州，有丁觇者，洪亭民耳，颇善属文，殊工草、隶，孝元书记，一皆使之。军府轻贱，多未之重，耻令子弟以为楷法。时云：“丁君十纸，不敌王褒数位。”吾雅爱其手迹，常所宝持。孝元尝遣典签惠编送文章示萧祭酒，祭酒问云：“君王比赐书翰，及写诗笔，殊为传手，姓名为谁，那得都无声问？”编以实答，子云叹曰：“此人后生无比，遂不为世所称，亦是奇事！”於是闻者稍复刮目，稍仕至尚仪曹郎。末为晋安王侍读，随王东下。及西台陷殁，简犊湮散，丁亦寻卒於扬州。前所轻者，后思一纸不可得矣。","侯景初入建业，台门虽闭，公私草扰，各不自全。太子左卫率羊侃坐东掖门，部分经略，一宿皆办，遂得百馀日抗拒凶逆。於是城内四万许人，王公朝士，不下一百，便是恃侃一人安之，其相去如此。","齐文宣帝即位数年，便沉湎纵恣，略无纲纪。尚能委政尚书令杨遵彦，内外清谧，朝野晏如，各得其所，物无异议，终天保之朝。遵彦后为孝昭所戮，刑政於是衰矣。斛律明月，齐朝折冲之臣，无罪被诛，将士解体，周人始有吞齐之志，关中至今之。此人用兵，岂止万夫之望而已哉，国之存亡，系其生死。"]},{"title":"勉学篇","content":["自古明王圣帝，犹须勤学，况凡庶乎！此事遍于经史，吾亦不能郑重，聊举近世切要，以启寤汝耳。士大夫之弟，数岁已上，莫不被教，多者或至《礼》、《传》，少者不失《诗》、《论》。及至冠婚，体性梢定，因此天机，倍须训诱。有志向者，遂能磨砺，以就素业；无履立者，自兹堕慢，便为凡人。人生在世，会当有业，农民则计量耕稼，商贾别讨论货贿，工巧则致精器用，伎艺则沉思法术，武夫则惯习弓马，文士则讲议经书。多见士大夫耻涉农商，羞务工伎，射则不能穿札，笔则才记姓名，饱食醉酒，忽忽无事，以此销日，以此终年。或因家世馀绪，得一阶半级，便自为足，全忘修学，及有吉凶大事，议论得失，蒙然张口，如坐云雾，公私宴集，谈古赋诗，塞默低头，欠伸而已。有识旁观，代其入地。何惜数年勤学，长受一生愧辱哉！","梁朝全盛之时，贵游子弟，多无学术，至於谚曰：“上车不落则著作，体中何如则秘书。”无不熏衣剃面，傅粉施朱，驾长檐车，跟高齿履，坐棋子方褥，凭斑丝隐囊，列器玩于左右，从容出入，望若神仙，明经求第，则顾人答策，三九公宴，则假手赋诗，当尔之时，亦快士也。及离乱之后，朝市 迁革，铨衡选举，非复曩者之亲，当路秉权，不见昔时之党，求诸身而无所得，施之世而无所用，被揭而丧珠，失皮而露质，兀若枯木，泊若穷流，鹿独戎马之间，转死沟壑之际，当尔之时，诚驽材也。有学艺者，触地而安。自荒乱以来，诸见俘虏，虽百世小人，知读《论语》、《孝经》者，尚为人师；虽千载冠冕，不晓书记者，莫不耕田养马，以此现之，安可不自勉耶？若能常保数百卷书，千载终不为小人也。","有客难主人曰：“吾见强弩长戟，诛罪安民，以取公侯者有吴；文义习吏，匡时富国，以取卿相者有吴；学备古今，才兼文武，身无禄位，妻子饥寒者，不可胜数，安足贵学乎？”主人对曰：“夫命之穷达，犹金玉木石也；修以学艺，犹磨莹雕刻也。金玉之磨莹，自美其矿璞；木石之段块，自丑其雕刻。安可言木石之雕刻，乃胜金玉之矿璞哉？不得以有学之贫贱，比於无学之富贵也。且负甲为兵，咋笔为吏，身死名灭者如牛毛，角立杰出者如芝草；握素披黄，吟道咏德，苦辛无益者如日蚀，逸乐名利者如秋茶，岂得同年而语矣。且又闻之：生而知之者上，学而知之者次。所以学者，欲其多知明达耳。必有天才，拔群出类，为将则暗与孙武、吴起同术，执政则悬得管仲、子产之教，虽未读书，吾亦谓之学矣。今子即不能然，不师古之踪迹，犹蒙被而卧耳。”","人见邻里亲戚有佳快者，使子弟慕而学之，不知使学古人，何其蔽也哉？世人但知跨马被甲，长槊强弓，便云我能为将；不知明乎天道，辩乎地利，比量逆顺，鉴达兴亡之妙也。但知承上接下，积财聚谷，使云我能为相；不知敬鬼事神，移风易俗，调节阴阳，荐举贤圣之至也。但知私财不入，公事夙办，便云我能治民；不知诚己刑物，执辔如组，反风灭火，化鸱为风之术也。但知抱令守律，早刑晚舍，便云我能平狱；不知同辕观罪，分剑追财，假言而好露，不问而情得之察也。表及农商工贾，廝役奴隶，钓鱼屠肉，饭牛牧羊，皆有先达，可为师表，博学求之，无不利於事也。","夫所以读书学问，本欲开心明目，利於行耳。未知养亲者，欲其观古人之先意承颜，怕声下气，不惮的劳，以致甘膜，惕然惭惧，起而行之也。未知事君者，欲其观古人之守职无侵，见危授命，不忘城谏，以利社稷，恻然自念，思欲效之也。素骄奢者，欲其观古人之恭俭节用，卑以自牧，礼为教本，敬老身基，翟然自失，敛容抑志也。素鄙吝者，欲其观古人之贵义轻财，少私寡欲，忌盈恶满，周穷恤匮，赧然悔耻，积而能散也。素暴悍者，欲其观古人之小黜己，齿弊舌存，含垢藏疾，尊贤容众，茶然沮丧，若不胜衣也。素怯懦者，欲其观古人之达生委命，强毅正直，立言必信，求福不回，勃然奋厉，不可恐慑也。历兹以往，百行皆然，纵不能淳，去泰去甚…，学之所知，施无不达。世人读书者，但能言之，不能行之，忠孝无闻，仁义不足，加以断一条讼，不必得其理，宰千户县，不必理其民，问其造屋，不必知楣横而悦竖也，问其为田，不必知稷早而黍迟也，吟啸谈谑，讽咏辞赋，事既优闲，材增迂诞，军国经纶，略无施用，故为武人俗吏所共嗤诋，良由是乎？","人生小幼，精神专利，长成已后，思虑散逸，固须早教，勿失机也。吾七岁时，诵《灵光殿赋》，至於今日，十年一理，犹不遗忘。二十以外，所诵经书，一月废置，便至荒芜矣。然人有坎禀，失于盛年，犹当晚学，不可自弃。孔子 曰：“五十以学《易》，可以无大过矣。”魏武、袁遗，老而弥笃；此皆少学而至老不倦也。曾子十七乃学，名闻天下；荀卿五十始来游学，犹为硕儒；公孙弘四十余方读《春秋》，以此遂登丞相；朱云亦四十始学《易》、《论语》，皇甫谧二十始受《孝经》、《论语》，皆终成大儒：此并早迷而晚寤也。世人婚冠未学，便称迟暮，因循面墙，亦为愚耳。幼而学者，如日出之光；老而学者，如秉独夜行，犹贤乎瞑目而无见者也。","学之兴废，随世轻重。汉时贤俊，皆以一经弘圣人之道，上明天时，下该 人事，用此致卿相者多矣。末俗已来不复尔，空守章句，但诵师言，施之世务，殆无一可。故士大夫子弟，皆以博涉为贵，不肯专儒。梁朝皇孙以下，总之年 ，必先入学，观其志尚，出身己后，便从文吏，略无卒业者。冠冕，而为上者，则有何胤、刘献、明山宾、周舍、朱异、周弘正、贺琛、贺革、萧子政、刘绥等，兼通文史，不徒讲说也。洛阳亦闻崔浩、张伟、刘芳，邺下又见邢子才：此四儒者，虽好经术，亦以才博擅名。如此诸贤，故为上品。以外率多田野间人，音辞鄙陋，风操蚩拙，相与专固，无所堪能。问一言辄酬数百，责其指归，或无要会。那下谚云：“博士买驴，书卷三纸，未有‘驴’字。”使汝以此为师，令人气塞。孔子曰：“学也，禄在其中矣。”今勤无益之事，恐非业也。夫圣人之书，所以设教，但明练经文，粗通注义，常使言行有得，亦足为人；何必“仲尼居”即须两纸疏义，燕寝、讲堂，亦复何在？以此得胜，宁有益乎？光阴可惜，譬诸逝水。当博览机要，以济功业，必能兼美，吾无间焉。","俗间儒士，不涉群书，经纬之外，义疏而已。吾初八邺，与博陵崔文彦交游，尝说《王粲集》中难郑玄《尚书》事，崔转为诸儒道之。始将发口，悬见排蹙，云：“文集只有诗赋、铭、诔，岂当论经书事乎？且先儒之中，未闻有王粲也。”崔笑而退，竟不以《粲集》示之。魏收之在议曹，与诸博士议宗庙事，引据《汉似》，博士笑曰：“未闻《汉书》得证经术。”收便忿怒，都不复言，取《韦玄成传》，掷之而起。博士一夜共披寻之，达明，乃来谢曰：“不谓玄成如此学也。”","邺平之后，见徒入关。思鲁尝谓吾曰：“朝无禄位，家无积财，当肆筋力，以申供养。每被课笃，勤劳经史，未知为子，可得安乎？”吾命之曰：“子当以养为心，父当以学为教。使汝弃学徇财，丰吾衣食，食之安得甘？衣之安得暖？若务先王之道，绍家世之业，藜羹褐，我自欲之。”","校订书籍，亦何容易，自扬雄、刘向，方称此职耳。观天下书未遍，不得妄下雌黄。或彼以为非，此以为是，或本同末异，或两文皆欠，不可偏信一隅也。"]},{"title":"文章篇","content":["阮籍无礼败俗，稽康凌物凶终，傅玄念斗免官，孙楚矜夸凌上，陆机犯顺履险，潘岳干没取危，颜延年负气摧黜，谢灵运空疏乱纪，王元长凶贼自诒，谢玄晖侮慢见及。凡此诸人，皆其翘秀者，不能悉记，大较如此。至於帝王，亦或未免。自昔天子而有才华者，唯汉武、魏太祖、文帝、明帝、宋孝武帝，皆负世议，非懿德之君也。自子游、子夏、荀况、孟轲、枚乘、贾谊、苏武、张衡、左思之传，有盛名而免过患者，时复闻之，但其损败居多耳。每尝思之，原其所积，文章之体，标举兴会，发引性灵，使人矜伐，故忽於持操，果於进取。今世文士，此患弥切，一事惬当，一句清巧，神厉九霄，志凌千载，自吟自赏，不觉更有傍人。加以砂砾所伤，惨於矛戟，讽刺之祸，速乎风尘。深宜防虑，以保元吉。","学问有利钝，文章有巧拙。钝学累功，不妨精熟；拙文研思，终归蚩鄙。但成学士，自足为人；必乏天才，勿强操笔。吾见世人，至无才思，自谓清华，流布丑拙，亦以众矣，江南号为“许痴符”。近在并州，有一士族，好为可笑诗赋，铫弊邢、魏诸公，众共嘲弄，虚相赞说，便击牛釃酒，招延声誉。其妻明鉴妇人也，泣而谏之，此人叹曰：“才华不为妻子所容，何况行路！”至死不觉。自见之谓明，此诚难也。","学为文章，先谋亲友，得其评裁，知可施行，然后出手，慎勿师心自任，取笑旁人也。自古执笔为文者，何可胜言。然至於宏丽精华，不过数十篇耳。但使不失体裁，辞意可观，便称才士。要须动俗盖世，亦俟河之清乎。","凡为文章，犹人乘骐骥，虽有逸气，当以街勒制之，勿使流乱轨躅，放意填坑岸也。","文章当以理致为心旅，气调为筋骨，事义为皮肤，华而为冠冕。今世相承，趋末弃本，率多浮艳，辞与理竞，辞胜而理伏；事与才争，事繁而才损，放逸者流宕而忘归，穿凿者补缀而不足。","时俗如此，安能独违，但务去泰去甚耳。必有盛才重誉，改革体裁者，实吾所希。","古人之文，宏才逸气，体度风格，去今实远；但缉缀疏朴，未为密致耳。今世音律谐靡，章句偶对，讳避精详，贤於往昔多矣。宜以古之制裁为本，今之辞调为末，并须两存，不可偏弃也。"]},{"title":"名实篇","content":["名之与实，犹形之与影也。德艺周厚，则名必善焉；容色姝丽，则影必美焉。今不修身而求个名于世者，犹貌甚恶而责妍影于镜也。上士忘名，中士立名，下士窃名。忘名者，体道合德，享鬼神之福祜，非所以求名也；立名者，修身慎行，惧荣观之不显，非所以让名也；窃名者，厚貌深奸，於浮华之虚称，非所以得名也。","吾见世人，清名登而金贝入，信誉显而然诺亏，不知后之矛戟，毁前之干橹也！虑子贱云：“诚于此者形於彼。”人之虚实真伪在乎心，无不见平迹，但察之未熟耳。一为察之所鉴，巧伪不如拙诚，承之以羞大矣。伯石让卿，王莽辞政，当于尔时，自以巧密，后人书之，留传万代，可为骨寒毛竖也。近有大贵，以孝著声，前后居丧，哀毁逾制，亦足以高於人矣；而尝於苫块之中，以巴豆涂脸，遂使成疮，表哭泣之过，左右童竖，不能掩之，益使外人谓其居处饮食皆为不信。以一伪丧百诚者，乃贪名不已故也！","有一士族，读书不过二三百卷，天才钝拙，而家世殷厚，雅自矜持，多以酒犊珍玩，交诸名士。甘其饵者，递共吹嘘，朝廷以为文华，亦尝出境聘。东莱王韩晋明笃好文学，疑彼制作，多非机杼，遂设宴言，面相讨试。竟日欢谐，辞人满席，属音赋韵，命笔为诗，彼造次即成，了非向韵，众客各自沉吟，遂无觉者。韩退叹曰：“果如所量。”","治点子弟文章，以为声价，大弊事也。一则不可常继，终露其情；二则学者有凭，益不精励。","邺下有一少年，出为襄国今，颇自勉笃，公事经怀，每加抚恤，以求声誉。凡遣兵役，握手送离，或齎梨枣饼饵，人人赠别，云：“上命相烦，情所不忍，道路饥渴，以此见思。”民庶称之，不容於口。及迁为泗州别驾，此费日广，不可常周。一有伪情，触涂难继，功绩遂损败矣。"]},{"title":"涉务篇","content":["士君子之处世，贵能有益於物耳，不徒高谈虚论，左琴右书，以费人君禄位也！国之用材，大较不过六事：一则朝廷之臣，取其鉴达治体，经纶博雅；二则文史之臣，取其著述宪章，不忘前古；三则军旅之臣，取其断决有谋，强干习事；四则藩屏之臣，取其明练风俗，清白爱民；五则使命之臣，取其识变从宜，不辱君命；六则兴造之臣，取其程功节费，开略有术：此则皆勤学守行者所能办也。人性有长短，岂责具美于六涂哉？但当皆晓指趣，能守一职，便无愧耳。","吾见世中文学之士，品藻古今，若指诸掌，及有试用，多无所堪。居承平之世，不知有丧乱之祸；处庙堂之下，不知有战陈之急；保俸禄之资，不知有耕稼之苦；肆吏民之上，不知有劳役之勤：故难可以应世经务也。晋朝南渡，优借士族，故江南冠带有才干者，擢为令仆已下尚书郎、中书舍人已上，典掌机要。其馀文义之士。多迂诞浮华，不涉世务，纤微过失，又惜行捶楚，所以处於清高，盖护其短也。至於台阁今史，主书监帅，诸王签省，并晓习吏用，济办时须，纵有小人之态，皆可鞭枚肃督，故多见委使，盖用其长也。人每不自量，举世怨梁武帝父子爱小人而疏士大夫，此亦眼不能见其睫耳。","梁世士大夫，皆尚褒衣博带，大冠高履，出则车舆，入则扶持，郊郭之内，无乘马者。周弘正为宣城王所爱，给一果下马，常服御之，举朝以为放达。至乃尚书郎乘马，则纠劾之。及侯景之乱，肤脆骨柔，不堪行步，体赢气弱，不耐寒暑，坐死仓猝者，往往而然。建康今王复，性既儒雅，未尝乘骑，见马嘶贲陆梁。莫不震慑，乃谓人曰：“正是虎，何故名为马乎？”其风俗至此。","古人欲知稼穑之艰难，斯盖贵谷务本之道也。夫食为民天，民非食不生矣，三日不粒，父子不能相存。耕种之，休组之，对获之，载积之，打拂之，簸扬之，凡几涉手，而入仓廪，安可轻农事而贵末业哉？江南朝士，因晋中兴，南渡江，卒为羁旅，至今八九世，未有力田，悉资俸禄而食耳。假令有者，皆信僮仆为之，未尝目观起一拨土，耕一株苗；不知几月当下，几月当收，安识世间馀务乎？故治官则不了，营家则不办，皆优闲之过也。"]},{"title":"省事篇","content":["铭金人云：“无多言，多言多败；无多事，多事多患。”至哉斯戒也！能走者夺其翼，善飞者减其指，有角者无上齿，丰后者无前足，盖天道不使物有兼焉也。古人云：“多为少善，不如执一；鼷鼠五能，不成伎术。”近世有两人，朗悟士也，性多营综，略无成名，经不足以待问，史不足以讨论，文章无可传於集录，书迹未堪以留爱玩，卜筮射六得三，医药治十差五，音乐在数十人下，弓矢在千百人中，天文、画绘、棋博、鲜卑语、胡书、煎胡桃油、炼锡为银，如此之类，略得梗概，皆不通熟。惜乎！以彼神明，若省其异端，当精妙也。"]},{"title":"止足篇","content":["《礼》云：“欲不可纵，志不可满。”宇宙可臻其极，情性不知其穷，唯在少欲知止，为立涯限尔。先祖靖侯戒子侄曰：“汝家书生门户，世无富贵，自今仕宦不可过二千石，婚姻勿贪势家。”吾终身服膺，以为名言也。","天地鬼神之道，皆恶满盈，谦虚冲损，可以免害。人生衣趣以覆寒露，食趣以塞饥乏耳。形骸之内，尚不得奢靡，己身之外，而欲穷骄泰邪？周穆王、秦始皇、汉武帝富有四海，贵为天子，不知纪极，犹自败累，况士庶乎？常以二十口家，奴婢盛多不可出二十人，良田十顷，堂室才蔽风雨，车马仅代杖策，蓄财数万，以拟吉凶急速。不啻此者，以义散之；不至此者，勿非道求之。"]},{"title":"诫兵篇","content":["颜氏之先，本乎邹、鲁，或分入齐，世以儒雅为业，遍在书记。仲尼门徒，升堂者七十有二，颜氏居八人焉。秦汉魏晋，下逮齐梁，未有用兵以取达者。春秋世颜高、颜鸣、颜息、颜羽之徒，皆一斗夫耳。齐有颜涿聚，赵有颜最，汉末有颜良，宋有颜延之，并处将军之任，竟以颠覆。汉郎颜驷，自称好武，更无事迹。颜忠以党楚王受诛，颜俊以据武威见杀，得姓已来，无清操者，唯此二人，皆罹祸败。顷世乱离，衣冠之士，虽无身手，或聚徒众，违弃素业，侥幸战功。吾既赢薄，你惟前代，故置心於此，子孙志之。孔子力翘门关，不以力闻，此圣证也。吾见今世士大夫，才有气干，便倚赖之，不能被甲执兵，以卫社稷，但微行险服，逞弄拳腕，大则陷危亡，小则贻耻辱，遂无免者。","国之兴亡，兵之胜败，博学所至，幸讨论之。入帷幄之中，参庙堂之上，不能为主尽规以谋社稷，君子所耻也。然而每见文士，颇读兵书，微有经略。若居承平之世，脾睨宫阃，幸灾乐祸，首为逆乱，诖误善良；如在兵革之时，构扇反覆，纵横说诱，不识存亡，强相扶戴：此皆陷身灭族之本也。诫之哉！诫之哉！","习五兵，便乘骑，正可称武夫尔。今世士大夫，但不读书，即称武夫儿，乃饭囊酒瓮也。"]},{"title":"养生篇","content":["神仙之事，未可全诬；但性命在天，或难钟值。人生居世，触途牵絷；幼少之日，既有供养之勤；成立之年，便增妻孥之累。衣食资须，公私驱役；而望遁迹山林，超然尘滓，千万不遇一尔。加以金玉之费，炉器所须，益非贫士所办。学如牛毛，成如麟角。华山之下，白骨如莽，何有可遂之理？考之内教，纵使得仙，终当有死，不能出世，不愿汝曹专精於此。若其爱养神明，调护气息，慎节起卧，均适寒暄，禁忌食饮，将饵药物，遂其所禀，不为夭折者，吾无间然”。诸药饵法，不废世务也。庚肩吾常服槐实，年七十馀，目看细字，须发犹黑。邺中朝士，有单服杏仁、枸杞、黄精、白术、车前得益者甚多，不能—一说尔。吾尝患齿，摇动欲落，饮食热冷，皆苦疼痛。见《抱朴子》牢齿之法，早朝叩齿三百下为良；行之数日，即便平愈，今恒持之。此辈小术，无损於事，亦可修也。凡欲饵药，陶隐居《太清方》中总录甚备，但须精审，不可轻脱。近有王爱州在邺学服松脂不得节度，肠塞而死，为药所误者其多。","夫养生者先须虑祸，全身保性，有此生然后养之，勿徒养其无生也。单豹养於内而丧外，张毅养於外而丧内，前贤所戒也。稽康著《养身》之论，而以傲物受刑，石崇冀服饵之征，而以贪溺取祸，往事之所迷也。","夫生不可不惜，不可苟惜。涉险畏之途，干祸难之事，贪欲以伤生，谗慝而致死，此君子之所惜哉！行诚孝而见贼，履仁义而得罪，丧身以全家，泯躯而济国，君子不咎也。自乱离已来，吾见名臣贤士，临难求生，终为不救，徒取窘辱，令人愤懑。"]},{"title":"归心篇","content":["内外两教，本为一体，渐积为异，深浅不同。内典初门，设五种禁，外典仁、义、礼、智、信，皆与之符。仁者，不杀之禁也；义者，不盗之禁也；礼者，不邪之禁也；智者，不酒之禁也；信者，不妄之禁也。至如畋狩军旅，燕享刑罚，因民之性，不可卒除，就为之节，使不淫滥尔。归周、孔而背释宗，何其迷也！","释三曰：“开辟已来，不善人多而善人少，何由悉责其精洁乎？见有名僧向行，异而不说；若睹凡僧流俗，便生非毁。且学者之不勤，岂教者之为过？俗僧之学经律，何异世人之学《诗》、《礼》？以《诗》、《礼》之教，格朝廷之人，略无全行者；以经律之禁，格出家之辈，而独责无犯哉？且阙行之臣，犹求禄位；毁禁之侣，何惭供养乎？其於戒行，自当有犯。一披法服，已堕僧数，岁中所计，斋讲诵持．比诸白衣，犹不啻山海也。","形体虽死，精神犹存。人生在世，望於后身似不相属；及其殁后，则与前身似犹老少朝夕耳。世有魂神，示现梦想，或降童妾，或感妻孥，求索饮食，征须福祜，亦为不少矣。今人贫贱疾苦，莫不怨尤前世不修功业。以此而论，安可不为之作地乎？夫有子孙，自是天地间一苍生耳，何预身事，而乃爱护，遗其基址。况於已之神爽，顿欲弃之哉？凡夫蒙蔽，不见未来，故言彼生与今非一体耳……","世有痴人，不识仁义，不知富贵并由天命。为子娶妇，恨其生资不足，倚作舅始之尊，蛇虺其性，毒口加诬，不识忌讳，骂辱妇之父母，却成教妇不孝己身，不顾他恨。但怜已之子女，不爱己之儿妇。如此之人，阴纪其过，鬼夺其算。慎不可与为邻，何况交结乎？避之哉！"]},{"title":"书证篇","content":["太公《六韬》，有天陈、地陈、人陈、云鸟之陈。《论语》曰：“卫灵公问陈於孔子。”《左传》：“为鱼丽之陈。”俗本多作“阜”旁车乘之“车”。案诸陈队，并作陈、郑之“陈”。夫行陈之义，取於陈列耳，此“六书”为假借也。《苍》、《雅》及近世字书，皆无别字，唯王羲之《小学章》独“阜”旁作“车”。纵复俗行，不宜追改《六韬》、《论语》、《左传》也。","“也”是语已及助句之辞，文籍备有之矣。河北经传，悉略此字。其间字有不可得无者。至如“伯也执殳”，“於旅也语”，“回也屡空”心，“风，风也，教也”，及《诗传》云“不戢，我也；不傩，傩也”，“不多，多也”如斯之类，傥削此文，颇成废阙。《诗》言：“青青子衿”，《传》曰：“青衿，青领也，学子之服。”按古者斜领下连於衿，故谓领为衿，孙炎、郭璞注《尔雅》，曹大家注《列女传》，并云：“衿，交领也。”邺下《诗》本既无“也”字，群儒固谬说云：“青衿、青领，是衣两处之名，皆以青为饰。”用释“青青”二字，其失大矣。又有俗学，闻经、传中时须“也”字，辄以意加之，每不得所，益成可笑。","《后汉书》：“酷吏樊晔为天水太守，凉州为之歌曰：‘宁见乳虎穴，不入冀府寺，”而江南书本“穴”皆误作“六”，学士因循，迷而不寐。夫虎豹穴居，事之较者，所以班超云：“不探虎穴，安得虎子？”宁当论其六七耶？","客有难主人曰：“今之经典，子皆谓非，《说文》所言，子皆云是，然则许慎胜孔子乎？”主人拊掌大笑，应之曰：“今之经典，皆孔子手迹耶？”客曰：“今之《说文》，皆许慎手迹乎？”答曰：“许慎检以六文，贯以部分，使不得误，误则觉之。孔子存其义而不论其文也。先儒尚得改文从意，何况书写流传邓？必如《左传》止戈为武，反正为乏，虫为蛊，亥有二首六身之类，后人自不得辄改也，安敢以《说文》校其是非哉？且馀亦不专以《说文》为是也，其有援引经传，与今乖者，未之敢从。又相如《封禅书》曰：‘导一茎六穗于扈，牺双解共抵之兽，此导训择，光武诏云：‘非徒有豫养导择之劳，是也。而《说文》云：‘道是禾名。’引《封禅书》为证；无妨自当有禾名道，非相如所用也。‘禾一茎六穗于扈，’岂成文乎？纵使相如天才鄙拙，强为此语，则下句当云‘麟双角共抵之兽，’不得云牺也。吾尝笑许纯儒，不达文章之体，如此之流，不足凭信，大抵服其为书，隐括有条例，剖析穷根源，郑玄注书，往往引以为证；若不信其说，则冥冥不知一点一画，有何意焉。”"]},{"title":"音辞篇","content":["夫九州之人，言语不同，生民已来，固常然矣。自春秋标齐言之传，离骚目楚词之经，此盖其较明之初也。后有扬雄着方言，其言大备。然皆考名物之同异，不显声读之是非也。逮郑玄注六经，高诱解吕览、淮南，许慎造说文，刘熹制释名，始有譬况假借以证音字耳。而古语与今殊别，其间轻重清浊，犹未可晓；加以内言外言、急言徐言、读若之类，益使人疑。孙叔言创尔雅音义，是汉末人独知反语。至于魏世，此事大行。高贵乡公不解反语，以为怪异。自兹厥后，音韵锋出，各有土风，递相非笑，指马之谕，未知孰是。共以帝王都邑，参校方俗，考核古今，为之折衷。搉而量之，独金陵与洛下耳。南方水土和柔，其音清举而切诣，失在浮浅，其辞多鄙俗。北方山川深厚，其音沈浊而(金化)钝，得其质直，其辞多古语。然冠冕君子，南方为优；闾里小人，北方为愈。易服而与之谈，南方士庶，数言可辩；隔垣而听其语，北方朝野，终日难分。而南染吴、越，北杂夷虏，皆有深弊，不可具论。其谬失轻微者，则南人以钱为涎，以石为射，以贱为羡，以是为舐；北人以庶为戍，以如为儒，以紫为姊，以洽为狎。如此之例，两失甚多。至邺已来，唯见崔子约、崔瞻叔侄，李祖仁、李蔚兄弟，颇事言词，少为切正。李季节着音韵决疑，时有错失；阳休之造切韵，殊为疏野。吾家儿女，虽在孩稚，便渐督正之；一言讹替，以为己罪矣。云为品物，未考书记者，不敢辄名，汝曹所知也。","古今言语，时俗不同；著述之人，楚、夏各异。苍颉训诂，反稗为逋卖，反娃为于乖；战国策音刎为免，穆天子传音谏为间；说文音戛为棘，读皿为猛；字林音看为口甘反，音伸为辛；韵集以成、仍、宏、登合成两韵，为、奇、益、石分作四章；李登声类以系音羿，刘昌宗周官音读乘若承；此例甚广，必须考校。前世反语，又多不切，徐仙民毛诗音反骤为在遘，左传音切椽为徒缘，不可依信，亦为众矣。今之学士，语亦不正；古独何人，必应随其伪僻乎？通俗文曰：“入室求曰搜。”反为兄侯。然则兄当音所荣反。今北俗通行此音，亦古语之不可用者。玙璠，鲁人宝玉，当音余烦，江南皆音藩屏之藩。岐山当音为奇，江南皆呼为神只之只。江陵陷没，此音被于关中，不知二者何所承案。以吾浅学，未之前闻也。","北人之音，多以举、莒为矩；唯李季节云：“齐桓公与管仲于台上谋伐莒，东郭牙望见桓公口开而不闭，故知所言者莒也。然则莒、矩必不同呼。”此为知音矣。","夫物体自有精麤，精麤谓之好恶；人心有所去取，去取谓之好恶。此音见于葛洪、徐邈。而河北学士读尚书云好生恶杀。是为一论物体，一就人情，殊不通矣。","甫者，男子之美称，古书多假借为父子；北人遂无一人呼为甫者，亦所未喻。唯管仲、范增之号，须依字读耳。","案：诸字书，焉者鸟名，或云语词，皆音于愆反。自葛洪要用字苑分焉字音训：若训何训安，当音于愆反，“于焉逍遥”，“于焉嘉客”，“焉用佞”，“焉得仁”之类是也；若送句及助词，当音矣愆反，“故称龙焉”，“故称血焉”，“有民人焉”，“有社稷焉”，“托始焉尔”，“晋、郑焉依”之类是也。江南至今行此分别，昭然易晓；而河北混同一音，虽依古读，不可行于今也。","邪者，未定之词。左传曰：“不知天之弃鲁邪？抑鲁君有罪于鬼神邪？”庄子云：“天邪地邪？”汉书云：“是邪非邪？”之类是也。而北人即呼为也，亦为误矣。难者曰：“系辞云：‘乾坤，易之门户邪？’此又为未定辞乎？”答曰：“何为不尔！上先标问，下方列德以折之耳。”","江南学士读左传，口相传述，自为凡例，军自败曰败，打破人军曰败。诸记传未见补败反，徐仙民读左传，唯一处有此音，又不言自败、败人之别，此为穿凿耳。","古人云：“膏粱难整。”以其为骄奢自足，不能克励也。吾见王侯外戚，语多不正，亦由内染贱保傅，外无良师友故耳。梁世有一侯，尝对元帝饮谑，自陈“痴钝”，乃成“飔段”，元帝答之云：“飔异凉风，段非干木。”谓“郢州”为“永州”，元帝启报简文，简文云：‘庚辰吴入，遂成司隶。”如此之类，举口皆然。元帝手教诸子侍读，以此为诫。","河北切攻字为古琮，与工、公、功三字不同，殊为僻也。比世有人名暹，自称为纤；名琨，自称为衮；名洸，自称为汪；名(素勺)，自称为獡。非唯音韵舛错，亦使其儿孙避讳纷纭矣。"]},{"title":"杂艺篇","content":["真草书迹，微须留意。江南谚云：“尺牍书疏，千里面目也”承晋宋馀俗，相与事之，故无顿狼狈者。吾幼承门业，加性爱重，所见法书亦多，而玩习功夫颇至，遂不能佳者，良由无分故也。然而此艺不须过精。夫巧者劳而智者忧，常为人所役使，更觉为累。韦仲将遗戒，深有以也。","王逸少风流才士，萧散名人，举世唯知其书，翻以能自蔽也。萧子云每叹曰：“吾著《齐书》，勒成一典，文章弘义，自谓可观，唯以笔迹得名，亦异事也。”王褒地胃清华，才学仇敏，后虽入关，亦被礼遇，犹以书工，崎岖碑碣＜间，辛苦笔砚之役，尝悔恨曰：“假使吾不知书，可不至今日邪？”以此观之，慎勿以书自命。虽然，廝猥之人，以能书拔擢者多矣。故“道不同不相为谋”也。","梁氏秘阁散逸以来，吾见二王真草多矣，家中尝得十卷，方知陶隐居、阮交州、萧祭酒诸书，莫不得羲之之体，故是书之渊源。萧晚节所变，乃右军年少时法也。","晋宋以来，多能书者，故其时俗，递相染尚，所有部帙，楷正可观，不无俗字，非为大损。至梁天监之间，斯风未变。大同之末，讹替滋生，萧子云改易字体，邵陵王颁行伪字，朝野翕然，以为楷式，画虎不成，多所伤败。至为一字，唯见数点，或妄斟酌，逐便转移。尔后坟籍，略不可看。北朝丧乱之馀，书迹鄙陋，加以专辄造字，猥拙甚於江南，乃以“百”“念”为“忧”，“言”“反”为“变”，“不”“用”为“罢”，“追”“来”为“归”，”“更”“生”为“苏”，“先”“人”为“老”，如此非一，遍满经传。唯有姚元标工於楷隶，留心小学，后生师之者众，泊于齐末，秘书缮写，贤於往日多矣。","江南闾里间有《画书赋》，乃陶隐居弟子林道士所为。其人未甚识字，轻为轨则，托名贵师，世俗传信，后生颇为所误也。","画绘之工，亦为妙矣，自古名士，多或能之。吾家尝有梁元帝手画蝉雀白团扇及马图，亦难及也。武烈太子偏能写真，坐上宾客，随宜点染，即成数人，以问童孺，皆知姓名矣。萧贲、刘孝先、刘灵，并文学已外，复佳此法。玩阅古今，特可宝爱。若官未通显，每被公私使令，亦为狠役。吴县顾士端出身湘东王国待郎，后为镇南府刑狱参军，有子曰庭，西朝中书舍人，父子并有琴、书之艺，尤妙丹青，常被元帝所使，每怀羞恨。彭城刘岳，囊之子也，仕为骠骑府管记、平氏县令，才学快士，而画绝伦。后随武陵王入蜀，下牢之败，遂为陆护军画支江寺壁，与诸工巧杂处。向使三贤都不晓画，直运素业，岂见此耻乎？","孤矢之利，以威天下，先王所以现德择贤，亦济身之急务也。江南谓世之常射，以为“兵射”，冠冕儒生，多不习此。别有“博射”，弱弓长箭，施於准的，揖让升降，以行礼焉，防御寇难，了无所益，乱离之后，此术遂亡。河北文士，率晓“兵射”，非直葛洪一箭，已解追兵，三九宴集，常縻荣赐。虽然，要轻禽，截狡兽，不愿汝辈为之。","算术亦是六艺要事。自古儒士论天道。定律历者，智学通之。然可以兼明，不可以专业。江南此学殊少，唯范阳祖恒精之，位至南康太守。河北多晚此术。","医方之事，取妙极难，不劝汝曾以自命也。微解药性，小小和合，居家得以救急，亦为胜事，皇甫谧、殷仲堪则其人也。","《礼》曰：“君子无故不彻琴瑟。”古来名士，多所爱好。洎于梁初，衣冠子孙，不知琴者，号有所阙。大同以末，斯风顿尽。然而此乐音音雅致，有深味哉！今世曲解，虽变于古，犹足以畅神情也。唯不可令有称誉，见役勋贵，处之下坐，以取残杯冷炙之辱。戴安道犹遭之，况尔曹乎！"]},{"title":"终制篇","content":["死者，人之常分，不可免也。吾年十九，值梁家丧乱，其间与白刃为伍者，亦常数辈，幸承馀福，得至於今。古人云：“五十不为夭。”吾已六十馀，故心坦然，不以残年为念。先有风气之疾，常疑奄然，聊书素怀，以为汝诫。","先君先夫人皆未还建邺旧山，旅葬江陵东郭。承圣末，已启求扬都，欲营迁靥，蒙诏赐银百两，已於扬州小郊北地烧砖。便值本朝沦没，流离如此。数十年间，绝於还望。今虽混一，家道馨穷，何由办此奉营资费？且扬都污毁，无复遗，还被下湿，未为得计。自咎自责，贯心刻髓。","孔子之葬亲也，云：“古者墓而不坟，丘东西南北之人也，不可以弗识也。”於是封之崇四尺。然则君子应世行道，亦有不守坟墓之时，况为事际所逼也。吾今羁旅，身若浮云，竟未知何乡是吾葬地，唯当气绝便埋之耳。汝曹宜以传业扬名为务，不可顾恋朽壤，以取湮没也。"]}]}